=begin
#######################################################################################################################
 ●『サキュバスロード（橙）』クライシス口上
 ●性格：好色
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 2016,07/29     仮設定
#######################################################################################################################
=end






#######################################################################################################################
######################################★クライシス：主人公がメインの口上群#############################################
#######################################################################################################################
class MsgSuccubuslord_A < MsgBase
 def msg_crisis_00
#=======================================================================================================================
# ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            tx["md"] = "3"
#----------------------------------------------------------------------------------------------------------------------
#■主人公がクライシス状態になる
case $msg.tag
#夢魔の攻めで主人公がクライシス
when "アクター単独"
  case rand(2)
  when 0
    tx["tx1"] = "「#{giggle} Looks like you're at the threshold\\H\n Leave your body to me as\n I make you surrender in pleasure....\\H」"
  when 1
    tx["tx1"] = "「#{giggle_s} Your face is in ecstasy\\H\n I want to see more of that cute expression of yours,\n so hold out as much as possible\\H」"
  end
  #格納
  ms.push(tx)
#夢魔が既にクライシス、その夢魔から攻めを受け主人公もクライシス
when "アクター両者"
  tx["tx1"] = "「#{giggle_s}……\\H Hey, your hand stopped moving, you know?\n If you don't step on it,\n I might even wring you out, #{target}....\\H」"
  #格納
  ms.push(tx)
#主人公がホールド等のリバウンドで自らクライシス
when "アクターリバウンド自爆"
  tx["tx1"] = "「Looks like I managed to pleasured you\\H\n #{giggle_s}....I'm glad for it and all, but I don't want you to be the only one satisfied.\n Make me moan as well....\\H」"
  #格納
  ms.push(tx)
#主人公が自慰行為等で自らクライシス
when "アクター自慰"
  tx["tx1"] = "「You can't take it anymore, perhaps?\n I would've let you use my body\n anytime you wanted, #{target}....\\H」"
  #格納
  ms.push(tx)
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がクライシス状態になる
#主人公の攻めで夢魔がクライシス
when "エネミー単独"
  tx["tx1"] = "「Aaannh....\\H That's so great, #{target}....\\H\n Keep going until I finish like that....\\H」"
  #格納
  ms.push(tx)
#主人公が既にクライシス、その主人公から攻めを受け夢魔もクライシス
when "エネミー両者"
  tx["tx1"] = "「#{giggle}\n　#{target}も限界なんでしょう？\n　二人で一緒に果てるのも、素敵だと思わない……？\\H」"
  #格納
  ms.push(tx)
#夢魔がホールド等のリバウンドで自らクライシス
when "エネミーリバウンド自爆"
  tx["tx1"] = "「あはっ……\\H　#{target}、我慢強いのね……\\H\n　気持ちよくしてあげようと思ったのに、\n　#{myname}が気持ちよくなっちゃったわ……\\H」"
  #格納
  ms.push(tx)
#夢魔が自慰行為等で自らクライシス
when "エネミー自慰"
  tx["tx1"] = "「あはっ……\\H　ねぇ、ちゃんと見てくれてるかしら\\H\n　#{target}に見られてこんなになってるの……\n　お願い、#{myname}の火照りを鎮めて……\\H」"
  #格納
  ms.push(tx)
#夢魔が味方夢魔から攻められてクライシス
when "エネミー仲間攻め"
  tx["tx1"] = "「こら、ちょっと、やりすぎ……はぅっ\\H\n　だめよ、せっかく#{target}がいるのに\\H\n　勝手に満足したらもったいないわ……あぁんっ\\H」"
  #格納
  ms.push(tx)
#----------------------------------------------------------------------------------------------------------------------
  end #case $msg.tag
 end #def
end #class


#######################################################################################################################
##################################★クライシス：主人公がメインの口上群（ベッドイン）###################################
#######################################################################################################################
class MsgSuccubuslord_A < MsgBase
 def msg_bedin_crisis_00
#=======================================================================================================================
# ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            tx["md"] = "3"
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("大切な人")
#====================================================================================================================
#■主人公がクライシス状態になる
case $msg.tag
#夢魔の攻めで主人公がクライシス
when "アクター単独"
  case rand(2)
  when 0
    tx["tx1"] = "「#{giggle_s}\\H　もう限界のようね\\H\n　気持ちよく降参させてあげる、\n　おとなしく身を任せなさい……\\H」"
  when 1
    tx["tx1"] = "「#{giggle_s}、お顔、蕩けてるわよ\\H\n　そのかわいい表情をもっと見ていたいわ、\n　がんばって耐えてみせてちょうだい\\H」"
  end
  #格納
  ms.push(tx)
#夢魔が既にクライシス、その夢魔から攻めを受け主人公もクライシス
when "アクター両者"
  tx["tx1"] = "「#{giggle_s}、#{target}も限界なんでしょう？\n　二人で一緒に果てるのも、素敵だと思わない……？\\H」"
  #格納
  ms.push(tx)
#主人公がホールド等のリバウンドで自らクライシス
when "アクターリバウンド自爆"
  tx["tx1"] = "「#{myname}で気持ちよくなってくれたのね\\H\n　#{giggle_s}……嬉しいけれど、一人で満足しちゃ嫌よ。\n　#{myname}のことも気持ちよくして……\\H」"
  #格納
  ms.push(tx)
#主人公が自慰行為等で自らクライシス
when "アクター自慰"
  tx["tx1"] = "「我慢できなくなっちゃったのかしら？\n　#{target}が望むなら、\n　いつだってこのカラダを使わせてあげるのに……\\H」"
  #格納
  ms.push(tx)
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がクライシス状態になる
#主人公の攻めで夢魔がクライシス
when "エネミー単独"
  tx["tx1"] = "「あぁん……\\H　#{target}、とてもいいわ……\\H\n　そのまま最後まで続けてちょうだい……\\H」"
  #格納
  ms.push(tx)
#主人公が既にクライシス、その主人公から攻めを受け夢魔もクライシス
when "エネミー両者"
  tx["tx1"] = "「#{giggle_s}……\\H　ほら、手が止まってるわよ？\n　あまりもたもたするようなら、\n　#{target}のこと、搾り取っちゃうかも……\\H」"
  #格納
  ms.push(tx)
#夢魔がホールド等のリバウンドで自らクライシス
when "エネミーリバウンド自爆"
  tx["tx1"] = "「あはっ……\\H　#{target}、我慢強いのね……\\H\n　気持ちよくしてあげようと思ったのに、\n　#{myname}が気持ちよくなっちゃったわ……\\H」"
  #格納
  ms.push(tx)
#夢魔が自慰行為等で自らクライシス
when "エネミー自慰"
  tx["tx1"] = "「あはっ……\\H　ねぇ、ちゃんと見てくれてるかしら\\H\n　#{target}に見られてこんなになってるの……\n　お願い、#{myname}の火照りを鎮めて……\\H」"
  #格納
  ms.push(tx)
#夢魔が味方夢魔から攻められてクライシス
when "エネミー仲間攻め"
  tx["tx1"] = "「こら、ちょっと、やりすぎ……はぅっ\\H\n　だめよ、せっかく#{target}がいるのに\\H\n　勝手に満足したらもったいないわ……あぁんっ\\H」"
  #格納
  ms.push(tx)
#----------------------------------------------------------------------------------------------------------------------
  end #case $msg.tag















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("寵愛")
#====================================================================================================================
#■主人公がクライシス状態になる
case $msg.tag
#夢魔の攻めで主人公がクライシス
when "アクター単独"
  case rand(2)
  when 0
    tx["tx1"] = "「#{giggle_s}\\H　もう限界のようね\\H\n　気持ちよく降参させてあげる、\n　おとなしく身を任せなさい……\\H」"
  when 1
    tx["tx1"] = "「#{giggle_s}、お顔、蕩けてるわよ\\H\n　そのかわいい表情をもっと見ていたいわ、\n　がんばって耐えてみせてちょうだい\\H」"
  end
  #格納
  ms.push(tx)
#夢魔が既にクライシス、その夢魔から攻めを受け主人公もクライシス
when "アクター両者"
  tx["tx1"] = "「#{giggle_s}、#{target}も限界なんでしょう？\n　二人で一緒に果てるのも、素敵だと思わない……？\\H」"
  #格納
  ms.push(tx)
#主人公がホールド等のリバウンドで自らクライシス
when "アクターリバウンド自爆"
  tx["tx1"] = "「#{myname}で気持ちよくなってくれたのね\\H\n　#{giggle_s}……嬉しいけれど、一人で満足しちゃ嫌よ。\n　#{myname}のことも気持ちよくして……\\H」"
  #格納
  ms.push(tx)
#主人公が自慰行為等で自らクライシス
when "アクター自慰"
  tx["tx1"] = "「我慢できなくなっちゃったのかしら？\n　#{target}が望むなら、\n　いつだってこのカラダを使わせてあげるのに……\\H」"
  #格納
  ms.push(tx)
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がクライシス状態になる
#主人公の攻めで夢魔がクライシス
when "エネミー単独"
  tx["tx1"] = "「あぁん……\\H　#{target}、とてもいいわ……\\H\n　そのまま最後まで続けてちょうだい……\\H」"
  #格納
  ms.push(tx)
#主人公が既にクライシス、その主人公から攻めを受け夢魔もクライシス
when "エネミー両者"
  tx["tx1"] = "「#{giggle_s}……\\H　ほら、手が止まってるわよ？\n　あまりもたもたするようなら、\n　#{target}のこと、搾り取っちゃうかも……\\H」"
  #格納
  ms.push(tx)
#夢魔がホールド等のリバウンドで自らクライシス
when "エネミーリバウンド自爆"
  tx["tx1"] = "「あはっ……\\H　#{target}、我慢強いのね……\\H\n　気持ちよくしてあげようと思ったのに、\n　#{myname}が気持ちよくなっちゃったわ……\\H」"
  #格納
  ms.push(tx)
#夢魔が自慰行為等で自らクライシス
when "エネミー自慰"
  tx["tx1"] = "「あはっ……\\H　ねぇ、ちゃんと見てくれてるかしら\\H\n　#{target}に見られてこんなになってるの……\n　お願い、#{myname}の火照りを鎮めて……\\H」"
  #格納
  ms.push(tx)
#夢魔が味方夢魔から攻められてクライシス
when "エネミー仲間攻め"
  tx["tx1"] = "「こら、ちょっと、やりすぎ……はぅっ\\H\n　だめよ、せっかく#{target}がいるのに\\H\n　勝手に満足したらもったいないわ……あぁんっ\\H」"
  #格納
  ms.push(tx)
#----------------------------------------------------------------------------------------------------------------------
  end #case $msg.tag














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
#■主人公がクライシス状態になる
case $msg.tag
#夢魔の攻めで主人公がクライシス
when "アクター単独"
  case rand(2)
  when 0
    tx["tx1"] = "「#{giggle_s}\\H　もう限界のようね\\H\n　気持ちよく降参させてあげる、\n　おとなしく身を任せなさい……\\H」"
  when 1
    tx["tx1"] = "「#{giggle_s}、お顔、蕩けてるわよ\\H\n　そのかわいい表情をもっと見ていたいわ、\n　がんばって耐えてみせてちょうだい\\H」"
  end
  #格納
  ms.push(tx)
#夢魔が既にクライシス、その夢魔から攻めを受け主人公もクライシス
when "アクター両者"
  tx["tx1"] = "「#{giggle_s}、#{target}も限界なんでしょう？\n　二人で一緒に果てるのも、素敵だと思わない……？\\H」"
  #格納
  ms.push(tx)
#主人公がホールド等のリバウンドで自らクライシス
when "アクターリバウンド自爆"
  tx["tx1"] = "「#{myname}で気持ちよくなってくれたのね\\H\n　#{giggle_s}……嬉しいけれど、一人で満足しちゃ嫌よ。\n　#{myname}のことも気持ちよくして……\\H」"
  #格納
  ms.push(tx)
#主人公が自慰行為等で自らクライシス
when "アクター自慰"
  tx["tx1"] = "「我慢できなくなっちゃったのかしら？\n　#{target}が望むなら、\n　いつだってこのカラダを使わせてあげるのに……\\H」"
  #格納
  ms.push(tx)
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がクライシス状態になる
#主人公の攻めで夢魔がクライシス
when "エネミー単独"
  tx["tx1"] = "「あぁん……\\H　#{target}、とてもいいわ……\\H\n　そのまま最後まで続けてちょうだい……\\H」"
  #格納
  ms.push(tx)
#主人公が既にクライシス、その主人公から攻めを受け夢魔もクライシス
when "エネミー両者"
  tx["tx1"] = "「#{giggle_s}……\\H　ほら、手が止まってるわよ？\n　あまりもたもたするようなら、\n　#{target}のこと、搾り取っちゃうかも……\\H」"
  #格納
  ms.push(tx)
#夢魔がホールド等のリバウンドで自らクライシス
when "エネミーリバウンド自爆"
  tx["tx1"] = "「あはっ……\\H　#{target}、我慢強いのね……\\H\n　気持ちよくしてあげようと思ったのに、\n　#{myname}が気持ちよくなっちゃったわ……\\H」"
  #格納
  ms.push(tx)
#夢魔が自慰行為等で自らクライシス
when "エネミー自慰"
  tx["tx1"] = "「あはっ……\\H　ねぇ、ちゃんと見てくれてるかしら\\H\n　#{target}に見られてこんなになってるの……\n　お願い、#{myname}の火照りを鎮めて……\\H」"
  #格納
  ms.push(tx)
#夢魔が味方夢魔から攻められてクライシス
when "エネミー仲間攻め"
  tx["tx1"] = "「こら、ちょっと、やりすぎ……はぅっ\\H\n　だめよ、せっかく#{target}がいるのに\\H\n　勝手に満足したらもったいないわ……あぁんっ\\H」"
  #格納
  ms.push(tx)
#----------------------------------------------------------------------------------------------------------------------
  end #case $msg.tag






#----------------------------------------------------------------------------------------------------------------------
end
 end #def
end #class
