=begin
#######################################################################################################################
 ●『インプ（緑）』レジスト実行口上（ホールド関連・対パートナー）
 ●性格：虚勢
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end





#######################################################################################################################
########################################★ホールド：パートナーがメインの口上群#############################################
#######################################################################################################################
class MsgImp_A < MsgBase
 def msg_female_hold_11
#==================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "Partner binds the succubus."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"You need to come over here\\H\""
  when 2 #ホールド成功
    tx["tx1"] = "\"Aieee, you got me♪\""
  when 3 #ホールド失敗
    tx["tx1"] = "\"Too bad♪\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Too bad♪\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "Tribadism"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Ahaha♪\n You're not gonna get me, you hear? \\H\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Annngh♪\n You got me\\H\""
    when 3 #ホールド失敗
    tx["tx1"] = "\"Too bad♪\""
      #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Too bad♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Aha, I can totally see your crotch♪\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Nmmmph?!\n Nguh, mmmph....! \\H\""
    when 3 #ホールド失敗
      tx["tx1"] = "\"Man, that surprised me!\n Geez, my head's not a chair, you know.\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"Ehehe♪\n #{myname}'ll show you mine later too\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "Dildo'ed","Mouth Dildo'ed","Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Whoa, awesome♪\n You're gonna put that in? Dunno if it can....\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Nnnahhh....!\\H\n I-It's too thick....! \\H\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"A-Anything but that!\n No way it's gonna go in!\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Right?\n I doubt that's gonna go in me.\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the user."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Huh?? You're gonna stop?\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Oh come on, why??\""
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "\"#{giggle}\n Not until #{myname} say so♪\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n Not until #{myname} say so♪\"" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the ally."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Eh, what is it, what is it?\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Geez, can't help it then.\n Then this time, you'll play with me, right?\""
      tx["md"] = "10"
    when 3 #ホールド失敗
      tx["tx1"] = "\"Save that for later♪ I'm playing right now.\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"Save that for later♪ I'm playing right now.\"" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "Succubus binds the partner."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
  when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Hmph, you got away....\""
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
    #自ら受け入れた場合
    tx["tx1"] = "\"Gotcha♪\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "Tribadism"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"I get it, #{myname}♪\n Doing it like this make you feels good, right? \\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Come on, don't run away!\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Aaannnhh\\H\n Ehehe, I hope that makes you feel feel really good♪\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Aaannnhh\\H\n Ehehe, you like it too, #{target}? ♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted","Dark-sided"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Here I go, #{target}♪\n Take this!\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Owowow, I bumped my butt....\n Gee, you shouldn't avoid it....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Aha, the horsie goes clippety-clop♪\n Kyah, no squirming, #{target}\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Aha, the horsie goes clippety-clop♪\n Kyah, no squirming, #{target}\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "Backside Bind"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
    tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
    when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Hmph, you got away....\""
    when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
      #自ら受け入れた場合
    tx["tx1"] = "\"Gotcha♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "Jiggly-Wiggly"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
    tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
    when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Hmph, you got away....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Gotcha♪\n Ehehe, so even #{myname} can do it\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Gotcha♪\n Ehehe, so even #{myname} can do it\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "Kiss"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey hey, #{target}.\n Let's have lots of smoochies\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{kiss_l}\n #{giggle}\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{kiss_l}\n #{giggle}\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "Cunnilingus"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Time to lick it up with my mouth\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Nom....mfu....\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Nom....mfu....\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "Dildo'ed","Mouth Dildo'ed","Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Hey, can I try putting this in?\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Whoa, awesome♪\n It went all the way in\\H\""
      tx["tx1"] = "\"Oh, you all right?\n Does it hurt?\"" if $msg.tag == "Mouth Dildo'ed"
      tx["tx1"] = "\"Whoa, awesome♪\n It even goes inside the butt\\H\"" if $msg.tag == "Ass Dildo'ed"
      #自ら受け入れた場合
      tx["tx1"] = "\"Whoa, awesome♪\n It went all the way in\\H\""
      tx["tx1"] = "\"Oh, you all right?\n Does it hurt?\"" if $msg.tag == "Mouth Dildo'ed"
      tx["tx1"] = "\"Whoa, awesome♪\n It even goes inside the butt\\H\"" if $msg.tag == "Ass Dildo'ed"
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class




















#######################################################################################################################
####################################★ホールド：パートナーがメインの口上群（ベッドイン）###################################
#######################################################################################################################
class MsgImp_A < MsgBase
 def msg_female_bedin_hold_11
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("Significant Other")
#====================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "Partner binds the succubus."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"You need to come over here\\H\""
  when 2 #ホールド成功
    tx["tx1"] = "\"Aieee, you got me♪\""
  when 3 #ホールド失敗
    tx["tx1"] = "\"Too bad♪\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Too bad♪\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "Tribadism"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Ahaha♪\n You wanna have some fun with me? \\H\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Annngh♪\n You got me\\H\""
    when 3 #ホールド失敗
      tx["tx1"] = "\"Ehehe, nuh-uh\\H\n But I do want to play with you♪\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"Ehehe, nuh-uh\\H\n But I do want to play with you♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Aha, I can totally see your crotch♪\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Nmmmph?!\n Nguh, mmmph....! \\H\""
    when 3 #ホールド失敗
      tx["tx1"] = "\"Man, that surprised me!\n Geez, my head's not a chair, you know.\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"Ehehe♪\n #{myname}'ll show you mine later too\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "Dildo'ed","Mouth Dildo'ed","Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Whoa, awesome♪\n You're gonna put that in? Dunno if it can....\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Nnnahhh....!\\H\n I-It's too thick....! \\H\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"A-Anything but that!\n No way it's gonna go in!\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Right?\n I doubt that's gonna go in me.\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the user."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Huh?? You're gonna stop?\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Oh come on, why??\""
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "\"#{giggle}\n Not until #{myname} say so♪\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n Not until #{myname} say so♪\"" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the ally."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Eh, what is it, what is it?\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Geez, can't help it then.\n Then this time, you'll play with me, right?\""
      tx["md"] = "10"
    when 3 #ホールド失敗
      tx["tx1"] = "\"Save that for later♪ I'm playing right now.\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"Save that for later♪ I'm playing right now.\"" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "Succubus binds the partner."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
  when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Hmph, you got away....\""
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
    #自ら受け入れた場合
    tx["tx1"] = "\"Gotcha♪\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "Tribadism"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Oomph....hup♪\n Let's feel good together\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Come on, don't run away!\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Aaannnhh\\H\n Ehehe, you like it too, #{target}? ♪\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Aaannnhh\\H\n Ehehe, you like it too, #{target}? ♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted","Dark-sided"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Here I go, #{target}♪\n Take this!\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Owowow, I bumped my butt....\n Gee, you shouldn't avoid it....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Aha, the horsie goes clippety-clop♪\n Kyah, no squirming, #{target}\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Aha, the horsie goes clippety-clop♪\n Kyah, no squirming, #{target}\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "Backside Bind"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
    tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
    when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Hmph, you got away....\""
    when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
      #自ら受け入れた場合
    tx["tx1"] = "\"Gotcha♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "Jiggly-Wiggly"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Hmph, you got away....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Gotcha♪\n Ehehe, so even #{myname} can do it\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Gotcha♪\n Ehehe, so even #{myname} can do it\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "Kiss"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey hey, #{target}.\n Let's have lots of smoochies\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{kiss_l}\n #{giggle}\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{kiss_l}\n #{giggle}\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "Cunnilingus"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Time to lick it up with my mouth\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Nom....mfu....\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Nom....mfu....\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "Dildo'ed","Mouth Dildo'ed","Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Hey, can I try putting this in?\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Whoa, awesome♪\n It went all the way in\\H\""
      tx["tx1"] = "\"Oh, you all right?\n Does it hurt?\"" if $msg.tag == "Mouth Dildo'ed"
      tx["tx1"] = "\"Whoa, awesome♪\n It even goes inside the butt\\H\"" if $msg.tag == "Ass Dildo'ed"
      #自ら受け入れた場合
      tx["tx1"] = "\"Whoa, awesome♪\n It went all the way in\\H\""
      tx["tx1"] = "\"Oh, you all right?\n Does it hurt?\"" if $msg.tag == "Mouth Dildo'ed"
      tx["tx1"] = "\"Whoa, awesome♪\n It even goes inside the butt\\H\"" if $msg.tag == "Ass Dildo'ed"
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("Affection")
#====================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "Partner binds the succubus."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"You need to come over here\\H\""
  when 2 #ホールド成功
    tx["tx1"] = "\"Aieee, you got me♪\""
  when 3 #ホールド失敗
    tx["tx1"] = "\"Too bad♪\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Too bad♪\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "Tribadism"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Ahaha♪\n You wanna have some fun with me? \\H\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Annngh♪\n You got me\\H\""
    when 3 #ホールド失敗
      tx["tx1"] = "\"Ehehe, nuh-uh\\H\n But I do want to play with you♪\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"Ehehe, nuh-uh\\H\n But I do want to play with you♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Aha, I can totally see your crotch♪\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Nmmmph?!\n Nguh, mmmph....! \\H\""
    when 3 #ホールド失敗
      tx["tx1"] = "\"Man, that surprised me!\n Geez, my head's not a chair, you know.\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"Ehehe♪\n #{myname}'ll show you mine later too\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "Dildo'ed","Mouth Dildo'ed","Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Whoa, awesome♪\n You're gonna put that in? Dunno if it can....\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Nnnahhh....!\\H\n I-It's too thick....! \\H\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"A-Anything but that!\n No way it's gonna go in!\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Right?\n I doubt that's gonna go in me.\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the user."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Huh?? You're gonna stop?\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Oh come on, why??\""
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "\"#{giggle}\n Not until #{myname} say so♪\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n Not until #{myname} say so♪\"" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the ally."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Eh, what is it, what is it?\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Geez, can't help it then.\n Then this time, you'll play with me, right?\""
      tx["md"] = "10"
    when 3 #ホールド失敗
      tx["tx1"] = "\"Save that for later♪ I'm playing right now.\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"Save that for later♪ I'm playing right now.\"" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "Succubus binds the partner."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
  when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Hmph, you got away....\""
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
    #自ら受け入れた場合
    tx["tx1"] = "\"Gotcha♪\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "Tribadism"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Oomph....hup♪\n Let's feel good together\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Come on, don't run away!\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Aaannnhh\\H\n Ehehe, you like it too, #{target}? ♪\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Aaannnhh\\H\n Ehehe, you like it too, #{target}? ♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted","Dark-sided"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Here I go, #{target}♪\n Take this!\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Owowow, I bumped my butt....\n Gee, you shouldn't avoid it....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Aha, the horsie goes clippety-clop♪\n Kyah, no squirming, #{target}\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Aha, the horsie goes clippety-clop♪\n Kyah, no squirming, #{target}\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "Backside Bind"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
    tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
    when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Hmph, you got away....\""
    when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
      #自ら受け入れた場合
    tx["tx1"] = "\"Gotcha♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "Jiggly-Wiggly"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Hmph, you got away....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Gotcha♪\n Ehehe, so even #{myname} can do it\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Gotcha♪\n Ehehe, so even #{myname} can do it\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "Kiss"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey hey, #{target}.\n Let's have lots of smoochies\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{kiss_l}\n #{giggle}\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{kiss_l}\n #{giggle}\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "Cunnilingus"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Time to lick it up with my mouth\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Nom....mfu....\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Nom....mfu....\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "Dildo'ed","Mouth Dildo'ed","Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Hey, can I try putting this in?\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Whoa, awesome♪\n It went all the way in\\H\""
      tx["tx1"] = "\"Oh, you all right?\n Does it hurt?\"" if $msg.tag == "Mouth Dildo'ed"
      tx["tx1"] = "\"Whoa, awesome♪\n It even goes inside the butt\\H\"" if $msg.tag == "Ass Dildo'ed"
      #自ら受け入れた場合
      tx["tx1"] = "\"Whoa, awesome♪\n It went all the way in\\H\""
      tx["tx1"] = "\"Oh, you all right?\n Does it hurt?\"" if $msg.tag == "Mouth Dildo'ed"
      tx["tx1"] = "\"Whoa, awesome♪\n It even goes inside the butt\\H\"" if $msg.tag == "Ass Dildo'ed"
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "Partner binds the succubus."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"You need to come over here\\H\""
  when 2 #ホールド成功
    tx["tx1"] = "\"Aieee, you got me♪\""
  when 3 #ホールド失敗
    tx["tx1"] = "\"Too bad♪\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Too bad♪\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "Tribadism"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Ahaha♪\n You wanna have some fun with me? \\H\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Annngh♪\n You got me\\H\""
    when 3 #ホールド失敗
      tx["tx1"] = "\"Ehehe, nuh-uh\\H\n But I do want to play with you♪\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"Ehehe, nuh-uh\\H\n But I do want to play with you♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Aha, I can totally see your crotch♪\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Nmmmph?!\n Nguh, mmmph....! \\H\""
    when 3 #ホールド失敗
      tx["tx1"] = "\"Man, that surprised me!\n Geez, my head's not a chair, you know.\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"Ehehe♪\n #{myname}'ll show you mine later too\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "Dildo'ed","Mouth Dildo'ed","Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Whoa, awesome♪\n You're gonna put that in? Dunno if it can....\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Nnnahhh....!\\H\n I-It's too thick....! \\H\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"A-Anything but that!\n No way it's gonna go in!\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Right?\n I doubt that's gonna go in me.\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the user."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Huh?? You're gonna stop?\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Oh come on, why??\""
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "\"#{giggle}\n Not until #{myname} say so♪\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n Not until #{myname} say so♪\"" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the ally."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Eh, what is it, what is it?\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Geez, can't help it then.\n Then this time, you'll play with me, right?\""
      tx["md"] = "10"
    when 3 #ホールド失敗
      tx["tx1"] = "\"Save that for later♪ I'm playing right now.\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"Save that for later♪ I'm playing right now.\"" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "Succubus binds the partner."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
  when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Hmph, you got away....\""
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
    #自ら受け入れた場合
    tx["tx1"] = "\"Gotcha♪\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "Tribadism"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Oomph....hup♪\n Let's feel good together\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Come on, don't run away!\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Aaannnhh\\H\n Ehehe, you like it too, #{target}? ♪\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Aaannnhh\\H\n Ehehe, you like it too, #{target}? ♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted","Dark-sided"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Here I go, #{target}♪\n Take this!\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Owowow, I bumped my butt....\n Gee, you shouldn't avoid it....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Aha, the horsie goes clippety-clop♪\n Kyah, no squirming, #{target}\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Aha, the horsie goes clippety-clop♪\n Kyah, no squirming, #{target}\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "Backside Bind"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
    tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
    when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Hmph, you got away....\""
    when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
      #自ら受け入れた場合
    tx["tx1"] = "\"Gotcha♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "Jiggly-Wiggly"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Hmph, you got away....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Gotcha♪\n Ehehe, so even #{myname} can do it\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Gotcha♪\n Ehehe, so even #{myname} can do it\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "Kiss"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey hey, #{target}.\n Let's have lots of smoochies\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{kiss_l}\n #{giggle}\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{kiss_l}\n #{giggle}\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "Cunnilingus"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Time to lick it up with my mouth\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Nom....mfu....\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Nom....mfu....\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "Dildo'ed","Mouth Dildo'ed","Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Hey, can I try putting this in?\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Whoa, awesome♪\n It went all the way in\\H\""
      tx["tx1"] = "\"Oh, you all right?\n Does it hurt?\"" if $msg.tag == "Mouth Dildo'ed"
      tx["tx1"] = "\"Whoa, awesome♪\n It even goes inside the butt\\H\"" if $msg.tag == "Ass Dildo'ed"
      #自ら受け入れた場合
      tx["tx1"] = "\"Whoa, awesome♪\n It went all the way in\\H\""
      tx["tx1"] = "\"Oh, you all right?\n Does it hurt?\"" if $msg.tag == "Mouth Dildo'ed"
      tx["tx1"] = "\"Whoa, awesome♪\n It even goes inside the butt\\H\"" if $msg.tag == "Ass Dildo'ed"
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
end #ability
 end #def
end #class
