=begin
#######################################################################################################################
 ●『レッサーサキュバス（橙）』戦闘開始、終了口上
 ●性格：陽気
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end


class MsgLessersuccubus_A < MsgBase
 def msg_op_and_ep_07
#=======================================================================================================================
# ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
#----------------------------------------------------------------------------------------------------------------------
if $msg.tag == "戦闘開始"
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            if $game_switches[85] == true
                              tx["md"] = "12" if $msg.talk_step == 1
                              tx["md"] = "12" if $msg.talk_step == 2
                              tx["md"] = "12" if $msg.talk_step == 3
                              tx["md"] = "14" if $msg.talk_step == 1 and $msg.t_enemy.bedin_count == 0
                              tx["md"] = "14" if $msg.talk_step == 2 and $msg.t_enemy.bedin_count == 0
                              tx["md"] = "14" if $msg.talk_step == 3 and $msg.t_enemy.bedin_count == 0
                            elsif $game_switches[86] == true
                              tx["md"] = "0"
                            else
                              tx["md"] = "13" if $msg.talk_step == 1
                              tx["md"] = "12" if $msg.talk_step == 2
                              tx["md"] = "11" if $msg.talk_step == 3
                            end
  #----------------------------------------------------------------------------------------------------------------------
  #●ベッドイン中
  if $game_switches[85] == true
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「それ～っ♪\n　#{target}をたべちゃうぞ～\\H」"
      #▼初ベッドイン
      tx["tx1"] = "「えーと……その……。\n　改まってすると、ちょっぴり緊張するね……\\H」" if $msg.t_enemy.bedin_count == 0
    when 1 #２番目
      tx["tx1"] = "「#{giggle}\n　今日は何を試してみようかなぁ……♪」"
      #▼初ベッドイン
      tx["tx1"] = "「#{giggle}\n　ここでするのは初めてだね……\\H」" if $msg.t_enemy.bedin_count == 0
    when 2 #３番目
      tx["tx1"] = "「#{giggle}\n　今夜もいっぱい気持ちよくなろうね\\H」"
      #▼初ベッドイン
      tx["tx1"] = "「#{giggle}\n　いつもと場所が違うからかな、\n　ちょっと照れちゃう……\\H」" if $msg.t_enemy.bedin_count == 0
    end
  #●空腹戦闘中
  elsif $game_switches[86] == true
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「#{giggle}\n　少しくらい吸っても大丈夫だよね。\n　ね、#{target}……？\\H」"
    when 1 #２番目
      tx["tx1"] = "「んもぉ……\\H\n　#{myname}にも残しておいてよね……？」"
    when 2 #３番目
      tx["tx1"] = "「気持ちいいことするだけだから……\\H\n　ちょっとだけ大人しくしててねぇ♪」"
    end
  #●レア戦闘中(OFEの場合は[$game_switches[92] == true]、BOSSの場合は[$game_switches[91] == true]をそれぞれelsifでつけること)
  else
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「ねぇねぇ、#{myname}たちと一緒に遊びましょ\\H」"
    when 1 #２番目
      tx["tx1"] = "「案外迷子だったりしてね～？\n　大丈夫？#{myname}たちが案内してあげよっか？」"
    when 2 #３番目
      tx["tx1"] = "「わ、わ、久しぶりの男の子だ！\n　どきどき……\\H」"
    end
  end
  #格納
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
#■逃走失敗口上
elsif $msg.tag == "逃走失敗"
  tx["tx1"] = "「あはっ、つかまえた～♪\n　もっと#{myname}と遊んでよ、#{target}\\H」"
  #----------------------------------------------------------------------------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
#■契約口上
elsif $msg.tag == "契約"
  #----------------------#
  #▼ステップで状況判断  #
  #----------------------#
  case $msg.talk_step
  #▼契約開始
  when 1 
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「あはぁ……楽しかったぁ♪\n　でも#{target}とはここでお別れかぁ……」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「……ねぇ#{target}、\n　#{myname}が一緒に着いて行く、って言ったら……\n　どうする？」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約締結(即座に仲間に入る)
  when 2
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「え……本当？！\n　いいの？本当に着いてっちゃうよ？！\n　……やったぁ、嬉しい♪」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「えへへ……\\H\n　今後とも、よろしく……ね\\H」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約締結(ホームに送る)
  when 3
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「え……本当？！\n　いいの？本当に着いてっちゃうよ？！\n　……やったぁ、嬉しい♪」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「あ、でもお友達が一杯なんだね。\n　それじゃ、#{target}のおうちに行ってようかな。\n　早く帰ってきてね、待ってるから♪」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約を行わない
  when 4
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「あはっ……そうだよね～。\n　ちょっとだけ、本気だったんだけど……ね？」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「それじゃ#{target}、また会おうね。\n　約束だからね～！」"
    #----------------------------------------------------------------------------------------------------------------------
  end
  #格納
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
end
#######################################################################################################################
 end #def
end #class
