=begin
#######################################################################################################################
 ●『レッサーサキュバス（橙）』追撃口上（対主人公・ベッドイン中）
 ●性格：陽気
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end






#######################################################################################################################
######################################★追撃：主人公への追撃を行う口上群###############################################
#######################################################################################################################
class MsgLessersuccubus_A < MsgBase 
 def msg_bedin_attack_07
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("大切な人")
#====================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「あはっ、気に入ってくれたぁ？\n　それじゃもっとしてあげる\\H」"
  tx["tx1"] = "「気持ちよくなってくれてるかな？\\H\n　ほらほら、こんなのはどう？\\H」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「うふっ、もっと#{myname}で感じてね……\\H」" if $game_variables[17] > 70 #パターンC
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「うふふ、すっかり気に入ったみたいだね\\H\n　それじゃ、いっぱいしてあげちゃう\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「気持ちよくなってくれてるかな？\\H\n　ほらほら、こんなのはどう？\\H」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス パターンB
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_type
#▼キス▼****************************************************************************************
when "キス"
  tx["tx1"] = "「んっ……ちゅっ……\\H\n　うふふ、もっとキス、しよ……\\H」"
  tx["tx1"] = "「ちゅっ……ん…っ……\\H\n　うふっ、#{target}もキスは好きみたいだね？\n　こんなにとろけた顔しちゃって……\\H」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「んっ……ちゅ……ちゅっ……\\H\n　うふっ、もっと#{myname}を感じてね……\\H」" if $game_variables[17] > 70 #パターンC
  tx["tx1"] = "「んっ……ふぅ……\\H\n　ね、#{target}、もっとキスしてぇ……\\H」" if $msg.t_enemy.crisis?
  tx["tx1"] = "「ちゅっ……ん…っ……\\H\n　ね、もっと舌、絡めて……\\H\n　ふぅ…っ…れろ…れろぉ……\\H」" if $msg.t_enemy.crisis? and $game_variables[17] > 50 #パターンB
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼手攻め▼****************************************************************************************
when "手"
  tx["tx1"] = "「あはっ、今ぴくってしたぁ\\H\n　ここが弱いのかなぁ～？\\H」"
  tx["tx1"] = "「うふふっ、#{target}の弱いとこ見っけ♪\n　どこまで我慢できるかなぁ？」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「うふっ、もっと#{myname}で感じてね……\\H」" if $game_variables[17] > 70 #パターンC
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「あはっ、こらえてもダメだよ#{target}～？\n　もう弱いところはわかったもんね～\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「ふふっ、我慢してる#{target}も可愛い\\H\n　もっといじめたくなっちゃうなぁ～♪」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス パターンB
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼口攻め▼****************************************************************************************
when "口"
  tx["tx1"] = "「あはっ、今ぴくってしたぁ\\H\n　ここが弱いのかなぁ～？\\H」"
  tx["tx1"] = "「うふふっ、#{target}の弱いとこ見っけ♪\n　どこまで我慢できるかなぁ？」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「うふっ、もっと#{myname}で感じてね……\\H」" if $game_variables[17] > 70 #パターンC
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「あはっ、こらえてもダメだよ#{target}～？\n　もう弱いところはわかったもんね～\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「ふふっ、我慢してる#{target}も可愛い\\H\n　もっといじめたくなっちゃうなぁ～♪」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス パターンB
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼胸攻め▼****************************************************************************************
when "胸"
  case $msg.at_parts
  when "対象：ペニス" #パイズリ
  tx["tx1"] = "「あはっ、今ぴくってしたぁ\\H\n　ここが弱いのかなぁ～？\\H」"
  tx["tx1"] = "「うふふっ、#{target}の弱いとこ見っけ♪\n　どこまで我慢できるかなぁ？」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「うふっ、もっと#{myname}で感じてね……\\H」" if $game_variables[17] > 70 #パターンC
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「あはっ、こらえてもダメだよ#{target}～？\n　もう弱いところはわかったもんね～\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「ふふっ、我慢してる#{target}も可愛い\\H\n　もっといじめたくなっちゃうなぁ～♪」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス パターンB
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  when "対象：口" #ぱふぱふ
 #  tx["tx1"] = ""
 #  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
 #  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
 #  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  end
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼アソコ攻め▼****************************************************************************************
when "♀" #素股
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼足攻め▼****************************************************************************************
when "足" #足コキ
#  tx["tx1"] = ""
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ホールド援護▼****************************************************************************************
when "ホールド援護"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.at_parts == "対象：口" #援護キッス
#  tx["tx1"] = "" if $msg.at_parts == "対象：ペニス" #援護ペニス攻め
#  tx["tx1"] = "" if $msg.at_parts == "対象：睾丸" #援護睾丸攻め
#  tx["tx1"] = "" if $msg.at_parts == "対象：尻" #援護尻攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_parts















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("寵愛")
#====================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「あはっ、気に入ってくれたぁ？\n　それじゃもっとしてあげる\\H」"
  tx["tx1"] = "「気持ちよくなってくれてるかな？\\H\n　ほらほら、こんなのはどう？\\H」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「うふっ、もっと#{myname}で感じてね……\\H」" if $game_variables[17] > 70 #パターンC
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「うふふ、すっかり気に入ったみたいだね\\H\n　それじゃ、いっぱいしてあげちゃう\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「気持ちよくなってくれてるかな？\\H\n　ほらほら、こんなのはどう？\\H」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス パターンB
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_type
#▼キス▼****************************************************************************************
when "キス"
  tx["tx1"] = "「んっ……ちゅっ……\\H\n　うふふ、もっとキス、しよ……\\H」"
  tx["tx1"] = "「ちゅっ……ん…っ……\\H\n　うふっ、#{target}もキスは好きみたいだね？\n　こんなにとろけた顔しちゃって……\\H」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「んっ……ちゅ……ちゅっ……\\H\n　うふっ、もっと#{myname}を感じてね……\\H」" if $game_variables[17] > 70 #パターンC
  tx["tx1"] = "「んっ……ふぅ……\\H\n　ね、#{target}、もっとキスしてぇ……\\H」" if $msg.t_enemy.crisis?
  tx["tx1"] = "「ちゅっ……ん…っ……\\H\n　ね、もっと舌、絡めて……\\H\n　ふぅ…っ…れろ…れろぉ……\\H」" if $msg.t_enemy.crisis? and $game_variables[17] > 50 #パターンB
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼手攻め▼****************************************************************************************
when "手"
  tx["tx1"] = "「あはっ、今ぴくってしたぁ\\H\n　ここが弱いのかなぁ～？\\H」"
  tx["tx1"] = "「うふふっ、#{target}の弱いとこ見っけ♪\n　どこまで我慢できるかなぁ？」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「うふっ、もっと#{myname}で感じてね……\\H」" if $game_variables[17] > 70 #パターンC
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「あはっ、こらえてもダメだよ#{target}～？\n　もう弱いところはわかったもんね～\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「ふふっ、我慢してる#{target}も可愛い\\H\n　もっといじめたくなっちゃうなぁ～♪」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス パターンB
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼口攻め▼****************************************************************************************
when "口"
  tx["tx1"] = "「あはっ、今ぴくってしたぁ\\H\n　ここが弱いのかなぁ～？\\H」"
  tx["tx1"] = "「うふふっ、#{target}の弱いとこ見っけ♪\n　どこまで我慢できるかなぁ？」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「うふっ、もっと#{myname}で感じてね……\\H」" if $game_variables[17] > 70 #パターンC
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「あはっ、こらえてもダメだよ#{target}～？\n　もう弱いところはわかったもんね～\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「ふふっ、我慢してる#{target}も可愛い\\H\n　もっといじめたくなっちゃうなぁ～♪」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス パターンB
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼胸攻め▼****************************************************************************************
when "胸"
  case $msg.at_parts
  when "対象：ペニス" #パイズリ
  tx["tx1"] = "「あはっ、今ぴくってしたぁ\\H\n　ここが弱いのかなぁ～？\\H」"
  tx["tx1"] = "「うふふっ、#{target}の弱いとこ見っけ♪\n　どこまで我慢できるかなぁ？」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「うふっ、もっと#{myname}で感じてね……\\H」" if $game_variables[17] > 70 #パターンC
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「あはっ、こらえてもダメだよ#{target}～？\n　もう弱いところはわかったもんね～\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「ふふっ、我慢してる#{target}も可愛い\\H\n　もっといじめたくなっちゃうなぁ～♪」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス パターンB
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  when "対象：口" #ぱふぱふ
 #  tx["tx1"] = ""
 #  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
 #  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
 #  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  end
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼アソコ攻め▼****************************************************************************************
when "♀" #素股
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼足攻め▼****************************************************************************************
when "足" #足コキ
#  tx["tx1"] = ""
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ホールド援護▼****************************************************************************************
when "ホールド援護"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.at_parts == "対象：口" #援護キッス
#  tx["tx1"] = "" if $msg.at_parts == "対象：ペニス" #援護ペニス攻め
#  tx["tx1"] = "" if $msg.at_parts == "対象：睾丸" #援護睾丸攻め
#  tx["tx1"] = "" if $msg.at_parts == "対象：尻" #援護尻攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_parts














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「あはっ、気に入ってくれたぁ？\n　それじゃもっとしてあげる\\H」"
  tx["tx1"] = "「気持ちよくなってくれてるかな？\\H\n　ほらほら、こんなのはどう？\\H」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「うふっ、もっと#{myname}で感じてね……\\H」" if $game_variables[17] > 70 #パターンC
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「うふふ、すっかり気に入ったみたいだね\\H\n　それじゃ、いっぱいしてあげちゃう\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「気持ちよくなってくれてるかな？\\H\n　ほらほら、こんなのはどう？\\H」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス パターンB
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_type
#▼キス▼****************************************************************************************
when "キス"
  tx["tx1"] = "「んっ……ちゅっ……\\H\n　うふふ、もっとキス、しよ……\\H」"
  tx["tx1"] = "「ちゅっ……ん…っ……\\H\n　うふっ、#{target}もキスは好きみたいだね？\n　こんなにとろけた顔しちゃって……\\H」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「んっ……ちゅ……ちゅっ……\\H\n　うふっ、もっと#{myname}を感じてね……\\H」" if $game_variables[17] > 70 #パターンC
  tx["tx1"] = "「んっ……ふぅ……\\H\n　ね、#{target}、もっとキスしてぇ……\\H」" if $msg.t_enemy.crisis?
  tx["tx1"] = "「ちゅっ……ん…っ……\\H\n　ね、もっと舌、絡めて……\\H\n　ふぅ…っ…れろ…れろぉ……\\H」" if $msg.t_enemy.crisis? and $game_variables[17] > 50 #パターンB
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼手攻め▼****************************************************************************************
when "手"
  tx["tx1"] = "「あはっ、今ぴくってしたぁ\\H\n　ここが弱いのかなぁ～？\\H」"
  tx["tx1"] = "「うふふっ、#{target}の弱いとこ見っけ♪\n　どこまで我慢できるかなぁ？」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「うふっ、もっと#{myname}で感じてね……\\H」" if $game_variables[17] > 70 #パターンC
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「あはっ、こらえてもダメだよ#{target}～？\n　もう弱いところはわかったもんね～\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「ふふっ、我慢してる#{target}も可愛い\\H\n　もっといじめたくなっちゃうなぁ～♪」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス パターンB
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼口攻め▼****************************************************************************************
when "口"
  tx["tx1"] = "「あはっ、今ぴくってしたぁ\\H\n　ここが弱いのかなぁ～？\\H」"
  tx["tx1"] = "「うふふっ、#{target}の弱いとこ見っけ♪\n　どこまで我慢できるかなぁ？」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「うふっ、もっと#{myname}で感じてね……\\H」" if $game_variables[17] > 70 #パターンC
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「あはっ、こらえてもダメだよ#{target}～？\n　もう弱いところはわかったもんね～\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「ふふっ、我慢してる#{target}も可愛い\\H\n　もっといじめたくなっちゃうなぁ～♪」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス パターンB
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼胸攻め▼****************************************************************************************
when "胸"
  case $msg.at_parts
  when "対象：ペニス" #パイズリ
  tx["tx1"] = "「あはっ、今ぴくってしたぁ\\H\n　ここが弱いのかなぁ～？\\H」"
  tx["tx1"] = "「うふふっ、#{target}の弱いとこ見っけ♪\n　どこまで我慢できるかなぁ？」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「うふっ、もっと#{myname}で感じてね……\\H」" if $game_variables[17] > 70 #パターンC
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「あはっ、こらえてもダメだよ#{target}～？\n　もう弱いところはわかったもんね～\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「ふふっ、我慢してる#{target}も可愛い\\H\n　もっといじめたくなっちゃうなぁ～♪」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス パターンB
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  when "対象：口" #ぱふぱふ
 #  tx["tx1"] = ""
 #  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
 #  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
 #  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  end
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼アソコ攻め▼****************************************************************************************
when "♀" #素股
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼足攻め▼****************************************************************************************
when "足" #足コキ
#  tx["tx1"] = ""
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ホールド援護▼****************************************************************************************
when "ホールド援護"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.at_parts == "対象：口" #援護キッス
#  tx["tx1"] = "" if $msg.at_parts == "対象：ペニス" #援護ペニス攻め
#  tx["tx1"] = "" if $msg.at_parts == "対象：睾丸" #援護睾丸攻め
#  tx["tx1"] = "" if $msg.at_parts == "対象：尻" #援護尻攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_parts






end
#====================================================================================================================
 end #def
end #class




















#######################################################################################################################
######################################★追撃：主人公への追撃を行う口上群###############################################
#######################################################################################################################
class MsgLessersuccubus_A < MsgBase 
 def msg_bedin_attack_hold_07
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("大切な人")
#====================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「#{target}、気持ちいい？\n　こんなのはどうかなぁ？」"
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「うふふ、すっかり気に入ったみたいだね\\H\n　それじゃ、いっぱいしてあげちゃう\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_parts
#▼インサート(♀)▼****************************************************************************************
when "♀挿入：アソコ側"
  tx["tx1"] = "「#{target}、気持ちいい？\n　こんなのはどうかなぁ？」"
  tx["tx1"] = "「あはっ、気に入ってくれたぁ？\n　それじゃもっとしてあげる\\H」" if $game_variables[17] > 50 
  tx["tx1"] = "「もっと腰振って、#{myname}を突き上げてぇ\\H\n　嫌なら、#{myname}が動いちゃうよぉ？\\H」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス
  tx["tx1"] = "「んふふ、もう余裕無くなっちゃった？\n　でも止めてあ～げない♪」" if $msg.t_target.crisis? and $game_variables[17] > 35 #対象がクライシスパターンB
  tx["tx1"] = "「あはっ……なんだか楽しくなって来ちゃった♪\n　ね、もっと腰を突き上げてぇ\\H」" if $msg.t_target.crisis? and $game_variables[17] > 70 #対象がクライシスパターンB
  tx["tx1"] = "「あはっ…さっきイったばっかりなのに、\n　#{target}の、こんなに硬ぁい……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼顔面騎乗▼****************************************************************************************
when "騎乗：アソコ側"
  tx["tx1"] = "「イイ匂いでしょ？\\H\n　もっと嗅いでいいんだよぉ\\H」"
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ぱふぱふ▼****************************************************************************************
when "ぱふぱふ"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼パイズリ▼****************************************************************************************
when "パイズリ"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼尻ディルド攻め▼****************************************************************************************
when "ディルド尻挿入"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼キッス▼****************************************************************************************
when "キッス"
  tx["tx1"] = "「#{kiss_l}」"
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_parts















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("寵愛")
#====================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「#{target}、気持ちいい？\n　こんなのはどうかなぁ？」"
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「うふふ、すっかり気に入ったみたいだね\\H\n　それじゃ、いっぱいしてあげちゃう\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_parts
#▼インサート(♀)▼****************************************************************************************
when "♀挿入：アソコ側"
  tx["tx1"] = "「#{target}、気持ちいい？\n　こんなのはどうかなぁ？」"
  tx["tx1"] = "「あはっ、気に入ってくれたぁ？\n　それじゃもっとしてあげる\\H」" if $game_variables[17] > 50 
  tx["tx1"] = "「もっと腰振って、#{myname}を突き上げてぇ\\H\n　嫌なら、#{myname}が動いちゃうよぉ？\\H」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス
  tx["tx1"] = "「んふふ、もう余裕無くなっちゃった？\n　でも止めてあ～げない♪」" if $msg.t_target.crisis? and $game_variables[17] > 35 #対象がクライシスパターンB
  tx["tx1"] = "「あはっ……なんだか楽しくなって来ちゃった♪\n　ね、もっと腰を突き上げてぇ\\H」" if $msg.t_target.crisis? and $game_variables[17] > 70 #対象がクライシスパターンB
  tx["tx1"] = "「あはっ…さっきイったばっかりなのに、\n　#{target}の、こんなに硬ぁい……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼顔面騎乗▼****************************************************************************************
when "騎乗：アソコ側"
  tx["tx1"] = "「イイ匂いでしょ？\\H\n　もっと嗅いでいいんだよぉ\\H」"
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ぱふぱふ▼****************************************************************************************
when "ぱふぱふ"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼パイズリ▼****************************************************************************************
when "パイズリ"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼尻ディルド攻め▼****************************************************************************************
when "ディルド尻挿入"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼キッス▼****************************************************************************************
when "キッス"
  tx["tx1"] = "「#{kiss_l}」"
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_parts














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「#{target}、気持ちいい？\n　こんなのはどうかなぁ？」"
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「うふふ、すっかり気に入ったみたいだね\\H\n　それじゃ、いっぱいしてあげちゃう\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_parts
#▼インサート(♀)▼****************************************************************************************
when "♀挿入：アソコ側"
  tx["tx1"] = "「#{target}、気持ちいい？\n　こんなのはどうかなぁ？」"
  tx["tx1"] = "「あはっ、気に入ってくれたぁ？\n　それじゃもっとしてあげる\\H」" if $game_variables[17] > 50 
  tx["tx1"] = "「もっと腰振って、#{myname}を突き上げてぇ\\H\n　嫌なら、#{myname}が動いちゃうよぉ？\\H」" if $msg.t_target.crisis? and $game_variables[17] > 50 #対象がクライシス
  tx["tx1"] = "「んふふ、もう余裕無くなっちゃった？\n　でも止めてあ～げない♪」" if $msg.t_target.crisis? and $game_variables[17] > 35 #対象がクライシスパターンB
  tx["tx1"] = "「あはっ……なんだか楽しくなって来ちゃった♪\n　ね、もっと腰を突き上げてぇ\\H」" if $msg.t_target.crisis? and $game_variables[17] > 70 #対象がクライシスパターンB
  tx["tx1"] = "「あはっ…さっきイったばっかりなのに、\n　#{target}の、こんなに硬ぁい……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼顔面騎乗▼****************************************************************************************
when "騎乗：アソコ側"
  tx["tx1"] = "「イイ匂いでしょ？\\H\n　もっと嗅いでいいんだよぉ\\H」"
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ぱふぱふ▼****************************************************************************************
when "ぱふぱふ"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼パイズリ▼****************************************************************************************
when "パイズリ"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼尻ディルド攻め▼****************************************************************************************
when "ディルド尻挿入"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼キッス▼****************************************************************************************
when "キッス"
  tx["tx1"] = "「#{kiss_l}」"
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_parts





end
#====================================================================================================================
 end #def
end #class




















#######################################################################################################################
######################################★追撃：主人公への追撃を行う口上群###############################################
#######################################################################################################################
class MsgLessersuccubus_A < MsgBase 
 def msg_bedin_attack_self_07
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("大切な人")
#====================================================================================================================
#==================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「そ、そこダメっ！\n　あぁんっ\\H」"
#  tx["tx1"] = "「#{pleasure_cr}」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{pleasure_cr}」" if $msg.t_enemy.weaken? #自分が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_type
#▼キッス▼****************************************************************************************
when "キッス"
  tx["tx1"] = "「あはぁ……ん……ちゅっ……\\H\n　#{target}、キス上手すぎだよぉ……\\H\n　んんっ…？！……ぷぁ…っ……\\H」"
  tx["tx1"] = "「あ……ぁはぁ……\\H\n　もっとぉ……もっとキスしてぇ……\\H\n　んふ…っ……ちゅっ……んっ……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼バスト▼****************************************************************************************
when "バスト"
  tx["tx1"] = "「あぁんっ、\n　そんなにおっぱい弄っちゃダメぇ……っ\\H」"
  tx["tx1"] = "「ダメ、ダメぇっ……！\n　おっぱい感じ過ぎちゃうっ……！\\H」" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「はぅ…はぅぅ……\n　も、もうおっぱいは許してぇ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ヒップ▼****************************************************************************************
when "ヒップ"
  tx["tx1"] = "「ひぃん…っ\\H\n　そ、そこは弄っちゃやだよぉ…！」"
  tx["tx1"] = "「な、なんでぇ……？\n　お尻で気持ちよくなっちゃう……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「ひぃん…っ……\\H\n　も、もうお尻は許してぇ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼クロッチ▼****************************************************************************************
when "クロッチ"
  if $msg.t_enemy.nude?
    tx["tx1"] = "「あぁんっ……\\H\n　そんな奥まで弄っちゃ…っ……\\H」"
    tx["tx1"] = "「や、やだぁ…っ……\\H\n　気持ちよすぎるよぉ……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
    tx["tx1"] = "「あぁん…っ……\\H\n　も、もう許してぇ…っ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  else
    tx["tx1"] = "「いやぁん……\\H\n　染みになっちゃうよぉ……\\H」" # 対象が着衣状態の時
    tx["tx1"] = "「あはぁ…っ\\H\n　も、もうそこはいいからぁ…！んくぅ……っ！\\H」" if $msg.t_enemy.crisis? #自分がクライシス 対象が着衣状態の時
    tx["tx1"] = "「あぁん…っ……\\H\n　も、もう弄っちゃやぁ…っ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中 対象が着衣状態の時
  end
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼スウィング系▼****************************************************************************************
when "スウィング","ヘヴィスウィング"
  tx["tx1"] = "「いいっ！　いいよぉ…っ！\\H\n　もっと気持ちよくしてぇっ…！\\H」"
  tx["tx1"] = "「やっ、やぁっ…それ感じ過ぎちゃうっ…！\\H\n　ふあぁぁんっ！\\H」" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「あはぁぁっ！\\H\n　ふ、深すぎるよぉ…っ！\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_type















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("寵愛")
#====================================================================================================================
#==================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「そ、そこダメっ！\n　あぁんっ\\H」"
#  tx["tx1"] = "「#{pleasure_cr}」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{pleasure_cr}」" if $msg.t_enemy.weaken? #自分が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_type
#▼キッス▼****************************************************************************************
when "キッス"
  tx["tx1"] = "「あはぁ……ん……ちゅっ……\\H\n　#{target}、キス上手すぎだよぉ……\\H\n　んんっ…？！……ぷぁ…っ……\\H」"
  tx["tx1"] = "「あ……ぁはぁ……\\H\n　もっとぉ……もっとキスしてぇ……\\H\n　んふ…っ……ちゅっ……んっ……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼バスト▼****************************************************************************************
when "バスト"
  tx["tx1"] = "「あぁんっ、\n　そんなにおっぱい弄っちゃダメぇ……っ\\H」"
  tx["tx1"] = "「ダメ、ダメぇっ……！\n　おっぱい感じ過ぎちゃうっ……！\\H」" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「はぅ…はぅぅ……\n　も、もうおっぱいは許してぇ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ヒップ▼****************************************************************************************
when "ヒップ"
  tx["tx1"] = "「ひぃん…っ\\H\n　そ、そこは弄っちゃやだよぉ…！」"
  tx["tx1"] = "「な、なんでぇ……？\n　お尻で気持ちよくなっちゃう……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「ひぃん…っ……\\H\n　も、もうお尻は許してぇ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼クロッチ▼****************************************************************************************
when "クロッチ"
  if $msg.t_enemy.nude?
    tx["tx1"] = "「あぁんっ……\\H\n　そんな奥まで弄っちゃ…っ……\\H」"
    tx["tx1"] = "「や、やだぁ…っ……\\H\n　気持ちよすぎるよぉ……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
    tx["tx1"] = "「あぁん…っ……\\H\n　も、もう許してぇ…っ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  else
    tx["tx1"] = "「いやぁん……\\H\n　染みになっちゃうよぉ……\\H」" # 対象が着衣状態の時
    tx["tx1"] = "「あはぁ…っ\\H\n　も、もうそこはいいからぁ…！んくぅ……っ！\\H」" if $msg.t_enemy.crisis? #自分がクライシス 対象が着衣状態の時
    tx["tx1"] = "「あぁん…っ……\\H\n　も、もう弄っちゃやぁ…っ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中 対象が着衣状態の時
  end
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼スウィング系▼****************************************************************************************
when "スウィング","ヘヴィスウィング"
  tx["tx1"] = "「いいっ！　いいよぉ…っ！\\H\n　もっと気持ちよくしてぇっ…！\\H」"
  tx["tx1"] = "「やっ、やぁっ…それ感じ過ぎちゃうっ…！\\H\n　ふあぁぁんっ！\\H」" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「あはぁぁっ！\\H\n　ふ、深すぎるよぉ…っ！\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_type














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
#==================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「そ、そこダメっ！\n　あぁんっ\\H」"
#  tx["tx1"] = "「#{pleasure_cr}」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{pleasure_cr}」" if $msg.t_enemy.weaken? #自分が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_type
#▼キッス▼****************************************************************************************
when "キッス"
  tx["tx1"] = "「あはぁ……ん……ちゅっ……\\H\n　#{target}、キス上手すぎだよぉ……\\H\n　んんっ…？！……ぷぁ…っ……\\H」"
  tx["tx1"] = "「あ……ぁはぁ……\\H\n　もっとぉ……もっとキスしてぇ……\\H\n　んふ…っ……ちゅっ……んっ……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼バスト▼****************************************************************************************
when "バスト"
  tx["tx1"] = "「あぁんっ、\n　そんなにおっぱい弄っちゃダメぇ……っ\\H」"
  tx["tx1"] = "「ダメ、ダメぇっ……！\n　おっぱい感じ過ぎちゃうっ……！\\H」" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「はぅ…はぅぅ……\n　も、もうおっぱいは許してぇ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ヒップ▼****************************************************************************************
when "ヒップ"
  tx["tx1"] = "「ひぃん…っ\\H\n　そ、そこは弄っちゃやだよぉ…！」"
  tx["tx1"] = "「な、なんでぇ……？\n　お尻で気持ちよくなっちゃう……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「ひぃん…っ……\\H\n　も、もうお尻は許してぇ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼クロッチ▼****************************************************************************************
when "クロッチ"
  if $msg.t_enemy.nude?
    tx["tx1"] = "「あぁんっ……\\H\n　そんな奥まで弄っちゃ…っ……\\H」"
    tx["tx1"] = "「や、やだぁ…っ……\\H\n　気持ちよすぎるよぉ……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
    tx["tx1"] = "「あぁん…っ……\\H\n　も、もう許してぇ…っ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  else
    tx["tx1"] = "「いやぁん……\\H\n　染みになっちゃうよぉ……\\H」" # 対象が着衣状態の時
    tx["tx1"] = "「あはぁ…っ\\H\n　も、もうそこはいいからぁ…！んくぅ……っ！\\H」" if $msg.t_enemy.crisis? #自分がクライシス 対象が着衣状態の時
    tx["tx1"] = "「あぁん…っ……\\H\n　も、もう弄っちゃやぁ…っ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中 対象が着衣状態の時
  end
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼スウィング系▼****************************************************************************************
when "スウィング","ヘヴィスウィング"
  tx["tx1"] = "「いいっ！　いいよぉ…っ！\\H\n　もっと気持ちよくしてぇっ…！\\H」"
  tx["tx1"] = "「やっ、やぁっ…それ感じ過ぎちゃうっ…！\\H\n　ふあぁぁんっ！\\H」" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「あはぁぁっ！\\H\n　ふ、深すぎるよぉ…っ！\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_type





end
#====================================================================================================================
 end #def
end #class
