=begin
#######################################################################################################################
 ●『インプ（白）』戦闘開始、終了口上
 ●性格：高慢
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end

class MsgImp_B < MsgBase
 def msg_op_and_ep_02
#=======================================================================================================================
# ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
#----------------------------------------------------------------------------------------------------------------------
if $msg.tag == "戦闘開始"
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            if $game_switches[85] == true
                              tx["md"] = "12" if $msg.talk_step == 1
                              tx["md"] = "12" if $msg.talk_step == 2
                              tx["md"] = "12" if $msg.talk_step == 3
                              tx["md"] = "14" if $msg.talk_step == 1 and $msg.t_enemy.bedin_count == 0
                              tx["md"] = "14" if $msg.talk_step == 2 and $msg.t_enemy.bedin_count == 0
                              tx["md"] = "14" if $msg.talk_step == 3 and $msg.t_enemy.bedin_count == 0
                            elsif $game_switches[86] == true
                              tx["md"] = "0"
                            else
                              tx["md"] = "13" if $msg.talk_step == 1
                              tx["md"] = "12" if $msg.talk_step == 2
                              tx["md"] = "11" if $msg.talk_step == 3
                            end
  #----------------------------------------------------------------------------------------------------------------------
  #●ベッドイン中
  if $game_switches[85] == true
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「#{giggle}\n　い～っぱい遊んであげる♪」"
      #▼初ベッドイン
      tx["tx1"] = "「ここが#{target}のお部屋なんだね\\H\n　……どしたのかな、\n　#{myname}、なんだかドキドキしてきた……\\H」" if $msg.t_enemy.bedin_count == 0
    when 1 #２番目
      tx["tx1"] = "「んも～、\n　#{target}は\n　#{myname}と遊ぶの～！\n　じゃましちゃイヤだよ？」"
      #▼初ベッドイン
      tx["tx1"] = "「うわぁい、ベッドがふかふかだぁ♪\n　……えっと、いまからえっちするんだよね……？\n　う～、負けないからね？」" if $msg.t_enemy.bedin_count == 0
    when 2 #３番目
      tx["tx1"] = "「#{myname}も#{target}と遊ぶ～♪\n　#{target}もそのほうがいいよね？」"
      #▼初ベッドイン
      tx["tx1"] = "「いやぁん\\H\n　#{target}におそわれちゃう～♪\n　あははははっ\\H」" if $msg.t_enemy.bedin_count == 0
    end
  #●空腹戦闘中
  elsif $game_switches[86] == true
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「#{target}……、\n　#{myname}、おなかすいたよぉ……。\n　だから、少し食べちゃっていいよね？」"
    when 1 #２番目
      tx["tx1"] = "「あぁん、\n　#{myname}も食べる～\\H」"
    when 2 #３番目
      tx["tx1"] = "「う～ん……。\n　#{myname}まで残ってるかなぁ……？」"
    end
  #●レア戦闘中(OFEの場合は[$game_switches[92] == true]、BOSSの場合は[$game_switches[91] == true]をそれぞれelsifでつけること)
  else
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「わ、わ、知らない男の人だ！\n　……あ、でもオトナじゃないや。\n　話しかけても大丈夫かな？」"
    when 1 #２番目
      tx["tx1"] = "「ねぇ、#{target}は迷子さん？\n　ここは#{myname}たちの遊び場だよ～？」"
    when 2 #３番目
      tx["tx1"] = "「うぅ……初めて男の子と喋るよう……。\n　ねぇ、何話したらいいのかな……」"
    end
  end
  #格納
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
#■逃走失敗口上
elsif $msg.tag == "逃走失敗"
  tx["tx1"] = "「ね、ね、どこ行くの？\n　#{myname}も一緒に行ってあげる～♪」"
  #----------------------------------------------------------------------------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
#■契約口上
elsif $msg.tag == "契約"
  #----------------------#
  #▼ステップで状況判断  #
  #----------------------#
  case $msg.talk_step
  #▼契約開始
  when 1 
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「……ねぇ、#{target}、もう帰っちゃうの？\n　#{myname}、もっと#{target}と遊びたい……」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「ね、#{target}。\n　#{myname}、#{target}についてったらダメ？」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx3"] = "「絶対いい子にするから……\n　#{target}、お願い」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約締結(即座に仲間に入る)
  when 2
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「ほんとに？！\n　うそじゃないよね？！\n　やったーっ♪」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「えへへっ……\\H\n　それじゃ、#{target}についてっちゃう\\H\n　#{target}、大好き\\H」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約締結(ホームに送る)
  when 3
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「ほんとに？！\n　うそじゃないよね？！\n　やったーっ♪」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「あ、でもお友達がいっぱいなんだね……。\n　じゃ、#{myname}おうちでいい子にしてる\\H\n　だから、早く帰ってきてね\\H」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約を行わない
  when 4
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「やっぱり、ダメ……？\n　……ぐすん……」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「！？\n　な、泣いてなんかないよ？\n　#{myname}、お友達だっていっぱいいるし！」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx3"] = "「……\\|……\\|でも、\n　時々でいいから、遊びに来てね。\n　約束だよ？」"
    #----------------------------------------------------------------------------------------------------------------------
  end
  #格納
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
end
#######################################################################################################################
 end #def
end #class
