=begin
#######################################################################################################################
 ●『サキュバス（橙）』追撃口上（対主人公・通常戦闘中）
 ●性格：陽気
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end






#######################################################################################################################
######################################★追撃：主人公への追撃を行う口上群###############################################
#######################################################################################################################
class MsgSuccubus_A < MsgBase
 def msg_attack_07
#==================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「くすくす……抵抗しないのね。\n　それとも……期待してたのかしら？\\H」"
  tx["tx1"] = "「くすくす……♪\n　#{myname}のカラダ、しっかり味わってね……\\H」" if $game_variables[17] > 50 #パターンB
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「ふふっ……気に入ってもらえてるようね\\H\n　もっと自分に素直になっていいのよ……\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「うふふっ……気持ちいい？\n　もっと#{myname}に溺れて……\\H」" if $msg.t_target.crisis? and $game_variables[17] > 35 #対象がクライシス・パターンB
  tx["tx1"] = "「ふふっ……気に入ってもらえてるようね\\H\n　もっと自分に素直になっていいのよ……\\H」" if $msg.t_target.crisis? and $game_variables[17] > 70 #対象がクライシス・パターンC
  tx["tx1"] = "「もう何も考えられないかしら……？\n　もっと#{myname}に溺れて……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_type
#▼キス▼****************************************************************************************
when "キス"
  tx["tx1"] = "「んっ……ちゅっ…ちゅぷっ……\\H\n　#{myname}の唇で、溺れさせてあげる……\\H」"
  tx["tx1"] = "「…れろぉ……れろ……ちゅっ……\\H\n　ふふ、もっと舌を絡めて……そう……\\H」" if $game_variables[17] > 35 #パターンB
  tx["tx1"] = "「…れろぉ……れろ……ちゅっ……\\H\n　そうよ、舌…上手じゃない…くすくす……\\H」" if $game_variables[17] > 70 #パターンC
  tx["tx1"] = "「ちゅっ…んっ……れろぉ……\\H\n　うふっ……すっかり蕩けちゃって…可愛い\\H」" if $msg.t_enemy.crisis?
  tx["tx1"] = "「…ちゅっ…ちゅぱっ…んっ……\\H\n　ふふ、もっと蕩けさせてあげる……\\H」" if $msg.t_enemy.crisis? and $game_variables[17] > 50 #パターンB
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼手攻め▼****************************************************************************************
when "手"
#  tx["tx1"] = ""
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼口攻め▼****************************************************************************************
when "口"
  tx["tx1"] = "「少し力抜いて……\\H\n　私のお口でシてあげるから…\\H」"
  tx["tx1"] = "「ふふっ、気に入った？\n　なら、遠慮なくしちゃうわよ？\\H」" if $game_variables[17] > 50 #パターンB
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「んっ……ちゅるっ……んくっ……\\H\n　ふふっ…美味しい……\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「イったばかりだし、疲れたでしょ……？\\H\n　私がお口でシてあげる…\\H」" if $msg.t_target.weaken? #対象が絶頂中
  tx["tx1"] = "「ふふっ、もう硬くなってる……\\H\n　何度でもイけそうね……\\H」" if $msg.t_target.weaken? and $game_variables[17] > 50 #対象が絶頂中・パターンB
#  tx["tx1"] = "" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼胸攻め▼****************************************************************************************
when "胸"
  case $msg.at_parts
  when "対象：ペニス" #パイズリ
 #  tx["tx1"] = ""
 #  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
 #  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
 #  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  when "対象：口" #ぱふぱふ
 #  tx["tx1"] = ""
 #  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
 #  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
 #  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  end
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼アソコ攻め▼****************************************************************************************
when "♀" #素股
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼足攻め▼****************************************************************************************
when "足" #足コキ
#  tx["tx1"] = ""
#  tx["tx1"] = "" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ホールド援護▼****************************************************************************************
when "ホールド援護"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.at_parts == "対象：口" #援護キッス
#  tx["tx1"] = "" if $msg.at_parts == "対象：ペニス" #援護ペニス攻め
#  tx["tx1"] = "" if $msg.at_parts == "対象：睾丸" #援護睾丸攻め
#  tx["tx1"] = "" if $msg.at_parts == "対象：尻" #援護尻攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_parts
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class










#######################################################################################################################
######################################★追撃：主人公への追撃を行う口上群###############################################
#######################################################################################################################
class MsgSuccubus_A < MsgBase
 def msg_attack_hold_07
#==================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「くすくす……抵抗しないのね。\n　それとも……期待してたのかしら？\\H」"
  tx["tx1"] = "「くすくす……♪\n　#{myname}のカラダ、しっかり味わってね……\\H」" if $game_variables[17] > 50 #パターンB
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「ふふっ……気に入ってもらえてるようね\\H\n　もっと自分に素直になっていいのよ……\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「うふふっ……気持ちいい？\n　もっと#{myname}に溺れて……\\H」" if $msg.t_target.crisis? and $game_variables[17] > 35 #対象がクライシス・パターンB
  tx["tx1"] = "「ふふっ……気に入ってもらえてるようね\\H\n　もっと自分に素直になっていいのよ……\\H」" if $msg.t_target.crisis? and $game_variables[17] > 70 #対象がクライシス・パターンC
  tx["tx1"] = "「もう何も考えられないかしら……？\n　もっと#{myname}に溺れて……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_parts
#▼インサート(♀)▼****************************************************************************************
when "♀挿入：アソコ側"
  tx["tx1"] = "「くすくす……\\H\n　こんな風にされるのは初めて？」"
  tx["tx2"] = "「#{myname}のカラダ、\n　たっぷり味わってね\\H」"
  tx["tx1"] = "「ほぉら、見えるかしら……？\n　#{myname}と#{target}が繋がってるところ……\\H」" if $game_variables[17] > 50 #パターンB
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「うふふっ……気持ちいい？\n　もっと#{myname}に溺れて……\\H」" if $msg.t_target.crisis? #対象がクライシス
  tx["tx1"] = "「さっきイったばかりでこんなに硬い……\\H\n　#{myname}も愉しませてもらえそうね\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼顔面騎乗▼****************************************************************************************
when "騎乗：アソコ側"
  tx["tx1"] = "「あは♪　荒い息が当たってる\\H\n　お気に召したようね……\\H」"
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ぱふぱふ▼****************************************************************************************
when "ぱふぱふ"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼パイズリ▼****************************************************************************************
when "パイズリ"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼尻ディルド攻め▼****************************************************************************************
when "ディルド尻挿入"
#  tx["tx1"] = ""
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼キッス▼****************************************************************************************
when "キッス"
  tx["tx1"] = "「#{kiss_l}」"
#  tx["tx1"] = "" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_parts
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class










#######################################################################################################################
####################################★追撃：主人公から追撃を受ける口上群###############################################
#######################################################################################################################
class MsgSuccubus_A < MsgBase
 def msg_attack_self_07
#==================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「はぁ……ん……っ\\H\n　そう……いいわぁ……\\H」"
#  tx["tx1"] = "「#{pleasure_cr}」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{pleasure_cr}」" if $msg.t_enemy.weaken? #自分が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_type
#▼キッス▼****************************************************************************************
when "キッス"
  tx["tx1"] = "「んっ……ふぅっ……\\H\n　いいわぁ…上手ね、#{target}……\\H」"
  tx["tx1"] = "「ちゅっ……れろ……れろ……\\H\n　ね……もっと、舌……奥まで……\\H」"if $game_variables[17] > 50 #パターンB
  tx["tx1"] = "「んむ…ちゅっ……れろ……\\H\n　うふふ……溺れてしまいそう……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼バスト▼****************************************************************************************
when "バスト"
  tx["tx1"] = "「あはぁ……\\H\n　気に入ってくれた？#{myname}の胸……\\H」"
  tx["tx1"] = "「あぁん……まだするのぉ……？\\H\n　胸がまた大きくなっちゃいそう……\\H」"if $game_variables[17] > 50 #パターンB
  tx["tx1"] = "「んっ…ぁ……はぁ……\\H\n　そこ……もっと強くしても大丈夫…んんっ……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ヒップ▼****************************************************************************************
when "ヒップ"
  tx["tx1"] = "「やぁん……お尻はダメよ……\\H」"
  tx["tx1"] = "「んぁ……んんっ……\\H\n　もう……ダメだって言って……んぁっ……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼クロッチ▼****************************************************************************************
when "クロッチ"
  if $msg.t_enemy.nude?
    tx["tx1"] = "「そう……そうよ、気持ちいい……\\H\n　もっと激しくしても大丈夫……んぁっ……\\H」"
    tx["tx1"] = "「あぁん……\\H\n　そんな奥までぇ……んんっ……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
    tx["tx1"] = "「んはぁ…っ……\\H\n　凄いぃ……っ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  else
    tx["tx1"] = "「あぁん……\\H\n　ふふっ、染みにさせたいの……？」" # 対象が着衣状態の時
    tx["tx1"] = "「んっ……\\H\n　もっと直接触ってくれてもいいのに……\\H」" if $game_variables[17] > 50 # 対象が着衣状態の時・パターンB
    tx["tx1"] = "「あぁん……\\H\n　そんなに焦らさないでぇ……\\H」" if $msg.t_enemy.crisis? #自分がクライシス 対象が着衣状態の時
    tx["tx1"] = "「んはぁ…っ……\\H\n　凄いぃ……っ……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  end
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼スウィング系▼****************************************************************************************
when "スウィング","ヘヴィスウィング"
  tx["tx1"] = "「あぁん……\\H\n　そんな奥までぇ……んんっ……\\H」"
  tx["tx1"] = "「んはぁ…っ……\\H\n　気持ち良いぃ……っ……\\H」"if $game_variables[17] > 50 #パターンB
  tx["tx1"] = "「そう……そうよ、気持ちいい……\\H\n　もっと激しくしても大丈夫……んぁっ……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_type
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class
