=begin
#######################################################################################################################
 ●『サキュバス（橙）』戦闘開始、終了口上
 ●性格：好色
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end

class MsgSuccubus_A < MsgBase
 def msg_op_and_ep_00
#=======================================================================================================================
# ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
#----------------------------------------------------------------------------------------------------------------------
if $msg.tag == "戦闘開始"
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            if $game_switches[85] == true
                              tx["md"] = "12" if $msg.talk_step == 1
                              tx["md"] = "12" if $msg.talk_step == 2
                              tx["md"] = "12" if $msg.talk_step == 3
                              tx["md"] = "14" if $msg.talk_step == 1 and $msg.t_enemy.bedin_count == 0
                              tx["md"] = "14" if $msg.talk_step == 2 and $msg.t_enemy.bedin_count == 0
                              tx["md"] = "14" if $msg.talk_step == 3 and $msg.t_enemy.bedin_count == 0
                            elsif $game_switches[86] == true
                              tx["md"] = "0"
                            else
                              tx["md"] = "13" if $msg.talk_step == 1
                              tx["md"] = "12" if $msg.talk_step == 2
                              tx["md"] = "11" if $msg.talk_step == 3
                            end
  #----------------------------------------------------------------------------------------------------------------------
  #●ベッドイン中
  if $game_switches[85] == true
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「#{giggle}\n　今夜もいっぱい愛してあげる\\H」"
      #▼初ベッドイン
      tx["tx1"] = "「#{giggle}\n　ベッドの上で愛しあうのは久しぶりよ\\H\n　ねぇ……もっと近くに来て……\\H」" if $msg.t_enemy.bedin_count == 0
    when 1 #２番目
      tx["tx1"] = "「#{giggle}\n　#{myname}のことも忘れちゃイヤよ？\\H」"
      #▼初ベッドイン
      tx["tx1"] = "「#{giggle}\n　どう、緊張しちゃってる？\n　大丈夫よ、#{myname}がリードしてあげる\\H」" if $msg.t_enemy.bedin_count == 0
    when 2 #３番目
      tx["tx1"] = "「#{giggle}\n　３人相手は大変だろうけど、頑張ってね？\\H」"
      #▼初ベッドイン
      tx["tx1"] = "「#{giggle}\n　契約の時のお礼をたっぷりしてあげる……\\H\n　もちろん、いいわよね？\\H」" if $msg.t_enemy.bedin_count == 0
    end
  #●空腹戦闘中
  elsif $game_switches[86] == true
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「#{giggle}\n　さて、どのお口で食べられるのがお好み？\n　リクエストは聞いてあげるわよ？\\H」"
    when 1 #２番目
      tx["tx1"] = "「早い者勝ちは無しにしましょうね？\n　美味しいものは皆で分けないと……\\H」"
    when 2 #３番目
      tx["tx1"] = "「枯れなきゃいいけどね……\\H\n　ま、#{myname}たちを放置した自業自得ってことで」"
    end
  #●レア戦闘中(OFEの場合は[$game_switches[92] == true]、BOSSの場合は[$game_switches[91] == true]をそれぞれelsifでつけること)
  else
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「あら可愛い……\\H\n　こっちにいらっしゃい？\n　お姉さんがいいコトしてあげる\\H」"
    when 1 #２番目
      tx["tx1"] = "「#{giggle}\n　つまみ食いはダメよ？\n　ちゃんと皆で分けましょうね\\H」"
    when 2 #３番目
      tx["tx1"] = "「大丈夫よ、怖くないから\\H\n　少しの間、気持ちいい夢を見られるだけ……\\H」"
    end
  end
  #格納
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
#■逃走失敗口上
elsif $msg.tag == "逃走失敗"
  tx["tx1"] = "「あら、逃げちゃダメよ\\H\n　イイことしてあげるから……ね？\\H」"
  #----------------------------------------------------------------------------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
#■契約口上
elsif $msg.tag == "契約"
  #----------------------#
  #▼ステップで状況判断  #
  #----------------------#
  case $msg.talk_step
  #▼契約開始
  when 1 
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「ねぇ……ちょっといいかしら？\n　#{target}、#{myname}と契約……してみない？」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「こんなに燃えたのは久しぶりなの\\H\n　ここだけの関係で終わらせるの、勿体無くない？」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx3"] = "「勿論、#{target}が良いって言えばだけど……。\n　どうかしら？」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約締結(即座に仲間に入る)
  when 2
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「#{giggle}\n　ありがとう、受け入れてくれて嬉しいわ」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「それじゃ、今後ともよろしく……ね？\\H」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約締結(ホームに送る)
  when 3
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「#{giggle}\n　ありがとう、受け入れてくれて嬉しいわ」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「それじゃ、先に#{target}の家に行ってるわ。\n　メンバーがいっぱいみたいだしね。\n　念入りに身体を磨いて待ってるわ\\H」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約を行わない
  when 4
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「あぁん……残念。\n　ま、こればかりは無理強いできないしね」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「それじゃ、またどこかで会いましょう。\n　この次は、もっとイイことしてあげる……\\H」"
    #----------------------------------------------------------------------------------------------------------------------
  end
  #格納
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
end
#######################################################################################################################
 end #def
end #class
