=begin
#######################################################################################################################
 ●『サキュバスロード（桃）』追撃口上（対主人公・通常戦闘中）
 ●性格：好色
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 2017,06/27     パイズリ・ペリスコープ口上追加
#######################################################################################################################
=end





#######################################################################################################################
######################################★追撃：主人公への追撃を行う口上群###############################################
#######################################################################################################################
class MsgSuccubuslord_B < MsgBase
 def msg_attack_00
#==================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「#{target}の欲望、\n　#{myname}のカラダで満たしてあげる\\H\n　力を抜いて、#{myname}に身を任せて……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_type
#▼キス▼****************************************************************************************
when "キス"
  tx["tx1"] = "「#{kiss_l}\n　……#{giggle_s}\\H　理性も思考も全部吸い出して、\n　気持ちいいこと以外何も考えられなくしてあげる\\H」"
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼手攻め▼****************************************************************************************
when "手"
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼口攻め▼****************************************************************************************
when "口"
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼胸攻め▼****************************************************************************************
when "胸"
  case $msg.at_parts
  when "対象：ペニス" #パイズリ
#    tx["tx1"] = "「#{giggle_s}……\\H」"
#    tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#    tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#    tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
    tx["tx1"] = "「ほら……#{target}の大事なところ、\n　この胸でたっぷりと余すことなく愛してあげる\\H\n　力を抜いて、柔らかな感触に身を委ねて……\\H」"
    tx["tx1"] = "「あん、挟んだだけで跳ねて……#{giggle_s}、暴れん坊ね\\H\n　欲望に満ちた素敵な#{target}のコ、\n　優しく快楽で包み込んで、甘く蕩けさせてあげるわ\\H」" if $game_variables[17] > 50 #ランダム分岐
    if $msg.t_target.crisis? #対象がクライシス
      tx["tx1"] = "「#{giggle}　すっかり蕩けちゃって……\\H\n　いいのよ、この胸をどろどろに穢しても……\\H　煮え滾る白濁、欲望のままに吐き出してちょうだい\\H」"
      tx["tx1"] = "「……#{giggle_s}\\H　こんなに硬く、熱くして……\n　#{myname}の胸が劣情で溶かされちゃいそうだわ……\\H\n　期待と欲望のままに、心まで蕩けさせてあげる……\\H」" if $game_variables[17] > 50 #ランダム分岐
    end
  when "対象：口" #ぱふぱふ
#    tx["tx1"] = "「#{giggle_s}……\\H」"
#    tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#    tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#    tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  end
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼アソコ攻め▼****************************************************************************************
when "♀" #素股
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼足攻め▼****************************************************************************************
when "足" #足コキ
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" unless $msg.t_target.nude? # 対象が着衣状態の時
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.tag == "対象：睾丸" #袋攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ホールド援護▼****************************************************************************************
when "ホールド援護"
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.at_parts == "対象：口" #援護キッス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.at_parts == "対象：ペニス" #援護ペニス攻め
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.at_parts == "対象：睾丸" #援護睾丸攻め
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.at_parts == "対象：尻" #援護尻攻め
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_parts
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class










#######################################################################################################################
######################################★追撃：主人公への追撃を行う口上群###############################################
#######################################################################################################################
class MsgSuccubuslord_B < MsgBase
 def msg_attack_hold_00
#==================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「#{giggle}　ほら、もっと酔いしれて……\\H\n　このカラダと触れ合う快楽に溺れて、\n　#{myname}から離れたくなくなるくらいに……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_parts
#▼インサート(♀)▼****************************************************************************************
when "♀挿入：アソコ側"
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼顔面騎乗▼****************************************************************************************
when "騎乗：アソコ側"
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ぱふぱふ▼****************************************************************************************
when "ぱふぱふ"
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼パイズリ▼****************************************************************************************
when "パイズリ"
#  tx["tx1"] = ""
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
  case $msg.t_enemy.initiative_level
  when 3 #ホールドレベル3
    if $msg.t_target.crisis? #対象がクライシス
      tx["tx1"] = "「谷間から顔を出すたび涎でべとべとにして……\n　#{giggle_s}……、牡の昂りで穢されていくようだわ\\H\n　ぬるついて、艶やかに濡れ光って……素敵な化粧ね\\H」"
      tx["tx1"] = "「#{target}の涎でぬるぬるで、\n　抑え込んでも反り返って……その刺激で勝手に喘いで\\H\n　#{giggle_s}……とても倒錯的で、素敵な姿よ……\\H」" if $game_variables[17] > 33 #ランダム分岐
      tx["tx1"] = "「乳房で擦り上げるたびににちゃにちゃ鳴って……\n　ふふ……こんなにいやらしくされたお返しが必要ね？\n　この淫猥な胸で、心まで快楽で満たしてあげる……\\H」" if $game_variables[17] > 66 #ランダム分岐
      if $msg.t_target.critical == true #SS時
        tx["tx1"] = "「#{giggle_s}……必死になって我慢なんてしなくていいの、\n　理性まで蕩けるよう、思い切りしごき上げてあげる\\H\n　乳房で挟み潰され嬲られる快感、愉しみなさい……\\H」"
        tx["tx1"] = "「小さなお口が開きっぱなし……涎が止まらないのね\\H\n　……ふふ、吐息にすら敏感に反応して、節操のないコ\\H\n　唇や吐息も使ってかわいがってあげる……ちゅっ\\H」" if $game_variables[17] > 33 #ランダム分岐
        tx["tx1"] = "「強く締め上げられるたびに腰を震わせて悦んで……\n　ふふ、こうして甘く嬲られるのが好きなのね\\H\n　たっぷり味わいなさい……大好きな胸の感触を……\\H」" if $game_variables[17] > 66 #ランダム分岐
      end
    else #非クライシス
      tx["tx1"] = "「優しい温もりに包まれて、たまらないでしょう？\n　左右から圧迫したままたっぷりしごいてあげる、\n　柔らかな感触をはっきりと感じられるように……\\H」"
      tx["tx1"] = "「胸に埋めて、ぎゅっと押さえつけて閉じ込めて……\n　少しずつ締め上げて、ゆっくり追い詰めてあげる……\\H\n　#{giggle_s}……今、ぴくりと震えて期待したでしょう\\H」" if $game_variables[17] > 33 #ランダム分岐
      tx["tx1"] = "「胸の中に閉じ込めて優しく締め上げるたび、\n　硬く雄雄しく反り返って、淫らな熱で膨らんで……\\H\n　#{giggle_s}……#{myname}の胸ごと溶けあってしまいそう……\\H」" if $game_variables[17] > 66 #ランダム分岐
      if $msg.t_target.critical == true #SS時
        tx["tx1"] = "「#{giggle}　ほら、少し意地悪してあげる\\H\n　根元から先端まで、胸で絞り上げるように……\\H\n　乳房の潰れる感触、姿、音……愉しんでちょうだい\\H」"
        tx["tx1"] = "「谷間に収まらないほど物欲しげに反り返ったこのコの、\n　充血して膨らんだ先っぽ、舌で嬲ってあげる……んっ\\H\n　ちゅっ、れろ……ふふ、腰が溶けるようでしょう？\\H」" if $game_variables[17] > 33 #ランダム分岐
        tx["tx1"] = "「もっと自分から、カラダごと味わってちょうだい？\n　腰ごと抱きしめて、ほら、ぎゅっと押し付けてあげる\\H\n　……#{giggle_s}、いい声ね……うっとりしちゃうわ\\H」" if $game_variables[17] > 66 #ランダム分岐
      end
    end
  when 2 #ホールドレベル2
    tx["tx1"] = "「優しく挟み込んで、柔らかく揉みこんで……#{giggle_s}\\H\n　#{myname}の胸の温もり、しっかり味わって蕩けなさい\\H\n　……ふふ、一層硬くして……もっとして欲しいの？\\H」"
    tx["tx1"] = "「ほら、力を抜いて……カラダの奥までほぐしてあげる\\H\n　柔らかな胸に包まれて、たぷたぷと優しく揺れて……\n　甘美なまどろみの中を泳いでいるようでしょう……\\H」" if $game_variables[17] > 50 #ランダム分岐
    tx["tx1"] = "「#{giggle}　気持ちよくて力が抜けちゃったのね？\n　大事なところを胸の谷間に囚われたまま逃れられずに、\n　優しく嬲られ続ける無力感……興奮するでしょう？\\H」" if $msg.t_target.critical == true #ホールドレベル1→2
  else #ホールドレベル1
    tx["tx1"] = "「そんなにもがいていたら満足に味わえないでしょう？\n　大人しくして、湧き上がる欲望に身を任せて……\n　柔らかに絡め取られる恍惚に溺れなさい……\\H」"
    tx["tx1"] = "「んっ……だめよ、簡単には放してあげられないわ。\n　#{target}のここは、まだ足りない、\n　もっと抱きしめてほしいって訴えてきてるもの……\\H」" if $game_variables[17] > 50 #ランダム分岐
  end
  tx["tx1"] = "「#{giggle_s}……まだ優しくしてあげたほうがいいかしら？\n　落ち着くまでこうやってゆるく包み込んでいてあげる\\H\n　大丈夫よ、すぐにまたシて欲しくなるわ……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼尻ディルド攻め▼****************************************************************************************
when "ディルド尻挿入"
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼キッス▼****************************************************************************************
when "キッス"
#  tx["tx1"] = "「#{kiss_l}」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.crisis? #対象がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_target.weaken? #対象が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_parts
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class










#######################################################################################################################
####################################★追撃：主人公から追撃を受ける口上群###############################################
#######################################################################################################################
class MsgSuccubuslord_B < MsgBase
 def msg_attack_self_00
#==================================================================================================================
# ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  tx["tx1"] = "「#{pleasure_s}\n　ふふっ、積極的じゃない……\\H」"
  tx["tx1"] = "「#{pleasure_l}\n　気持ちいいわ、もっとしてちょうだい……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
  tx["tx1"] = "「#{pleasure_cr}\n　もう、#{target}ってば……\\H\n　見かけに、よらず……んっ\\H　容赦、ないのね……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                          #空ハッシュ挿入
                          tx={}
case $msg.at_type
#▼キッス▼****************************************************************************************
when "キッス"
  tx["tx1"] = "「#{kiss_l}　#{giggle}\n　#{myname}のこと、夢中にさせてごらんなさい……\\H」"
  tx["tx1"] = "「#{kiss_l}\n　お願い、もっと……\\H\n　溺れるくらい、してちょうだい……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼バスト▼****************************************************************************************
when "バスト"
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼ヒップ▼****************************************************************************************
when "ヒップ"
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼クロッチ▼****************************************************************************************
when "クロッチ"
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
#▼スウィング系▼****************************************************************************************
when "スウィング","ヘヴィスウィング"
#  tx["tx1"] = "「#{giggle_s}……\\H」"
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.crisis? #自分がクライシス
#  tx["tx1"] = "「#{giggle_s}……\\H」" if $msg.t_enemy.weaken? #自分が絶頂中
  #-----------------------------------------------------
  #格納
  ms.push(tx)
end #case $msg.at_type
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class
