=begin
#######################################################################################################################
 ●『サキュバスロード（桃）』レジスト実行口上（衣装関連・対主人公）
 ●性格：好色
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 2016,07/25     仮稿流し込み
#######################################################################################################################
=end





#######################################################################################################################
#########################################★脱衣：主人公がメインの口上群################################################
#######################################################################################################################
class MsgSuccubuslord_B < MsgBase
 def msg_undress_00
#=======================================================================================================================
# ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #レジスト成功
                              tx["md"] = "2" if $msg.tag == "Succubus strips the player." #脱衣できなかった
                              tx["md"] = "3" if $msg.tag == "Player strips the succubus." #相手を脱衣させた
                            when 3 #レジスト失敗
                              tx["md"] = "3" if $msg.tag == "Succubus strips the player." #脱衣させられた
                              tx["md"] = "2" if $msg.tag == "Player strips the succubus." #相手を脱衣できなかった
                            end
case $msg.tag
#====================================================================================================================
#■夢魔が主人公を脱衣させる
#====================================================================================================================
when "Succubus strips the player."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"Show me your everything, #{target}....\\H\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 2 #主人公が抵抗した
    tx["tx1"] = "\"You don't want to show it to me?\n Such a shame....\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 3 #主人公が脱衣した
    tx["tx1"] = "\"#{giggle_s} What a nice body you've got there....\\H\n One that's has faithfully lived out his days\n and has paved the way until now....\\H\""
    #▼自ら受け入れた場合
    tx["tx1"] = "\"Oh, my....\\H\n To expose yourself without any shame,\n you're more bolder than you look\\H\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■主人公が夢魔を脱衣させる
#====================================================================================================================
when "Player strips the succubus."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"#{giggle_s} You're going to take it off for me?\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 2 #夢魔を脱衣させた
    tx["tx1"] = "\"#{giggle_s} Thanks.\n Then let's carry on\\H\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 3 #夢魔に抵抗された
    tx["tx1"] = "\"You shouldn't be so clumsy like that, make me clearly see what you're up to.\n You if you want to do a woman like that,\n try to fix your looks at least\\H\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Oh my....\n Did you just want to touch my clothes?\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■主人公が自ら脱衣する
#====================================================================================================================
when "Player undresses themself."
  tx["tx1"] = "\"#{giggle_s} You couldn't wait?\""
  tx["tx1"] = "\"#{giggle_s} I've been waiting\\H\"" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)
#====================================================================================================================
#■夢魔が自ら脱衣する
#====================================================================================================================
when "Succubus undresses herself."
  #------------------------------------------------------------------------------------------------------------------
  tx["tx1"] = "\"Ufufu, I've kept you waiting\\H\""
  tx["tx1"] = "\"Let's have a more passionate lovemaking\\H\"" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)
#----------------------------------------------------------------------------------------------------------------------
end #case $msg.tag
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class










#######################################################################################################################
#####################################★脱衣：主人公がメインの口上群(ベッドイン)########################################
#######################################################################################################################
class MsgSuccubuslord_B < MsgBase
 def msg_bedin_undress_00
#====================================================================================================================
# ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #レジスト成功
                              tx["md"] = "2" if $msg.tag == "Succubus strips the player." #脱衣できなかった
                              tx["md"] = "3" if $msg.tag == "Player strips the succubus." #相手を脱衣させた
                            when 3 #レジスト失敗
                              tx["md"] = "3" if $msg.tag == "Succubus strips the player." #脱衣させられた
                              tx["md"] = "2" if $msg.tag == "Player strips the succubus." #相手を脱衣できなかった
                            end
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("Significant Other")
#====================================================================================================================
  case $msg.tag
  #====================================================================================================================
  #■夢魔が主人公を脱衣させる
  #====================================================================================================================
when "Succubus strips the player."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"Show me your everything, #{target}....\\H\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 2 #主人公が抵抗した
    tx["tx1"] = "\"You don't want to show it to me?\n Such a shame....\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 3 #主人公が脱衣した
    tx["tx1"] = "\"#{giggle_s} What a nice body you've got there....\\H\n One that's has faithfully lived out his days\n and has paved the way until now....\\H\""
    #▼自ら受け入れた場合
    tx["tx1"] = "\"Oh, my....\\H\n To expose yourself without any shame,\n you're more bolder than you look\\H\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■主人公が夢魔を脱衣させる
#====================================================================================================================
when "Player strips the succubus."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"#{giggle_s} You're going to take it off for me?\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 2 #夢魔を脱衣させた
    tx["tx1"] = "\"#{giggle_s} Thanks.\n Then let's carry on\\H\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 3 #夢魔に抵抗された
    tx["tx1"] = "\"You shouldn't be so clumsy like that, make me clearly see what you're up to.\n You if you want to do a woman like that,\n try to fix your looks at least\\H\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Oh my....\n Did you just want to touch my clothes?\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■主人公が自ら脱衣する
#====================================================================================================================
when "Player undresses themself."
  tx["tx1"] = "\"#{giggle_s} You couldn't wait?\""
  tx["tx1"] = "\"#{giggle_s} I've been waiting\\H\"" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)
#====================================================================================================================
#■夢魔が自ら脱衣する
#====================================================================================================================
when "Succubus undresses herself."
  #------------------------------------------------------------------------------------------------------------------
  tx["tx1"] = "\"Ufufu, I've kept you waiting\\H\""
  tx["tx1"] = "\"Let's have a more passionate lovemaking\\H\"" if $msg.t_target.nude? #アクターが先に脱いでいた
    #---------------------------------------------------
    #格納
    tx["md"] = "3"
    ms.push(tx)
  #----------------------------------------------------------------------------------------------------------------------
  end #case $msg.tag










#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("Affection")
#====================================================================================================================
  case $msg.tag
  #====================================================================================================================
  #■夢魔が主人公を脱衣させる
  #====================================================================================================================
when "Succubus strips the player."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"Show me your everything, #{target}....\\H\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 2 #主人公が抵抗した
    tx["tx1"] = "\"You don't want to show it to me?\n Such a shame....\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 3 #主人公が脱衣した
    tx["tx1"] = "\"#{giggle_s} What a nice body you've got there....\\H\n One that's has faithfully lived out his days\n and has paved the way until now....\\H\""
    #▼自ら受け入れた場合
    tx["tx1"] = "\"Oh, my....\\H\n To expose yourself without any shame,\n you're more bolder than you look\\H\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■主人公が夢魔を脱衣させる
#====================================================================================================================
when "Player strips the succubus."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"#{giggle_s} You're going to take it off for me?\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 2 #夢魔を脱衣させた
    tx["tx1"] = "\"#{giggle_s} Thanks.\n Then let's carry on\\H\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 3 #夢魔に抵抗された
    tx["tx1"] = "\"You shouldn't be so clumsy like that, make me clearly see what you're up to.\n You if you want to do a woman like that,\n try to fix your looks at least\\H\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Oh my....\n Did you just want to touch my clothes?\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■主人公が自ら脱衣する
#====================================================================================================================
when "Player undresses themself."
  tx["tx1"] = "\"#{giggle_s} You couldn't wait?\""
  tx["tx1"] = "\"#{giggle_s} I've been waiting\\H\"" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)
#====================================================================================================================
#■夢魔が自ら脱衣する
#====================================================================================================================
when "Succubus undresses herself."
  #------------------------------------------------------------------------------------------------------------------
  tx["tx1"] = "\"Ufufu, I've kept you waiting\\H\""
  tx["tx1"] = "\"Let's have a more passionate lovemaking\\H\"" if $msg.t_target.nude? #アクターが先に脱いでいた
    #---------------------------------------------------
    #格納
    tx["md"] = "3"
    ms.push(tx)
  #----------------------------------------------------------------------------------------------------------------------
  end #case $msg.tag










#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
  case $msg.tag
  #====================================================================================================================
  #■夢魔が主人公を脱衣させる
  #====================================================================================================================
when "Succubus strips the player."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"Show me your everything, #{target}....\\H\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 2 #主人公が抵抗した
    tx["tx1"] = "\"You don't want to show it to me?\n Such a shame....\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 3 #主人公が脱衣した
    tx["tx1"] = "\"#{giggle_s} What a nice body you've got there....\\H\n One that's has faithfully lived out his days\n and has paved the way until now....\\H\""
    #▼自ら受け入れた場合
    tx["tx1"] = "\"Oh, my....\\H\n To expose yourself without any shame,\n you're more bolder than you look\\H\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■主人公が夢魔を脱衣させる
#====================================================================================================================
when "Player strips the succubus."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"#{giggle_s} You're going to take it off for me?\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 2 #夢魔を脱衣させた
    tx["tx1"] = "\"#{giggle_s} Thanks.\n Then let's carry on\\H\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 3 #夢魔に抵抗された
    tx["tx1"] = "\"You shouldn't be so clumsy like that, make me clearly see what you're up to.\n You if you want to do a woman like that,\n try to fix your looks at least\\H\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Oh my....\n Did you just want to touch my clothes?\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■主人公が自ら脱衣する
#====================================================================================================================
when "Player undresses themself."
  tx["tx1"] = "\"#{giggle_s} You couldn't wait?\""
  tx["tx1"] = "\"#{giggle_s} I've been waiting\\H\"" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)
#====================================================================================================================
#■夢魔が自ら脱衣する
#====================================================================================================================
when "Succubus undresses herself."
  #------------------------------------------------------------------------------------------------------------------
  tx["tx1"] = "\"Ufufu, I've kept you waiting\\H\""
  tx["tx1"] = "\"Let's have a more passionate lovemaking\\H\"" if $msg.t_target.nude? #アクターが先に脱いでいた
    #---------------------------------------------------
    #格納
    tx["md"] = "3"
    ms.push(tx)
  #----------------------------------------------------------------------------------------------------------------------
  end #case $msg.tag
end
#######################################################################################################################
  end #def
end #class
