=begin
#######################################################################################################################
 ●『レッサーサキュバス（橙）』レジスト実行口上（ホールド関連・対主人公）
 ●性格：好色
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end






#######################################################################################################################
########################################★ホールド：主人公がメインの口上群#############################################
#######################################################################################################################
class MsgLessersuccubus_A < MsgBase
 def msg_hold_00
#==================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "Player binds the succubus."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"#{giggle}\n Wonder what you'll do to me? \\H\""
  when 2 #ホールド成功
    tx["tx1"] = "\"Augh\\H\n Hey, keep going, hurry up\\H\""
  when 3 #ホールド失敗
    tx["tx1"] = "\"Not yet\\H\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Oh, come on.\n I don't want you teasing me like that....\\H\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "Insertion done by ♂"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Huh, you're putting it in already?\""
      tx["tx1"] = "\"Noooo, I'm gonna get fucked\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "\"#{pleasure_s}\n Man, you sure know when to be forceful....\\H\""
      tx["tx1"] = "\"#{pleasure_s}\n So huge and it's inside me....\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールド失敗
      tx["tx1"] = "\"I said not yet.\n You should learn to treat a girl more gently.\""
      tx["tx1"] = "\"#{giggle}\n I'm not letting you fuck me yet♪\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n Shouldn't keep me in suspense like that\\H\"" if $game_switches[89] == true
      tx["tx1"] = "\"Man, I just hate it when someone teases me....\n Hurry up and violate me good....\\H\"" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["md"]  = "11" if $game_switches[89] == true or $msg.t_enemy.lub_female > 30 #潤滑度30以上
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the user."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Augh, what's wrong？\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Oh geez,\n you don't want me to please you?\""
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "\"No-can-do♪\n I'm not letting you go\\H\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"No-can-do♪\n I'm not letting you go\\H\"" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the ally."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Augh, what's wrong？\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Augh, but I was just at the best part!\n Don't get in my way, #{target}!\""
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "\"#{giggle}\n I'm not letting you join in, #{target}\\H\n Just sit back and watch from there\\H\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n I'm not letting you join in, #{target}\\H\n Just sit back and watch from there\\H\"" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "Succubus binds the player."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"#{giggle}\n Lemme make you feel good\\H\""
  when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Humph....\""
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
    #自ら受け入れた場合
    tx["tx1"] = "\"You're not resisting at all!\n Does that mean you were looking forward to it? \\H\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "Insertion done by ♀"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"I might be rushing thing a little, but....\n I'm gonna eat you up\\H\""
      tx["tx1"] = "\"#{giggle}\n I'm gonna eat you up\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "\"#{giggle}\n You better be ready, #{target}....\\H\"" if $game_switches[86] == true #空腹戦
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n I said no running away!\""
      tx["tx1"] = "\"Augh, can you not run away?\n I'm not actually gonna eat you up....\\H\"" if $game_switches[86] == true #空腹戦
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Ooooh....\n A-A little too tight, I think....\\H\""
      tx["tx1"] = "\"Aha,\\H\n such a huge cock is inside me....\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "\"Aha,\\H\n this is what I wanted....\\H\"" if $game_switches[86] == true #空腹戦
      #自ら受け入れた場合
      tx["tx1"] = "\"Aaaah!\\H\n I-It's all the way in....\\H\"" if $game_switches[89] == true
      tx["tx1"] = "\"Aaaah!\\H\n It slid all the way in....\\H\"" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "\"Aha,\\H\n this is what I wanted....\\H\"" if $game_switches[86] == true #空腹戦
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted","Dark-sided"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey, #{target}....?\n Can you lick me down here for me....?\""
      tx["tx1"] = "\"Hey, #{target}....?\n I'm dripping wet down here....\\H\n Can't you lick it for me....? \\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n no running away!\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{giggle}\n Give it a good licking\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{pleasure_s}\n You don't hafta be that greedy about it\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "Backside Bind"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Here I come♪\n I'm gonna cling to you\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Geez, don't run away....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Got you♪\n I'll make you feel real good\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Got you♪\n you didn't run away, #{target}?\n Does that mean you were looking forward to it? \\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "Paizuri","Jiggly-Wiggly"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n I'm pretty confident in my boobs #{myname}♪\n ....Can you see for yourself? \\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Whaaa??\n You're not gonna?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{giggle}\n See how soft it is? \\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{giggle}\n See how soft it is? \\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "Kiss"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey, #{target}……？\n Let's make out a lot....\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Augh, you're a meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{kiss_s}\n ....#{giggle}\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{kiss_s}\n ....#{giggle}\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "♀ giving fellatio"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Lemme give you a blowjob\\H\""
      tx["tx1"] = "\"Say....#{target}....?\n Can I fuck you with my mouth....? \\H\"" if $game_switches[86] == true #空腹戦
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n no running away!\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Mmmph....mfu....\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Mmmph....mfu....\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"....#{giggle}\n Just relax, okay, #{target}....?\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Aha, I'm just joking\\H\n ....Maybe by half♪\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Nfufu....\\H\n You're just like a girl, #{target}....\\H\n Starting now, I'll make sure to violate you good\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Nfufu....\\H\n You're just like a girl, #{target}....\\H\n Starting now, I'll make sure to violate you good\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class




















#######################################################################################################################
####################################★ホールド：主人公がメインの口上群（ベッドイン）###################################
#######################################################################################################################
class MsgLessersuccubus_A < MsgBase
 def msg_bedin_hold_00
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("Significant Other")
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "Player binds the succubus."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"#{giggle}\n Wonder what you'll do to me? \\H\""
  when 2 #ホールド成功
    tx["tx1"] = "\"Augh\\H\n Hey, keep going, hurry up\\H\""
  when 3 #ホールド失敗
    tx["tx1"] = "\"Not yet\\H\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Oh, come on.\n I don't want you teasing me like that....\\H\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "Insertion done by ♂"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Aha, wanna put it in already?\""
      tx["tx1"] = "\"Aaaugh, hurry up and fuck me\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "\"#{pleasure_s}\n Man, you sure know when to be forceful....\\H\""
      tx["tx1"] = "\"#{pleasure_s}\n #{target}'s inside me....\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールド失敗
      tx["tx1"] = "\"Not yet\\H\n You should learn to treat a girl more gently♪\""
      tx["tx1"] = "\"#{giggle}\n I'm not letting you fuck me yet♪\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n Shouldn't keep me in suspense like that\\H\"" if $game_switches[89] == true
      tx["tx1"] = "\"Man, I just hate it when someone teases me....\n Hurry up and violate me good....\\H\"" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["md"]  = "11"
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the user."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Augh, what's wrong？\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Oh geez,\n you don't want me to please you?\""
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "\"No-can-do♪\n I'm not letting you go\\H\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"No-can-do♪\n I'm not letting you go\\H\"" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the ally."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Augh, what's wrong？\""
    when 2 #ホールド成功
      tx["tx1"] = "\"No helping it then....\\H\n Then I'll attack you next, #{target}\\H\""
      tx["md"]  = "12"
    when 3 #ホールド失敗
      tx["tx1"] = "\"#{giggle}\n Just sit back and watch from there, #{target}\\H\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n Just sit back and watch from there, #{target}\\H\"" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "Succubus binds the player."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"#{giggle}\n Lemme make you feel good\\H\""
  when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Humph....\""
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
    #自ら受け入れた場合
    tx["tx1"] = "\"You're not resisting at all!\n Does that mean you were looking forward to it? \\H\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "Insertion done by ♀"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"I might be rushing thing a little, but....\n I'm gonna eat you up\\H\""
      tx["tx1"] = "\"#{giggle}\n I'm gonna eat you up\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Aaaah!\\H\n I-It's all the way in....\\H\""
      tx["tx1"] = "\"Aaaah!\\H\n It slid all the way in....\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #自ら受け入れた場合
      tx["tx1"] = "\"Aaaah!\\H\n I-It's all the way in....\\H\"" if $game_switches[89] == true
      tx["tx1"] = "\"Aaaah!\\H\n It slid all the way in....\\H\"" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted","Dark-sided"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey, #{target}....?\n Can you lick me down here for me....?\""
      tx["tx1"] = "\"Hey, #{target}....?\n I'm dripping wet down here....\\H\n Can't you lick it for me....? \\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{giggle}\n Give it a good licking\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{pleasure_s}\n You don't hafta be that greedy about it\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "Backside Bind"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Here I come♪\n I'm gonna cling to you\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Got you♪\n I'll make you feel real good\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Got you♪\n I'll make you feel like you're melting\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "Paizuri","Jiggly-Wiggly"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Wanna try using my boobs? ♪\n ....If it's you, #{target}, I'm fine with it\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Whaaa??\n You're not gonna?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{giggle}\n See how soft it is? \\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{giggle}\n See how soft it is? \\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "Kiss"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey, #{target}……？\n Let's make out a lot....\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{kiss_s}\n ....#{giggle}\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{kiss_s}\n ....#{giggle}\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "♀ giving fellatio"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Lemme give you a blowjob\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Mmmph....mfu....\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Mmmph....mfu....\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"....#{giggle}\n Just relax, okay, #{target}....?\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Aha, I'm just joking\\H\n ....Maybe by half♪\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Nfufu....\\H\n You're just like a girl, #{target}....\\H\n Starting now, I'll make sure to violate you good\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Nfufu....\\H\n You're just like a girl, #{target}....\\H\n Starting now, I'll make sure to violate you good\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("Affection")
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "Player binds the succubus."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"#{giggle}\n Wonder what you'll do to me? \\H\""
  when 2 #ホールド成功
    tx["tx1"] = "\"Augh\\H\n Hey, keep going, hurry up\\H\""
  when 3 #ホールド失敗
    tx["tx1"] = "\"Not yet\\H\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Oh, come on.\n I don't want you teasing me like that....\\H\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "Insertion done by ♂"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Aha, wanna put it in already?\""
      tx["tx1"] = "\"Aaaugh, hurry up and fuck me\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "\"#{pleasure_s}\n Man, you sure know when to be forceful....\\H\""
      tx["tx1"] = "\"#{pleasure_s}\n #{target}'s inside me....\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールド失敗
      tx["tx1"] = "\"Not yet\\H\n You should learn to treat a girl more gently♪\""
      tx["tx1"] = "\"#{giggle}\n I'm not letting you fuck me yet♪\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n Shouldn't keep me in suspense like that\\H\"" if $game_switches[89] == true
      tx["tx1"] = "\"Man, I just hate it when someone teases me....\n Hurry up and violate me good....\\H\"" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["md"]  = "11"
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the user."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Augh, what's wrong？\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Oh geez,\n you don't want me to please you?\""
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "\"No-can-do♪\n I'm not letting you go\\H\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"No-can-do♪\n I'm not letting you go\\H\"" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the ally."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Augh, what's wrong？\""
    when 2 #ホールド成功
      tx["tx1"] = "\"No helping it then....\\H\n Then I'll attack you next, #{target}\\H\""
      tx["md"]  = "12"
    when 3 #ホールド失敗
      tx["tx1"] = "\"#{giggle}\n Just sit back and watch from there, #{target}\\H\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n Just sit back and watch from there, #{target}\\H\"" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "Succubus binds the player."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"#{giggle}\n Lemme make you feel good\\H\""
  when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Humph....\""
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
    #自ら受け入れた場合
    tx["tx1"] = "\"You're not resisting at all!\n Does that mean you were looking forward to it? \\H\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "Insertion done by ♀"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"I might be rushing thing a little, but....\n I'm gonna eat you up\\H\""
      tx["tx1"] = "\"#{giggle}\n I'm gonna eat you up\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Aaaah!\\H\n I-It's all the way in....\\H\""
      tx["tx1"] = "\"Aaaah!\\H\n It slid all the way in....\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #自ら受け入れた場合
      tx["tx1"] = "\"Aaaah!\\H\n I-It's all the way in....\\H\"" if $game_switches[89] == true
      tx["tx1"] = "\"Aaaah!\\H\n It slid all the way in....\\H\"" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted","Dark-sided"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey, #{target}....?\n Can you lick me down here for me....?\""
      tx["tx1"] = "\"Hey, #{target}....?\n I'm dripping wet down here....\\H\n Can't you lick it for me....? \\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{giggle}\n Give it a good licking\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{pleasure_s}\n You don't hafta be that greedy about it\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "Backside Bind"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Here I come♪\n I'm gonna cling to you\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Got you♪\n I'll make you feel real good\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Got you♪\n I'll make you feel like you're melting\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "Paizuri","Jiggly-Wiggly"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Wanna try using my boobs? ♪\n ....If it's you, #{target}, I'm fine with it\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Whaaa??\n You're not gonna?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{giggle}\n See how soft it is? \\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{giggle}\n See how soft it is? \\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "Kiss"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey, #{target}……？\n Let's make out a lot....\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{kiss_s}\n ....#{giggle}\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{kiss_s}\n ....#{giggle}\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "♀ giving fellatio"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Lemme give you a blowjob\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Mmmph....mfu....\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Mmmph....mfu....\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"....#{giggle}\n Just relax, okay, #{target}....?\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Aha, I'm just joking\\H\n ....Maybe by half♪\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Nfufu....\\H\n You're just like a girl, #{target}....\\H\n Starting now, I'll make sure to violate you good\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Nfufu....\\H\n You're just like a girl, #{target}....\\H\n Starting now, I'll make sure to violate you good\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "Player binds the succubus."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"#{giggle}\n Wonder what you'll do to me? \\H\""
  when 2 #ホールド成功
    tx["tx1"] = "\"Augh\\H\n Hey, keep going, hurry up\\H\""
  when 3 #ホールド失敗
    tx["tx1"] = "\"Not yet\\H\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Oh, come on.\n I don't want you teasing me like that....\\H\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "Insertion done by ♂"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Aha, wanna put it in already?\""
      tx["tx1"] = "\"Aaaugh, hurry up and fuck me\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "\"#{pleasure_s}\n Man, you sure know when to be forceful....\\H\""
      tx["tx1"] = "\"#{pleasure_s}\n #{target}'s inside me....\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールド失敗
      tx["tx1"] = "\"Not yet\\H\n You should learn to treat a girl more gently♪\""
      tx["tx1"] = "\"#{giggle}\n I'm not letting you fuck me yet♪\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n Shouldn't keep me in suspense like that\\H\"" if $game_switches[89] == true
      tx["tx1"] = "\"Man, I just hate it when someone teases me....\n Hurry up and violate me good....\\H\"" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["md"]  = "11"
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the user."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Augh, what's wrong？\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Oh geez,\n you don't want me to please you?\""
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "\"No-can-do♪\n I'm not letting you go\\H\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"No-can-do♪\n I'm not letting you go\\H\"" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the ally."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Augh, what's wrong？\""
    when 2 #ホールド成功
      tx["tx1"] = "\"No helping it then....\\H\n Then I'll attack you next, #{target}\\H\""
      tx["md"]  = "12"
    when 3 #ホールド失敗
      tx["tx1"] = "\"#{giggle}\n Just sit back and watch from there, #{target}\\H\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n Just sit back and watch from there, #{target}\\H\"" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "Succubus binds the player."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"#{giggle}\n Lemme make you feel good\\H\""
  when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Humph....\""
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
    #自ら受け入れた場合
    tx["tx1"] = "\"You're not resisting at all!\n Does that mean you were looking forward to it? \\H\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "Insertion done by ♀"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"I might be rushing thing a little, but....\n I'm gonna eat you up\\H\""
      tx["tx1"] = "\"#{giggle}\n I'm gonna eat you up\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Aaaah!\\H\n I-It's all the way in....\\H\""
      tx["tx1"] = "\"Aaaah!\\H\n It slid all the way in....\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #自ら受け入れた場合
      tx["tx1"] = "\"Aaaah!\\H\n I-It's all the way in....\\H\"" if $game_switches[89] == true
      tx["tx1"] = "\"Aaaah!\\H\n It slid all the way in....\\H\"" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted","Dark-sided"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey, #{target}....?\n Can you lick me down here for me....?\""
      tx["tx1"] = "\"Hey, #{target}....?\n I'm dripping wet down here....\\H\n Can't you lick it for me....? \\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{giggle}\n Give it a good licking\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{pleasure_s}\n You don't hafta be that greedy about it\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "Backside Bind"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Here I come♪\n I'm gonna cling to you\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Got you♪\n I'll make you feel real good\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Got you♪\n I'll make you feel like you're melting\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "Paizuri","Jiggly-Wiggly"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Wanna try using my boobs? ♪\n ....If it's you, #{target}, I'm fine with it\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Whaaa??\n You're not gonna?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{giggle}\n See how soft it is? \\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{giggle}\n See how soft it is? \\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "Kiss"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey, #{target}……？\n Let's make out a lot....\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{kiss_s}\n ....#{giggle}\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{kiss_s}\n ....#{giggle}\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "♀ giving fellatio
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Lemme give you a blowjob\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Oh come on,\n you meanie, #{target}....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Mmmph....mfu....\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Mmmph....mfu....\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"....#{giggle}\n Just relax, okay, #{target}....?\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Aha, I'm just joking\\H\n ....Maybe by half♪\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Nfufu....\\H\n You're just like a girl, #{target}....\\H\n Starting now, I'll make sure to violate you good\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Nfufu....\\H\n You're just like a girl, #{target}....\\H\n Starting now, I'll make sure to violate you good\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
end #ability
 end #def
end #class
