=begin
#######################################################################################################################
 ●『サキュバス（桃）』戦闘開始、終了口上
 ●性格：好色
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end

class MsgSuccubus_B < MsgBase
 def msg_op_and_ep_00
#=======================================================================================================================
# ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
#----------------------------------------------------------------------------------------------------------------------
if $msg.tag == "Start the Battle"
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            if $game_switches[85] == true
                              tx["md"] = "12" if $msg.talk_step == 1
                              tx["md"] = "12" if $msg.talk_step == 2
                              tx["md"] = "12" if $msg.talk_step == 3
                              tx["md"] = "14" if $msg.talk_step == 1 and $msg.t_enemy.bedin_count == 0
                              tx["md"] = "14" if $msg.talk_step == 2 and $msg.t_enemy.bedin_count == 0
                              tx["md"] = "14" if $msg.talk_step == 3 and $msg.t_enemy.bedin_count == 0
                            elsif $game_switches[86] == true
                              tx["md"] = "0"
                            else
                              tx["md"] = "13" if $msg.talk_step == 1
                              tx["md"] = "12" if $msg.talk_step == 2
                              tx["md"] = "11" if $msg.talk_step == 3
                            end
  #----------------------------------------------------------------------------------------------------------------------
  #●ベッドイン中
  if $game_switches[85] == true
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "\"#{giggle}\n Then how about we get the ball rolling right away ?\\H\n Tonight's gonna get steamy too....\\H」"
      #▼初ベッドイン
      tx["tx1"] = "\"Ufufu....a room like this isn't too shabby either\\H\n Let's both forget ourselves....\n and roughly indulge in each other\\H\"" if $msg.t_enemy.bedin_count == 0
    when 1 #２番目
      tx["tx1"] = "\"Looks like the night's gonna be long....\\H\n Let's enjoy ourselves as much as we can\\H」"
      #▼初ベッドイン
      tx["tx1"] = "\"#{giggle}\n I better repay you for form a contract with me\\H\n All with my body, of course....\\H\"" if $msg.t_enemy.bedin_count == 0
    when 2 #３番目
      tx["tx1"] = "\"#{giggle}\n Wanna see how many times you can cum tonight? \""
      #▼初ベッドイン
      tx["tx1"] = "\"#{giggle}\n My body's yours and yours only, #{target}\\H\n Indulge in in all you want....\\H\"" if $msg.t_enemy.bedin_count == 0
    end
  #●空腹戦闘中
  elsif $game_switches[86] == true
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "\"#{giggle}\n I'd say a mischievous boy deserves to punished\\H\""
    when 1 #２番目
      tx["tx1"] = "\"Maybe a little pain would go a long way?\n....、気持ちいいコト、の間違いだったわ\\H\""
    when 2 #３番目
      tx["tx1"] = "\"さて、と……\\H\n　心の準備と……覚悟はいいかしらね？\\H\""
    end
  #●レア戦闘中(OFEの場合は[$game_switches[92] == true]、BOSSの場合は[$game_switches[91] == true]をそれぞれelsifでつけること)
  else
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "\"あら……\\H\n　美味しそうな子が迷い込んで来たわね\\H\n　ふふ、少し遊んであげようかしら……\\H\""
    when 1 #２番目
      tx["tx1"] = "\"ねぇ、こっちにいらっしゃい。\n　お姉さんたちが、いいコトしてあげる\\H\""
    when 2 #３番目
      tx["tx1"] = "\"怖がらなくてもいいのよ\\H\n　ほんの少しの間、\n You'll get to have a nice, pleasant dream....\\H\""
    end
  end
  #格納
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
#■逃走失敗口上
elsif $msg.tag == "Escape fail"
  tx["tx1"] = "\"ふふふ……♪\n　だ～め、逃がさないわ。\n　大人しく#{myname}のモノになりなさい\\H\""
  #----------------------------------------------------------------------------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
#■契約口上
elsif $msg.tag == "Contract"
  #----------------------#
  #▼ステップで状況判断  #
  #----------------------#
  case $msg.talk_step
  #▼契約開始
  when 1 
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "\"あぁん……\\H\n　気持ちよかったわ\\H\n　見かけによらず凄いのね……\\H\""
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "\"ねぇ、#{target}……？\n　#{myname}を自分のモノにしてみる気、ない？\""
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx3"] = "\"#{myname}のカラダを好きに蹂躙できる契約……\\H\n　どうかしら、悪い提案ではないと思うけれど？\""
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約締結(即座に仲間に入る)
  when 2
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "\"ふふっ……\\H\n　契約成立、ね\\H\""
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "\"You'll be my owner from now on, #{target}.\n Glad to meet you, my adorable master\\H\""
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約締結(ホームに送る)
  when 3
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "\"ふふっ……\\H\n　契約成立、ね\\H\n　それじゃ、先に戻ってベッドの準備をしておくわ\""
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "\"早く帰って来てくれると嬉しいわ\\H\n　じゃ、今後ともよろしく、可愛い契約主さん♪\""
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約を行わない
  when 4
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "\"#{giggle}\n　見た目以上にストイックなのね。\n　嫌いじゃないわ、そういうのも\""
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "\"また会いに来てちょうだい。\n　#{target}なら色々と歓迎してあげるわ。\n　色々と……ね\\H\""
    #----------------------------------------------------------------------------------------------------------------------
  end
  #格納
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
end
#######################################################################################################################
 end #def
end #class
