=begin
#######################################################################################################################
 ●『サキュバス（桃）』戦闘開始、終了口上
 ●性格：好色
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end

class MsgSuccubus_B < MsgBase
 def msg_op_and_ep_00
#=======================================================================================================================
# ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
#----------------------------------------------------------------------------------------------------------------------
if $msg.tag == "戦闘開始"
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            if $game_switches[85] == true
                              tx["md"] = "12" if $msg.talk_step == 1
                              tx["md"] = "12" if $msg.talk_step == 2
                              tx["md"] = "12" if $msg.talk_step == 3
                              tx["md"] = "14" if $msg.talk_step == 1 and $msg.t_enemy.bedin_count == 0
                              tx["md"] = "14" if $msg.talk_step == 2 and $msg.t_enemy.bedin_count == 0
                              tx["md"] = "14" if $msg.talk_step == 3 and $msg.t_enemy.bedin_count == 0
                            elsif $game_switches[86] == true
                              tx["md"] = "0"
                            else
                              tx["md"] = "13" if $msg.talk_step == 1
                              tx["md"] = "12" if $msg.talk_step == 2
                              tx["md"] = "11" if $msg.talk_step == 3
                            end
  #----------------------------------------------------------------------------------------------------------------------
  #●ベッドイン中
  if $game_switches[85] == true
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「#{giggle}\n　それじゃ、早速始めましょうか\\H\n　今夜も熱くなりそう……\\H」"
      #▼初ベッドイン
      tx["tx1"] = "「ふふっ……こういう個室も悪くないわね\\H\n　さぁ、お互い我を忘れて……。\n　激しく貪りあいましょうか\\H」" if $msg.t_enemy.bedin_count == 0
    when 1 #２番目
      tx["tx1"] = "「長い夜になりそうね……\\H\n　さ、目一杯愉しみましょう\\H」"
      #▼初ベッドイン
      tx["tx1"] = "「#{giggle}\n　#{myname}と契約してくれたお礼をしないと\\H\n　もちろん、#{target}の身体にたっぷりと……ね\\H」" if $msg.t_enemy.bedin_count == 0
    when 2 #３番目
      tx["tx1"] = "「#{giggle}\n　今夜は何回までイけるか挑戦してみる？」"
      #▼初ベッドイン
      tx["tx1"] = "「#{giggle}\n　#{myname}のカラダは#{target}だけのものよ\\H\n　思うままに貪ってね……\\H」" if $msg.t_enemy.bedin_count == 0
    end
  #●空腹戦闘中
  elsif $game_switches[86] == true
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「#{giggle}\n　さぁて、おイタをする子にお仕置きしなきゃ\\H」"
    when 1 #２番目
      tx["tx1"] = "「ちょっとは痛い目を見たほうがいいかしら？\n　……ああ、気持ちいいコト、の間違いだったわ\\H」"
    when 2 #３番目
      tx["tx1"] = "「さて、と……\\H\n　心の準備と……覚悟はいいかしらね？\\H」"
    end
  #●レア戦闘中(OFEの場合は[$game_switches[92] == true]、BOSSの場合は[$game_switches[91] == true]をそれぞれelsifでつけること)
  else
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「あら……\\H\n　美味しそうな子が迷い込んで来たわね\\H\n　ふふ、少し遊んであげようかしら……\\H」"
    when 1 #２番目
      tx["tx1"] = "「ねぇ、こっちにいらっしゃい。\n　お姉さんたちが、いいコトしてあげる\\H」"
    when 2 #３番目
      tx["tx1"] = "「怖がらなくてもいいのよ\\H\n　ほんの少しの間、\n　気持ちのいい夢が見られるだけだから……\\H」"
    end
  end
  #格納
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
#■逃走失敗口上
elsif $msg.tag == "逃走失敗"
  tx["tx1"] = "「ふふふ……♪\n　だ～め、逃がさないわ。\n　大人しく#{myname}のモノになりなさい\\H」"
  #----------------------------------------------------------------------------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
#■契約口上
elsif $msg.tag == "契約"
  #----------------------#
  #▼ステップで状況判断  #
  #----------------------#
  case $msg.talk_step
  #▼契約開始
  when 1 
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「あぁん……\\H\n　気持ちよかったわ\\H\n　見かけによらず凄いのね……\\H」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「ねぇ、#{target}……？\n　#{myname}を自分のモノにしてみる気、ない？」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx3"] = "「#{myname}のカラダを好きに蹂躙できる契約……\\H\n　どうかしら、悪い提案ではないと思うけれど？」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約締結(即座に仲間に入る)
  when 2
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「ふふっ……\\H\n　契約成立、ね\\H」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「それじゃ今から、#{target}は#{myname}の主よ。\n　今後ともよろしく、可愛い契約主さん♪」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約締結(ホームに送る)
  when 3
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「ふふっ……\\H\n　契約成立、ね\\H\n　それじゃ、先に戻ってベッドの準備をしておくわ」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「早く帰って来てくれると嬉しいわ\\H\n　じゃ、今後ともよろしく、可愛い契約主さん♪」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約を行わない
  when 4
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「#{giggle}\n　見た目以上にストイックなのね。\n　嫌いじゃないわ、そういうのも」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「また会いに来てちょうだい。\n　#{target}なら色々と歓迎してあげるわ。\n　色々と……ね\\H」"
    #----------------------------------------------------------------------------------------------------------------------
  end
  #格納
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
end
#######################################################################################################################
 end #def
end #class
