=begin
#######################################################################################################################
 ●『サキュバス（桃）』レジスト実行口上（ホールド関連・対主人公）
 ●性格：好色
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end





#######################################################################################################################
########################################★ホールド：主人公がメインの口上群#############################################
#######################################################################################################################
class MsgSuccubus_B < MsgBase
 def msg_hold_00
#==================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　#{myname}をどうしてくれるのかしら？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「#{pleasure_s}\n　さあ、もっと愉しませて……\\H」"
  when 3 #ホールド失敗
    tx["tx1"] = "「もう、焦らさないで……\\H」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「もう、焦らさないで……\\H」" if $game_switches[89] == true
    tx["md"] = "11"
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　もう……せっかちさんね♪」"
      tx["tx1"] = "「#{giggle}\n　挿れてみたいの？#{myname}のココに……\\H」" if $msg.t_enemy.lub_female > 30
      tx["tx1"] = "「早く……早く来てぇ……！\\H」" if $game_switches[86] == true #空腹戦
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　#{target}のが奥まで届いてる……\\H」"
      tx["tx1"] = "「#{pleasure_s}\n　#{target}のが奥まで届いてる……\\H」" if $msg.t_enemy.lub_female > 30
      tx["tx1"] = "「#{pleasure_s}\n　これよ、これが欲しかったのぉ……っ\\H」" if $game_switches[86] == true #空腹戦
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　まだ早すぎるわ、もっとゆっくり……ね\\H」"
      tx["tx1"] = "「#{giggle}\n　焦りすぎよ、もっと落ち着いて……ね\\H」" if $msg.t_enemy.lub_female > 30
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　慌てなくても逃げやしないわ。\n　もっとゆっくり愉しみましょう\\H」" if $game_switches[89] == true
      tx["tx1"] = "「#{giggle}\n　慌てなくても逃げやしないわ。\n　もっとゆっくり愉しみましょう\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30
      tx["tx1"] = "「あぁん、焦らしちゃイヤっ……！\n　早く#{myname}をめちゃめちゃにして……！」" if $game_switches[86] == true #空腹戦
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん……どうしたの？」"
    when 2 #ホールド成功
      tx["tx1"] = "「止めちゃうの？\n　残念ねぇ……」"
      tx["tx1"] = "「あぁん、どうしてぇ？」" if $game_switches[86] == true #空腹戦
      tx["md"] = "11" unless $game_switches[86] == true #空腹戦でない場合
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{myname}に任せて……？\n　もっと気持ちよくなりましょ\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　そうそう、#{myname}に任せて……？\n　もっと気持ちよくなりましょ\\H」" if $game_switches[89] == true
      tx["tx1"] = "「ふふ……逃がさないわよ？\\H」" if $game_switches[86] == true #空腹戦
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あら……どうしたの？\n　構って欲しいのかしら……？\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「仕方ないわねえ。\n　それじゃ、相手してあげる\\H」"
      tx["md"] = "12"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　心配しなくても、\n　#{target}にも後でシてあげるわよ\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　心配しなくても、\n　#{target}にも後でシてあげるわよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「気持ち良くしてあげる……\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「あぁん……。\n　抵抗しないで、ね？」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「#{giggle}\n　さあ、もっと愉しみましょう\\H」"
    #自ら受け入れた場合
    tx["tx1"] = "「#{giggle}\n　さあ、もっと愉しみましょう\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　少し早いけど、挿れちゃおうか……\\H」"
      tx["tx1"] = "「#{giggle}\n　そろそろ挿れちゃおうか……\\H」" if $msg.t_enemy.lub_female > 30
      tx["tx1"] = "「#{target}のが欲しくてたまらないの……！\n　ねぇ、いいでしょう？」" if $game_switches[86] == true #空腹戦
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、焦らさないで……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　とっても熱くて硬い……\\H」"
      tx["tx1"] = "「#{pleasure_s}\n　とっても熱くて硬い……\\H」" if $msg.t_enemy.lub_female > 30
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　どうかしら、#{myname}の中……\\H」" if $game_switches[89] == true
      tx["tx1"] = "「#{pleasure_s}\n　どうかしら、#{myname}の中……\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30
      tx["tx1"] = "「#{pleasure_s}\n　これよ、これが欲しかったのぉ……っ\\H」" if $game_switches[86] == true #空腹戦
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ねぇ、#{myname}のココ、舐めてくれるかしら？」"
      tx["tx1"] = "「#{giggle}\n　#{myname}のココ、もうびしょ濡れなの……\\H\n　ねぇ、舐めてくれないかしら……？\\H」" if $msg.t_enemy.lub_female > 30
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、焦らさないで……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　もっと舌を入れてもいいわよ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、全然抵抗しないのね。\n　こういうコトされるのは好き？\\H」" if $game_switches[89] == true
      tx["tx1"] = "「#{pleasure_s}\n　息が出来なくなるくらいシてあげる\\H」" if $game_switches[86] == true #空腹戦
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　もっと近くで愛し合いましょう\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、抵抗しないで、ね……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　#{target}の息遣いを感じるわ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　#{target}の息遣いを感じるわ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{myname}の胸で溺れさせてあげる\\H\n　さ、力を抜いて、楽にしてて……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、抵抗しないで、ね……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　どうかしら、#{myname}の胸の感触……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　抵抗しないのね、おっぱいが好きなの？\\H\n　なら、たっぷり愉しませてあげる\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、キスして……？\n　#{target}を強く感じられるくらい……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、焦らさないで……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ねぇ、#{myname}の口を犯してみない？\\H」"
      tx["tx1"] = "「ねぇ、もう我慢できないの……\\H\n　#{target}のをしゃぶらせて……\\H」" if $game_switches[86] == true #空腹戦
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、怖くなんかないわよ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「んふぅ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「んふぅ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　イケナイ快楽を教えてあげる……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、怖くなんかないわよ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふ、入っちゃった……\\H\n　最初は苦しいかもしれないけど、\n　すぐに良くなってくるわよ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふ、入っちゃった……\\H\n　最初は苦しいかもしれないけど、\n　すぐに良くなってくるわよ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class




















#######################################################################################################################
####################################★ホールド：主人公がメインの口上群（ベッドイン）###################################
#######################################################################################################################
class MsgSuccubus_B < MsgBase
 def msg_bedin_hold_00
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("大切な人")
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　#{myname}をどうしてくれるのかしら？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「#{pleasure_s}\n　さあ、もっと愉しませて……\\H」"
  when 3 #ホールド失敗
    tx["tx1"] = "「もう、焦らさないで……\\H」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「もう、焦らさないで……\\H」" if $game_switches[89] == true
    tx["md"] = "11"
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　いいわ、来て……\\H」"
      tx["tx1"] = "「#{giggle}\n　いいわ、来て……\\H」" if $msg.t_enemy.lub_female > 30
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　#{target}のが奥まで届いてる……\\H」"
      tx["tx1"] = "「#{pleasure_s}\n　#{target}のが奥まで届いてる……\\H」" if $msg.t_enemy.lub_female > 30
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　焦りすぎよ、もっと落ち着いて……ね\\H」"
      tx["tx1"] = "「#{giggle}\n　焦りすぎよ、もっと落ち着いて……ね\\H」" if $msg.t_enemy.lub_female > 30
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　慌てなくても逃げやしないわ。\n　もっとゆっくり愉しみましょう\\H」" if $game_switches[89] == true
      tx["tx1"] = "「#{giggle}\n　慌てなくても逃げやしないわ。\n　もっとゆっくり愉しみましょう\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん……どうしたの？」"
    when 2 #ホールド成功
      tx["tx1"] = "「止めちゃうの？\n　残念ねぇ……」"
      tx["md"] = "11"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{myname}に任せて……？\n　もっと気持ちよくなりましょ\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　そうそう、#{myname}に任せて……？\n　もっと気持ちよくなりましょ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あら……どうしたの？\n　#{target}も混ざりたい？」"
    when 2 #ホールド成功
      tx["tx1"] = "「仕方ないわねえ。\n　それじゃ、相手してあげる\\H」"
      tx["md"] = "12"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　心配しなくても、\n　#{target}にも後でシてあげるわよ\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　心配しなくても、\n　#{target}にも後でシてあげるわよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「気持ち良くしてあげる……\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「あぁん……。\n　少しくらいいいじゃない」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「#{giggle}\n　さあ、もっと愉しみましょう\\H」"
    #自ら受け入れた場合
    tx["tx1"] = "「#{giggle}\n　さあ、もっと愉しみましょう\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　少し早いけど、挿れちゃおうか……\\H」"
      tx["tx1"] = "「#{giggle}\n　そろそろ挿れちゃおうか……\\H」" if $msg.t_enemy.lub_female > 30
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、焦らさないで……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　とっても熱くて硬い……\\H」"
      tx["tx1"] = "「#{pleasure_s}\n　とっても熱くて硬い……\\H」" if $msg.t_enemy.lub_female > 30
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　どうかしら、#{myname}の中……\\H」" if $game_switches[89] == true
      tx["tx1"] = "「#{pleasure_s}\n　どうかしら、#{myname}の中……\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ねぇ、#{myname}のココ、舐めてくれるかしら？」"
      tx["tx1"] = "「#{giggle}\n　#{myname}のココ、もうびしょ濡れなの……\\H\n　ねぇ、舐めてくれないかしら……？\\H」" if $msg.t_enemy.lub_female > 30
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、焦らさないで……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　もっと舌を入れてもいいわよ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、全然抵抗しないのね。\n　こういうコトされるのは好き？\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　もっと近くで愛し合いましょう\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、抵抗しないで、ね……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　#{target}の息遣いを感じるわ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　#{target}の息遣いを感じるわ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{myname}の胸で溺れさせてあげる\\H\n　さ、力を抜いて、楽にしてて……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、抵抗しないで、ね……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　どうかしら、#{myname}の胸の感触……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　抵抗しないのね、おっぱいが好きなの？\\H\n　なら、たっぷり愉しませてあげる\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、キスして……？\n　#{target}を強く感じられるくらい……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、焦らさないで……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ねぇ、#{myname}の口を犯してみない？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、怖くなんかないわよ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「んふぅ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「んふぅ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　イケナイ快楽を教えてあげる……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、怖くなんかないわよ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふ、入っちゃった……\\H\n　最初は苦しいかもしれないけど、\n　すぐに良くなってくるわよ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふ、入っちゃった……\\H\n　最初は苦しいかもしれないけど、\n　すぐに良くなってくるわよ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("寵愛")
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　#{myname}をどうしてくれるのかしら？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「#{pleasure_s}\n　さあ、もっと愉しませて……\\H」"
  when 3 #ホールド失敗
    tx["tx1"] = "「もう、焦らさないで……\\H」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「もう、焦らさないで……\\H」" if $game_switches[89] == true
    tx["md"] = "11"
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　いいわ、来て……\\H」"
      tx["tx1"] = "「#{giggle}\n　いいわ、来て……\\H」" if $msg.t_enemy.lub_female > 30
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　#{target}のが奥まで届いてる……\\H」"
      tx["tx1"] = "「#{pleasure_s}\n　#{target}のが奥まで届いてる……\\H」" if $msg.t_enemy.lub_female > 30
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　焦りすぎよ、もっと落ち着いて……ね\\H」"
      tx["tx1"] = "「#{giggle}\n　焦りすぎよ、もっと落ち着いて……ね\\H」" if $msg.t_enemy.lub_female > 30
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　慌てなくても逃げやしないわ。\n　もっとゆっくり愉しみましょう\\H」" if $game_switches[89] == true
      tx["tx1"] = "「#{giggle}\n　慌てなくても逃げやしないわ。\n　もっとゆっくり愉しみましょう\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん……どうしたの？」"
    when 2 #ホールド成功
      tx["tx1"] = "「止めちゃうの？\n　残念ねぇ……」"
      tx["md"] = "11"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{myname}に任せて……？\n　もっと気持ちよくなりましょ\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　そうそう、#{myname}に任せて……？\n　もっと気持ちよくなりましょ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あら……どうしたの？\n　#{target}も混ざりたい？」"
    when 2 #ホールド成功
      tx["tx1"] = "「仕方ないわねえ。\n　それじゃ、相手してあげる\\H」"
      tx["md"] = "12"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　心配しなくても、\n　#{target}にも後でシてあげるわよ\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　心配しなくても、\n　#{target}にも後でシてあげるわよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「気持ち良くしてあげる……\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「あぁん……。\n　少しくらいいいじゃない」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「#{giggle}\n　さあ、もっと愉しみましょう\\H」"
    #自ら受け入れた場合
    tx["tx1"] = "「#{giggle}\n　さあ、もっと愉しみましょう\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　少し早いけど、挿れちゃおうか……\\H」"
      tx["tx1"] = "「#{giggle}\n　そろそろ挿れちゃおうか……\\H」" if $msg.t_enemy.lub_female > 30
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、焦らさないで……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　とっても熱くて硬い……\\H」"
      tx["tx1"] = "「#{pleasure_s}\n　とっても熱くて硬い……\\H」" if $msg.t_enemy.lub_female > 30
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　どうかしら、#{myname}の中……\\H」" if $game_switches[89] == true
      tx["tx1"] = "「#{pleasure_s}\n　どうかしら、#{myname}の中……\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ねぇ、#{myname}のココ、舐めてくれるかしら？」"
      tx["tx1"] = "「#{giggle}\n　#{myname}のココ、もうびしょ濡れなの……\\H\n　ねぇ、舐めてくれないかしら……？\\H」" if $msg.t_enemy.lub_female > 30
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、焦らさないで……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　もっと舌を入れてもいいわよ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、全然抵抗しないのね。\n　こういうコトされるのは好き？\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　もっと近くで愛し合いましょう\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、抵抗しないで、ね……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　#{target}の息遣いを感じるわ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　#{target}の息遣いを感じるわ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{myname}の胸で溺れさせてあげる\\H\n　さ、力を抜いて、楽にしてて……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、抵抗しないで、ね……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　どうかしら、#{myname}の胸の感触……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　抵抗しないのね、おっぱいが好きなの？\\H\n　なら、たっぷり愉しませてあげる\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、キスして……？\n　#{target}を強く感じられるくらい……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、焦らさないで……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ねぇ、#{myname}の口を犯してみない？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、怖くなんかないわよ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「んふぅ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「んふぅ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　イケナイ快楽を教えてあげる……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、怖くなんかないわよ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふ、入っちゃった……\\H\n　最初は苦しいかもしれないけど、\n　すぐに良くなってくるわよ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふ、入っちゃった……\\H\n　最初は苦しいかもしれないけど、\n　すぐに良くなってくるわよ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　#{myname}をどうしてくれるのかしら？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「#{pleasure_s}\n　さあ、もっと愉しませて……\\H」"
  when 3 #ホールド失敗
    tx["tx1"] = "「もう、焦らさないで……\\H」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「もう、焦らさないで……\\H」" if $game_switches[89] == true
    tx["md"] = "11"
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　いいわ、来て……\\H」"
      tx["tx1"] = "「#{giggle}\n　いいわ、来て……\\H」" if $msg.t_enemy.lub_female > 30
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　#{target}のが奥まで届いてる……\\H」"
      tx["tx1"] = "「#{pleasure_s}\n　#{target}のが奥まで届いてる……\\H」" if $msg.t_enemy.lub_female > 30
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　焦りすぎよ、もっと落ち着いて……ね\\H」"
      tx["tx1"] = "「#{giggle}\n　焦りすぎよ、もっと落ち着いて……ね\\H」" if $msg.t_enemy.lub_female > 30
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　慌てなくても逃げやしないわ。\n　もっとゆっくり愉しみましょう\\H」" if $game_switches[89] == true
      tx["tx1"] = "「#{giggle}\n　慌てなくても逃げやしないわ。\n　もっとゆっくり愉しみましょう\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん……どうしたの？」"
    when 2 #ホールド成功
      tx["tx1"] = "「止めちゃうの？\n　残念ねぇ……」"
      tx["md"] = "11"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{myname}に任せて……？\n　もっと気持ちよくなりましょ\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　そうそう、#{myname}に任せて……？\n　もっと気持ちよくなりましょ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あら……どうしたの？\n　#{target}も混ざりたい？」"
    when 2 #ホールド成功
      tx["tx1"] = "「仕方ないわねえ。\n　それじゃ、相手してあげる\\H」"
      tx["md"] = "12"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　心配しなくても、\n　#{target}にも後でシてあげるわよ\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　心配しなくても、\n　#{target}にも後でシてあげるわよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「気持ち良くしてあげる……\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「あぁん……。\n　少しくらいいいじゃない」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「#{giggle}\n　さあ、もっと愉しみましょう\\H」"
    #自ら受け入れた場合
    tx["tx1"] = "「#{giggle}\n　さあ、もっと愉しみましょう\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　少し早いけど、挿れちゃおうか……\\H」"
      tx["tx1"] = "「#{giggle}\n　そろそろ挿れちゃおうか……\\H」" if $msg.t_enemy.lub_female > 30
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、焦らさないで……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　とっても熱くて硬い……\\H」"
      tx["tx1"] = "「#{pleasure_s}\n　とっても熱くて硬い……\\H」" if $msg.t_enemy.lub_female > 30
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　どうかしら、#{myname}の中……\\H」" if $game_switches[89] == true
      tx["tx1"] = "「#{pleasure_s}\n　どうかしら、#{myname}の中……\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ねぇ、#{myname}のココ、舐めてくれるかしら？」"
      tx["tx1"] = "「#{giggle}\n　#{myname}のココ、もうびしょ濡れなの……\\H\n　ねぇ、舐めてくれないかしら……？\\H」" if $msg.t_enemy.lub_female > 30
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、焦らさないで……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　もっと舌を入れてもいいわよ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、全然抵抗しないのね。\n　こういうコトされるのは好き？\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　もっと近くで愛し合いましょう\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、抵抗しないで、ね……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　#{target}の息遣いを感じるわ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　#{target}の息遣いを感じるわ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{myname}の胸で溺れさせてあげる\\H\n　さ、力を抜いて、楽にしてて……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、抵抗しないで、ね……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　どうかしら、#{myname}の胸の感触……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　抵抗しないのね、おっぱいが好きなの？\\H\n　なら、たっぷり愉しませてあげる\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、キスして……？\n　#{target}を強く感じられるくらい……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、焦らさないで……？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ねぇ、#{myname}の口を犯してみない？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、怖くなんかないわよ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「んふぅ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「んふぅ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　イケナイ快楽を教えてあげる……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、怖くなんかないわよ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふ、入っちゃった……\\H\n　最初は苦しいかもしれないけど、\n　すぐに良くなってくるわよ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふ、入っちゃった……\\H\n　最初は苦しいかもしれないけど、\n　すぐに良くなってくるわよ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
end #ability
 end #def
end #class
