=begin
#######################################################################################################################
 ●『サキュバスロード（橙）』レジスト実行口上（衣装関連・対パートナー）
 ●性格：陽気
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 2016,07/25     仮稿流し込み。
#######################################################################################################################
=end





#######################################################################################################################
#########################################★脱衣：パートナーがメインの口上群################################################
#######################################################################################################################
class MsgSuccubuslord_A < MsgBase
 def msg_female_undress_07
#=======================================================================================================================
# ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #レジスト成功
                              tx["md"] = "2" if $msg.tag == "Succubus strips the partner." #脱衣できなかった
                              tx["md"] = "3" if $msg.tag == "Partner strips the succubus." #相手を脱衣させた
                            when 3 #レジスト失敗
                              tx["md"] = "3" if $msg.tag == "Succubus strips the partner." #脱衣させられた
                              tx["md"] = "2" if $msg.tag == "Partner strips the succubus." #相手を脱衣できなかった
                            end
case $msg.tag
#====================================================================================================================
#■夢魔がパートナーを脱衣させる
#====================================================================================================================
when "Succubus strips the partner."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"What say we have some fun together?\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 2 #パートナーが抵抗した
    tx["tx1"] = "\"How cold....\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 3 #パートナーが脱衣した
    tx["tx1"] = "\"Such a pretty and wonderful body....\\H\n You'd be a fool to not enjoy\n such golden opportunity with all your heart\\H\""
    #▼自ら受け入れた場合
    tx["tx1"] = "\"#{giggle_s}\\H\n Good to see that even the partner\n here's in the mood....\\H\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■パートナーが夢魔を脱衣させる
#====================================================================================================================
when "Partner strips the succubus."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"#{giggle_s} You're going to take it off for me?\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 2 #夢魔を脱衣させた
    tx["tx1"] = "\"#{giggle_s} Thanks.\n Then let's carry on\\H\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 3 #夢魔に抵抗された
    tx["tx1"] = "\"Don't you brush me off like that.\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Oh....?\n Wonder what you're up to.\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■パートナーが自ら脱衣する
#====================================================================================================================
when "Partner undresses themself."
  tx["tx1"] = "\"#{giggle_s} You couldn't wait?\""
  tx["tx1"] = "\"#{giggle_s} I've been waiting\\H\"" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)
#====================================================================================================================
#■夢魔が自ら脱衣する
#====================================================================================================================
when "Succubus undresses herself."
  #------------------------------------------------------------------------------------------------------------------
  tx["tx1"] = "\"Ufufu, I've kept you waiting\\H\""
  tx["tx1"] = "\"Let's have a more passionate love\\H\"" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)
#----------------------------------------------------------------------------------------------------------------------
end #case $msg.tag
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class










#######################################################################################################################
#####################################★脱衣：パートナーがメインの口上群(ベッドイン)########################################
#######################################################################################################################
class MsgSuccubuslord_A < MsgBase
 def msg_female_bedin_undress_07
#====================================================================================================================
# ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #レジスト成功
                              tx["md"] = "2" if $msg.tag == "夢魔がパートナーを脱衣" #脱衣できなかった
                              tx["md"] = "3" if $msg.tag == "パートナーが夢魔を脱衣" #相手を脱衣させた
                            when 3 #レジスト失敗
                              tx["md"] = "3" if $msg.tag == "夢魔がパートナーを脱衣" #脱衣させられた
                              tx["md"] = "2" if $msg.tag == "パートナーが夢魔を脱衣" #相手を脱衣できなかった
                            end
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("Significant Other")
#====================================================================================================================
  case $msg.tag
  #====================================================================================================================
  #■夢魔がパートナーを脱衣させる
  #====================================================================================================================
when "Succubus strips the partner."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"What say we have some fun together?\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 2 #パートナーが抵抗した
    tx["tx1"] = "\"How cold....\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 3 #パートナーが脱衣した
    tx["tx1"] = "\"Such a pretty and wonderful body....\\H\n You'd be a fool to not enjoy\n such golden opportunity with all your heart\\H\""
    #▼自ら受け入れた場合
    tx["tx1"] = "\"#{giggle_s}\\H\n Good to see that even the partner\n here's in the mood....\\H\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■パートナーが夢魔を脱衣させる
#====================================================================================================================
when "Partner strips the succubus."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"#{giggle_s} You're going to take it off for me?\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 2 #夢魔を脱衣させた
    tx["tx1"] = "\"#{giggle_s} Thanks.\n Then let's carry on\\H\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 3 #夢魔に抵抗された
    tx["tx1"] = "\"Don't you brush me off like that.\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Oh....?\n Wonder what you're up to.\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■パートナーが自ら脱衣する
#====================================================================================================================
when "Partner undresses themself."
  tx["tx1"] = "\"#{giggle_s} You couldn't wait?\""
  tx["tx1"] = "\"#{giggle_s} I've been waiting\\H\"" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)
#====================================================================================================================
#■夢魔が自ら脱衣する
#====================================================================================================================
when "Succubus undresses herself."
  #------------------------------------------------------------------------------------------------------------------
  tx["tx1"] = "\"Ufufu, I've kept you waiting\\H\""
  tx["tx1"] = "\"Let's have a more passionate love\\H\"" if $msg.t_target.nude? #アクターが先に脱いでいた
    #---------------------------------------------------
    #格納
    tx["md"] = "3"
    ms.push(tx)
  #----------------------------------------------------------------------------------------------------------------------
  end #case $msg.tag










#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("Affection")
#====================================================================================================================
  case $msg.tag
  #====================================================================================================================
  #■夢魔がパートナーを脱衣させる
  #====================================================================================================================
when "Succubus strips the partner."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"What say we have some fun together?\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 2 #パートナーが抵抗した
    tx["tx1"] = "\"How cold....\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 3 #パートナーが脱衣した
    tx["tx1"] = "\"Such a pretty and wonderful body....\\H\n You'd be a fool to not enjoy\n such golden opportunity with all your heart\\H\""
    #▼自ら受け入れた場合
    tx["tx1"] = "\"#{giggle_s}\\H\n Good to see that even the partner\n here's in the mood....\\H\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■パートナーが夢魔を脱衣させる
#====================================================================================================================
when "Partner strips the succubus."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"#{giggle_s} You're going to take it off for me?\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 2 #夢魔を脱衣させた
    tx["tx1"] = "\"#{giggle_s} Thanks.\n Then let's carry on\\H\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 3 #夢魔に抵抗された
    tx["tx1"] = "\"Don't you brush me off like that.\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Oh....?\n Wonder what you're up to.\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■パートナーが自ら脱衣する
#====================================================================================================================
when "Partner undresses themself."
  tx["tx1"] = "\"#{giggle_s} You couldn't wait?\""
  tx["tx1"] = "\"#{giggle_s} I've been waiting\\H\"" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)
#====================================================================================================================
#■夢魔が自ら脱衣する
#====================================================================================================================
when "Succubus undresses herself."
  #------------------------------------------------------------------------------------------------------------------
  tx["tx1"] = "\"Ufufu, I've kept you waiting\\H\""
  tx["tx1"] = "\"Let's have a more passionate love\\H\"" if $msg.t_target.nude? #アクターが先に脱いでいた
    #---------------------------------------------------
    #格納
    tx["md"] = "3"
    ms.push(tx)
  #----------------------------------------------------------------------------------------------------------------------
  end #case $msg.tag










#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
  case $msg.tag
  #====================================================================================================================
  #■夢魔がパートナーを脱衣させる
  #====================================================================================================================
when "Succubus strips the partner."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"What say we have some fun together?\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 2 #パートナーが抵抗した
    tx["tx1"] = "\"How cold....\""
  #  tx["tx1"] = "" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  when 3 #パートナーが脱衣した
    tx["tx1"] = "\"Such a pretty and wonderful body....\\H\n You'd be a fool to not enjoy\n such golden opportunity with all your heart\\H\""
    #▼自ら受け入れた場合
    tx["tx1"] = "\"#{giggle_s}\\H\n Good to see that even the partner\n here's in the mood....\\H\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■パートナーが夢魔を脱衣させる
#====================================================================================================================
when "Partner strips the succubus."
  case $msg.talk_step
  when 1 #脱衣開始
    tx["tx1"] = "\"#{giggle_s} You're going to take it off for me?\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 2 #夢魔を脱衣させた
    tx["tx1"] = "\"#{giggle_s} Thanks.\n Then let's carry on\\H\""
  #  tx["tx1"] = "" if $msg.t_target.nude? #アクターが先に脱いでいた
  #---------------------------------------------------
  when 3 #夢魔に抵抗された
    tx["tx1"] = "\"Don't you brush me off like that.\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Oh....?\n Wonder what you're up to.\"" if $game_switches[89] == true
  #---------------------------------------------------
  end
  #格納
  ms.push(tx)
#====================================================================================================================
#■パートナーが自ら脱衣する
#====================================================================================================================
when "Partner undresses themself."
  tx["tx1"] = "\"#{giggle_s} You couldn't wait?\""
  tx["tx1"] = "\"#{giggle_s} I've been waiting\\H\"" if $msg.t_enemy.nude? #夢魔が先に脱いでいた
  #---------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)
#====================================================================================================================
#■夢魔が自ら脱衣する
#====================================================================================================================
when "Succubus undresses herself."
  #------------------------------------------------------------------------------------------------------------------
  tx["tx1"] = "\"Ufufu, I've kept you waiting\\H\""
  tx["tx1"] = "\"Let's have a more passionate love\\H\"" if $msg.t_target.nude? #アクターが先に脱いでいた
    #---------------------------------------------------
    #格納
    tx["md"] = "3"
    ms.push(tx)
  #----------------------------------------------------------------------------------------------------------------------
  end #case $msg.tag
end
#######################################################################################################################
  end #def
end #class
