=begin
#######################################################################################################################
 ●『インプ（緑）』戦闘開始、終了口上
 ●性格：勝ち気
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end

class MsgImp_A < MsgBase
 def msg_op_and_ep_05
#=======================================================================================================================
# ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
#----------------------------------------------------------------------------------------------------------------------
if $msg.tag == "戦闘開始"
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            if $game_switches[85] == true
                              tx["md"] = "12" if $msg.talk_step == 1
                              tx["md"] = "12" if $msg.talk_step == 2
                              tx["md"] = "12" if $msg.talk_step == 3
                              tx["md"] = "14" if $msg.talk_step == 1 and $msg.t_enemy.bedin_count == 0
                              tx["md"] = "14" if $msg.talk_step == 2 and $msg.t_enemy.bedin_count == 0
                              tx["md"] = "14" if $msg.talk_step == 3 and $msg.t_enemy.bedin_count == 0
                            elsif $game_switches[86] == true
                              tx["md"] = "0"
                            else
                              tx["md"] = "13" if $msg.talk_step == 1
                              tx["md"] = "12" if $msg.talk_step == 2
                              tx["md"] = "11" if $msg.talk_step == 3
                            end
  #----------------------------------------------------------------------------------------------------------------------
  #●ベッドイン中
  if $game_switches[85] == true
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「あははっ♪\n　今日もいっぱい遊ぼうね～♪」"
      #▼初ベッドイン
      tx["tx1"] = "「うわぁい、ベッドがふかふかだぁ♪\n　ね、今からここでえっちなことするんだよね\\H」" if $msg.t_enemy.bedin_count == 0
    when 1 #２番目
      tx["tx1"] = "「#{giggle}\n　#{target}は#{myname}と遊びたいんだよね？\n　負けないぞ～？\\H」"
      #▼初ベッドイン
      tx["tx1"] = "「ここが#{target}のお部屋なんだね\\H\n　うわ～、すごいすご～い\\H」" if $msg.t_enemy.bedin_count == 0
    when 2 #３番目
      tx["tx1"] = "「#{giggle}\n　#{myname}もいっしょに遊びた～い\\H\n　い～れ～てっ♪」"
      #▼初ベッドイン
      tx["tx1"] = "「#{giggle}\n　こんなところに連れてきて～\\H\n　#{myname}に何するつもり～？\\H」" if $msg.t_enemy.bedin_count == 0
    end
  #●空腹戦闘中
  elsif $game_switches[86] == true
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「ねぇ#{target}……\\H\n　#{myname}、もうおなかぺこぺこだよう……\\H」"
    when 1 #２番目
      tx["tx1"] = "「#{target}、おやつちょうだ～い♪\n　もちろん、熱くて白いアレ♪」"
    when 2 #３番目
      tx["tx1"] = "「#{giggle}\n　#{myname}も混ぜて～\\H\n　#{target}、いいよねぇ～？♪」"
    end
  #●レア戦闘中(OFEの場合は[$game_switches[92] == true]、BOSSの場合は[$game_switches[91] == true]をそれぞれelsifでつけること)
  else
    case $msg.talk_step
    when 0 #１番目
      tx["tx1"] = "「こんにちはっ！\n　#{target}も一緒に遊ぶ～？」"
    when 1 #２番目
      tx["tx1"] = "「ね、ね、どこから来たの？\n　あたし#{myname}、よろしくね！」"
    when 2 #３番目
      tx["tx1"] = "「#{giggle}\n　#{target}、背がたか～い♪\n　え～い、抱きついちゃえ\\H」"
    end
  end
  #格納
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
#■逃走失敗口上
elsif $msg.tag == "逃走失敗"
  tx["tx1"] = "「あははっ、鬼ごっこだぁ♪\n　ほ～らつかまえた～\\H」"
  #----------------------------------------------------------------------------------------------------------------------
  #格納
  tx["md"] = "3"
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
#■契約口上
elsif $msg.tag == "契約"
  #----------------------#
  #▼ステップで状況判断  #
  #----------------------#
  case $msg.talk_step
  #▼契約開始
  when 1 
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「ねぇ#{target}、もう帰っちゃうの？\n　#{myname}ともっと遊んでよぉ」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「……あ、そうだ！\n　ね、ね、#{myname}も一緒に行ってもいい？」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx3"] = "「#{myname}ね、\n　もっと#{target}と遊びたいんだ♪\n　ね、いいでしょ？」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約締結(即座に仲間に入る)
  when 2
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「うわ～い、やったぁ！\n　#{target}大好きぃ♪」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「#{target}、#{myname}といっぱい遊んでねっ♪\n　約束だよっ\\H」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約締結(ホームに送る)
  when 3
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「うわ～い、やったぁ！\n　#{target}大好きぃ♪」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「……ありゃ、でもお友達いっぱいだね。\n　じゃ、#{target}のおうちで遊んでるね♪\n　どんなおうちかな～、わくわく\\H」"
    #----------------------------------------------------------------------------------------------------------------------
  #▼契約を行わない
  when 4
    #----------------------------------------------------------------------------------------------------------------------
    tx["tx1"] = "「え～、つまんな～い……！\n　ふんだ、いいもん……。\n　だったら違う子と遊ぶもん……！」"
    # . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .
    tx["tx2"] = "「……でも、でもね。\n　また今度遊んでね。\n　ね、絶対だよ？」"
    #----------------------------------------------------------------------------------------------------------------------
  end
  #格納
  ms.push(tx)





#----------------------------------------------------------------------------------------------------------------------
end
#######################################################################################################################
 end #def
end #class
