=begin
#######################################################################################################################
 ●『インプ（緑）』レジスト実行口上（ホールド関連・対パートナー）
 ●性格：勝ち気
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end





#######################################################################################################################
########################################★ホールド：パートナーがメインの口上群#############################################
#######################################################################################################################
class MsgImp_A < MsgBase
 def msg_female_hold_05
#==================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "パートナーが夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「ここまでお～いで\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「や～ん、捕まっちゃったぁ♪」"
  when 3 #ホールド失敗
    tx["tx1"] = "「残念でした～っ♪」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「残念でした～っ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あははっ♪\n　つかまらないよ～っ\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「あぁんっ♪\n　つかまっちゃったぁ\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「残念でした～っ♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「残念でした～っ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あはっ、おまたが丸見え～♪」"
    when 2 #ホールド成功
      tx["tx1"] = "「んむっ？！\n　んぐっ、んむーっ……！\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「わっ、びっくりしたぁ！\n　も～、#{myname}の頭はイスじゃないよ？」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「えへへっ♪\n　後で#{myname}のも見せたげるね\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「わ～、すっご～い♪\n　それ、入れちゃうの？入るかなぁ……？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「んあぁっ……！\\H\n　ふ、太すぎるよぉ……っ！\\H」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「や、やっぱりそれダメっ！\n　絶対入んないからっ！」"
      #自ら受け入れた場合
      tx["tx1"] = "「だよね～？\n　#{myname}にはたぶん入んないよ、それ」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あれ～、やめちゃうの？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、どうして～？」"
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「え、なになになに？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、しかたないなあ。\n　それじゃ、今度は#{target}が遊んでね？」"
      tx["md"] = "10"
    when 3 #ホールド失敗
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "夢魔がパートナーをホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～、逃げられちゃった……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{myname}、知ってるよっ♪\n　こうやったら気持ちよくなるんだよね？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、逃げちゃダメ～！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あぁんっ\\H\n　えへへ、いっぱい気持ちよくなろっ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「あぁんっ\\H\n　えへへ、#{target}もこれ、好き？♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{target}、いくよっ♪\n　それ～っ！」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あいたたた、お尻打っちゃった……。\n　も～、よけちゃダメだよぉ……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇねぇ、#{target}。\n　#{myname}と、いっぱいちゅーして\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "クンニ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}がおくちでぺろぺろしてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「はむっ……んふ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、コレ入れてみていい？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」"
      tx["tx1"] = "「あ、大丈夫？\n　苦しくない？」" if $msg.tag == "ディルド口挿入"
      tx["tx1"] = "「わ～、すご～い♪\n　お尻にも入っちゃうんだぁ\\H」" if $msg.tag == "ディルド尻挿入"
      #自ら受け入れた場合
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」" if $game_switches[89] == true
      tx["tx1"] = "「あ、大丈夫？\n　苦しくない？」" if $msg.tag == "ディルド口挿入" and $game_switches[89] == true
      tx["tx1"] = "「わ～、すご～い♪\n　お尻にも入っちゃうんだぁ\\H」" if $msg.tag == "ディルド尻挿入" and $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class




















#######################################################################################################################
####################################★ホールド：パートナーがメインの口上群（ベッドイン）###################################
#######################################################################################################################
class MsgImp_A < MsgBase
 def msg_female_bedin_hold_05
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("大切な人")
#====================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "パートナーが夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「ここまでお～いで\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「や～ん、捕まっちゃったぁ♪」"
  when 3 #ホールド失敗
    tx["tx1"] = "「残念でした～っ♪」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「残念でした～っ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あははっ♪\n　#{myname}と気持ちいいことしたいの？\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「あぁんっ♪\n　つかまっちゃったぁ\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「えへへっ、ダ～メっ\\H\n　だって#{target}と遊びたいんだもん♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「えへへっ、ダ～メっ\\H\n　だって#{target}と遊びたいんだもん♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あはっ、おまたが丸見え～♪」"
    when 2 #ホールド成功
      tx["tx1"] = "「んむっ？！\n　んぐっ、んむーっ……！\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「わっ、びっくりしたぁ！\n　も～、#{myname}の頭はイスじゃないよ？」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「えへへっ♪\n　後で#{myname}のも見せたげるね\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「わ～、すっご～い♪\n　それ、入れちゃうの？入るかなぁ……？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「んあぁっ……！\\H\n　ふ、太すぎるよぉ……っ！\\H」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「や、やっぱりそれダメっ！\n　絶対入んないからっ！」"
      #自ら受け入れた場合
      tx["tx1"] = "「だよね～？\n　#{myname}にはたぶん入んないよ、それ」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あれ～、やめちゃうの？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、どうして～？」"
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「え、なになになに？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、しかたないなあ。\n　それじゃ、今度は#{target}が遊んでね？」"
      tx["md"] = "10"
    when 3 #ホールド失敗
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "夢魔がパートナーをホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～、逃げられちゃった……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「んしょ……っと♪\n　一緒に気持ちよくなろっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、逃げちゃダメ～！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あぁんっ\\H\n　えへへ、#{target}もこれ、好き？♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「あぁんっ\\H\n　えへへ、#{target}もこれ、好き？♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{target}、いくよっ♪\n　それ～っ！」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あいたたた、お尻打っちゃった……。\n　も～、よけちゃダメだよぉ……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇねぇ、#{target}。\n　#{myname}と、いっぱいちゅーして\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "クンニ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}がおくちでぺろぺろしてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「はむっ……んふ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、コレ入れてみていい？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」"
      tx["tx1"] = "「あ、大丈夫？\n　苦しくない？」" if $msg.tag == "ディルド口挿入"
      tx["tx1"] = "「わ～、すご～い♪\n　お尻にも入っちゃうんだぁ\\H」" if $msg.tag == "ディルド尻挿入"
      #自ら受け入れた場合
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」" if $game_switches[89] == true
      tx["tx1"] = "「あ、大丈夫？\n　苦しくない？」" if $msg.tag == "ディルド口挿入" and $game_switches[89] == true
      tx["tx1"] = "「わ～、すご～い♪\n　お尻にも入っちゃうんだぁ\\H」" if $msg.tag == "ディルド尻挿入" and $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("寵愛")
#====================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "パートナーが夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「ここまでお～いで\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「や～ん、捕まっちゃったぁ♪」"
  when 3 #ホールド失敗
    tx["tx1"] = "「残念でした～っ♪」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「残念でした～っ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あははっ♪\n　#{myname}と気持ちいいことしたいの？\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「あぁんっ♪\n　つかまっちゃったぁ\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「えへへっ、ダ～メっ\\H\n　だって#{target}と遊びたいんだもん♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「えへへっ、ダ～メっ\\H\n　だって#{target}と遊びたいんだもん♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あはっ、おまたが丸見え～♪」"
    when 2 #ホールド成功
      tx["tx1"] = "「んむっ？！\n　んぐっ、んむーっ……！\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「わっ、びっくりしたぁ！\n　も～、#{myname}の頭はイスじゃないよ？」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「えへへっ♪\n　後で#{myname}のも見せたげるね\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「わ～、すっご～い♪\n　それ、入れちゃうの？入るかなぁ……？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「んあぁっ……！\\H\n　ふ、太すぎるよぉ……っ！\\H」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「や、やっぱりそれダメっ！\n　絶対入んないからっ！」"
      #自ら受け入れた場合
      tx["tx1"] = "「だよね～？\n　#{myname}にはたぶん入んないよ、それ」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あれ～、やめちゃうの？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、どうして～？」"
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「え、なになになに？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、しかたないなあ。\n　それじゃ、今度は#{target}が遊んでね？」"
      tx["md"] = "10"
    when 3 #ホールド失敗
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "夢魔がパートナーをホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～、逃げられちゃった……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「んしょ……っと♪\n　一緒に気持ちよくなろっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、逃げちゃダメ～！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あぁんっ\\H\n　えへへ、#{target}もこれ、好き？♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「あぁんっ\\H\n　えへへ、#{target}もこれ、好き？♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{target}、いくよっ♪\n　それ～っ！」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あいたたた、お尻打っちゃった……。\n　も～、よけちゃダメだよぉ……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇねぇ、#{target}。\n　#{myname}と、いっぱいちゅーして\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "クンニ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}がおくちでぺろぺろしてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「はむっ……んふ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、コレ入れてみていい？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」"
      tx["tx1"] = "「あ、大丈夫？\n　苦しくない？」" if $msg.tag == "ディルド口挿入"
      tx["tx1"] = "「わ～、すご～い♪\n　お尻にも入っちゃうんだぁ\\H」" if $msg.tag == "ディルド尻挿入"
      #自ら受け入れた場合
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」" if $game_switches[89] == true
      tx["tx1"] = "「あ、大丈夫？\n　苦しくない？」" if $msg.tag == "ディルド口挿入" and $game_switches[89] == true
      tx["tx1"] = "「わ～、すご～い♪\n　お尻にも入っちゃうんだぁ\\H」" if $msg.tag == "ディルド尻挿入" and $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "パートナーが夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「ここまでお～いで\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「や～ん、捕まっちゃったぁ♪」"
  when 3 #ホールド失敗
    tx["tx1"] = "「残念でした～っ♪」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「残念でした～っ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あははっ♪\n　#{myname}と気持ちいいことしたいの？\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「あぁんっ♪\n　つかまっちゃったぁ\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「えへへっ、ダ～メっ\\H\n　だって#{target}と遊びたいんだもん♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「えへへっ、ダ～メっ\\H\n　だって#{target}と遊びたいんだもん♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あはっ、おまたが丸見え～♪」"
    when 2 #ホールド成功
      tx["tx1"] = "「んむっ？！\n　んぐっ、んむーっ……！\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「わっ、びっくりしたぁ！\n　も～、#{myname}の頭はイスじゃないよ？」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「えへへっ♪\n　後で#{myname}のも見せたげるね\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「わ～、すっご～い♪\n　それ、入れちゃうの？入るかなぁ……？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「んあぁっ……！\\H\n　ふ、太すぎるよぉ……っ！\\H」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「や、やっぱりそれダメっ！\n　絶対入んないからっ！」"
      #自ら受け入れた場合
      tx["tx1"] = "「だよね～？\n　#{myname}にはたぶん入んないよ、それ」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あれ～、やめちゃうの？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、どうして～？」"
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「え、なになになに？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、しかたないなあ。\n　それじゃ、今度は#{target}が遊んでね？」"
      tx["md"] = "10"
    when 3 #ホールド失敗
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "夢魔がパートナーをホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～、逃げられちゃった……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「んしょ……っと♪\n　一緒に気持ちよくなろっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、逃げちゃダメ～！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あぁんっ\\H\n　えへへ、#{target}もこれ、好き？♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「あぁんっ\\H\n　えへへ、#{target}もこれ、好き？♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{target}、いくよっ♪\n　それ～っ！」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あいたたた、お尻打っちゃった……。\n　も～、よけちゃダメだよぉ……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇねぇ、#{target}。\n　#{myname}と、いっぱいちゅーして\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "クンニ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}がおくちでぺろぺろしてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「はむっ……んふ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、コレ入れてみていい？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」"
      tx["tx1"] = "「あ、大丈夫？\n　苦しくない？」" if $msg.tag == "ディルド口挿入"
      tx["tx1"] = "「わ～、すご～い♪\n　お尻にも入っちゃうんだぁ\\H」" if $msg.tag == "ディルド尻挿入"
      #自ら受け入れた場合
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」" if $game_switches[89] == true
      tx["tx1"] = "「あ、大丈夫？\n　苦しくない？」" if $msg.tag == "ディルド口挿入" and $game_switches[89] == true
      tx["tx1"] = "「わ～、すご～い♪\n　お尻にも入っちゃうんだぁ\\H」" if $msg.tag == "ディルド尻挿入" and $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
end #ability
 end #def
end #class
