=begin
#######################################################################################################################
 ●『インプ（緑）』レジスト実行口上（ホールド関連・対主人公）
 ●性格：勝ち気
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end





#######################################################################################################################
########################################★ホールド：主人公がメインの口上群#############################################
#######################################################################################################################
class MsgImp_A < MsgBase
 def msg_hold_05
#==================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "Player binds the succubus."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"You need to come over here\\H\""
  when 2 #ホールド成功
    tx["tx1"] = "\"Aieee, you got me♪\""
  when 3 #ホールド失敗
    tx["tx1"] = "\"Too bad♪\""
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"Too bad♪\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "Insertion done by ♂"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Huuuh??\n Dunno if something that big can go in....\""
      tx["tx1"] = "\"#{giggle}\n Wanna put it in me? \\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "\"Eyyargh....\\H\n My pussy's all full....\\H\""
      tx["tx1"] = "\"Eyyargh....\\H\n Ehe, it went all the way through....\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールド失敗
      tx["tx1"] = "\"I'm telling you, it hurts!\n Geez, you gotta be gentle with it!\""
      tx["tx1"] = "\"Ehehe, nuh-uh\\H\n I'll think 'bout it after you play with me some more♪\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["md"] = "11" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #途中で行動をキャンセルした場合
#   #  tx["tx1"] = "" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the user."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Huh?? You're gonna stop?\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Oh come on, why??\""
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "\"#{giggle}\n Not until #{myname} say so♪\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"#{giggle}\n Not until #{myname} say so♪\"" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the ally."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Eh, what is it, what is it?\""
    when 2 #ホールド成功
      tx["tx1"] = "\"Geez, can't help it then.\n Then this time, you'll play with me, right?\""
      tx["md"] = "10"
    when 3 #ホールド失敗
      tx["tx1"] = "\"Save that for later♪ I'm playing right now.\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"Save that for later♪ I'm playing right now.\"" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "Succubus binds the player."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
  when 2 #ホールドレジスト成功
    tx["tx1"] = "\"Hmph, you got away....\""
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"Gotcha♪\""
    #自ら受け入れた場合
    tx["tx1"] = "\"Gotcha♪\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Oomph....hup.\n Wonder if it'll go inside my pussy.\""
      tx["tx1"] = "\"Oomph....hup♪\n #{myname} wanna put it in my pussy\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "\"#{giggle}\n Put it in, #{target}....\\H\"" if $game_switches[86] == true #空腹戦
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Huh, that's weird.\n It's not going in....\""
      tx["tx1"] = "\"Huh, that's weird.\n It's not really going in....\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "\"Come on, don't run away!\"" if $game_switches[86] == true #空腹戦
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Eyyargh....!\\H\n I-I think it stings a little....\""
      tx["tx1"] = "\"Eyyargh....!\\H\n My pussy's spreading out....\\H\"" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "\"#{pleasure_s}\n Something big went all the way in....\\H\"" if $game_switches[86] == true #空腹戦
      #自ら受け入れた場合
#   #  tx["tx1"] = "" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted","Dark-sided"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Here I go, #{target}♪\n Take this!\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Owowow, I bumped my butt....\n Gee, you shouldn't avoid it....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Aha, the horsie goes clippety-clop♪\n Kyah, no squirming, #{target}\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Aha, the horsie goes clippety-clop♪\n Kyah, no squirming, #{target}\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "Backside Bind"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Hmph, you got away....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Gotcha♪\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Gotcha♪\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "Jiggly-Wiggly"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hold on♪\n I'm gonna get you\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Hmph, you got away....\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Gotcha♪\n Ehehe, so even #{myname} can do it\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Gotcha♪\n Ehehe, so even #{myname} can do it\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "Kiss"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Hey hey, #{target}.\n Let's have lots of smoochies\\H\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{kiss_l}\n #{giggle}\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{kiss_l}\n #{giggle}\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "♀ giving fellatio"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"Wonder if it'll go inside my pussy....\""
      tx["tx1"] = "\"#{giggle}\n I'm gonna lick it, #{target}\\H\"" if $game_switches[86] == true #空腹戦
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Nom....mfu....\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Nom....mfu....\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n Hey, can I try putting this in?\""
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"Maaan, why're you running?\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Whoa, awesome♪\n It went all the way in\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Whoa, awesome♪\n It went all the way in\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class




















#######################################################################################################################
####################################★ホールド：主人公がメインの口上群（ベッドイン）###################################
#######################################################################################################################
class MsgImp_A < MsgBase
 def msg_bedin_hold_05
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("Significant Other")
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「ここまでお～いで\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「や～ん、捕まっちゃったぁ♪」"
  when 3 #ホールド失敗
    tx["tx1"] = "「残念でした～っ♪」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「残念でした～っ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　もう#{myname}のココに入れたいの～？\\H」"
      tx["tx1"] = "「#{giggle}\n　#{myname}のココに入れたいの～？\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "「あうぅっ……！\\H\n　アソコがいっぱいだよぉ……っ\\H」"
      tx["tx1"] = "「あうぅっ……\\H\n　えへ、全部入っちゃったぁ……\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールド失敗
      tx["tx1"] = "「えへへっ、ダ～メっ\\H\n　もっと遊んでくれたら考えたげる♪」"
      tx["tx1"] = "「えへへっ、ダ～メっ\\H\n　もっと遊んでくれたら考えたげる♪」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #途中で行動をキャンセルした場合
#   #  tx["tx1"] = "" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あれ～、やめちゃうの？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、しかたないなあ♪\n　じゃ、次は何して遊ぶの？」"
      tx["md"] = "11"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「え、なになになに？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、しかたないなあ。\n　それじゃ、今度は#{target}が遊んでね？」"
      tx["md"] = "11"
    when 3 #ホールド失敗
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～、逃げられちゃった……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「んしょ……っと。\n　#{myname}のココに入れたげるね\\H」"
      tx["tx1"] = "「んしょ……っと♪\n　#{myname}のココはじゅんびおっけ～だよ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あれ、おかしいなぁ？\n　入んないや……」"
      tx["tx1"] = "「あれ、おかしいなぁ？\n　うまく入んないや……」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あうぅ……っ！\\H\n　#{myname}のアソコが広がっちゃう……\\H」"
      tx["tx1"] = "「あうぅ……っ\\H\n　ぬるんって入っちゃったぁ……\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #自ら受け入れた場合
#      tx["tx1"] = "「」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{target}、いくよっ♪\n　それ～っ！」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あいたたた、お尻打っちゃった……。\n　も～、よけちゃダメだよぉ……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇねぇ、#{target}。\n　#{myname}と、いっぱいちゅーして\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、#{target}のいじわる～」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}がおくちでぺろぺろしてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、噛んだりしないよ～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「はもっ……んぐ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、コレ入れてみていい？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("Affection")
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「ここまでお～いで\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「や～ん、捕まっちゃったぁ♪」"
  when 3 #ホールド失敗
    tx["tx1"] = "「残念でした～っ♪」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「残念でした～っ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　もう#{myname}のココに入れたいの～？\\H」"
      tx["tx1"] = "「#{giggle}\n　#{myname}のココに入れたいの～？\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "「あうぅっ……！\\H\n　アソコがいっぱいだよぉ……っ\\H」"
      tx["tx1"] = "「あうぅっ……\\H\n　えへ、全部入っちゃったぁ……\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールド失敗
      tx["tx1"] = "「えへへっ、ダ～メっ\\H\n　もっと遊んでくれたら考えたげる♪」"
      tx["tx1"] = "「えへへっ、ダ～メっ\\H\n　もっと遊んでくれたら考えたげる♪」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #途中で行動をキャンセルした場合
#   #  tx["tx1"] = "" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あれ～、やめちゃうの？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、しかたないなあ♪\n　じゃ、次は何して遊ぶの？」"
      tx["md"] = "11"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「え、なになになに？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、しかたないなあ。\n　それじゃ、今度は#{target}が遊んでね？」"
      tx["md"] = "11"
    when 3 #ホールド失敗
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～、逃げられちゃった……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「んしょ……っと。\n　#{myname}のココに入れたげるね\\H」"
      tx["tx1"] = "「んしょ……っと♪\n　#{myname}のココはじゅんびおっけ～だよ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あれ、おかしいなぁ？\n　入んないや……」"
      tx["tx1"] = "「あれ、おかしいなぁ？\n　うまく入んないや……」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あうぅ……っ！\\H\n　#{myname}のアソコが広がっちゃう……\\H」"
      tx["tx1"] = "「あうぅ……っ\\H\n　ぬるんって入っちゃったぁ……\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #自ら受け入れた場合
#      tx["tx1"] = "「」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{target}、いくよっ♪\n　それ～っ！」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あいたたた、お尻打っちゃった……。\n　も～、よけちゃダメだよぉ……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇねぇ、#{target}。\n　#{myname}と、いっぱいちゅーして\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、#{target}のいじわる～」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}がおくちでぺろぺろしてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、噛んだりしないよ～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「はもっ……んぐ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、コレ入れてみていい？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「ここまでお～いで\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「や～ん、捕まっちゃったぁ♪」"
  when 3 #ホールド失敗
    tx["tx1"] = "「残念でした～っ♪」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「残念でした～っ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　もう#{myname}のココに入れたいの～？\\H」"
      tx["tx1"] = "「#{giggle}\n　#{myname}のココに入れたいの～？\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "「あうぅっ……！\\H\n　アソコがいっぱいだよぉ……っ\\H」"
      tx["tx1"] = "「あうぅっ……\\H\n　えへ、全部入っちゃったぁ……\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールド失敗
      tx["tx1"] = "「えへへっ、ダ～メっ\\H\n　もっと遊んでくれたら考えたげる♪」"
      tx["tx1"] = "「えへへっ、ダ～メっ\\H\n　もっと遊んでくれたら考えたげる♪」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #途中で行動をキャンセルした場合
#   #  tx["tx1"] = "" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あれ～、やめちゃうの？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、しかたないなあ♪\n　じゃ、次は何して遊ぶの？」"
      tx["md"] = "11"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　#{myname}がいいって言うまでだ～め♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「え、なになになに？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、しかたないなあ。\n　それじゃ、今度は#{target}が遊んでね？」"
      tx["md"] = "11"
    when 3 #ホールド失敗
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「今遊んでるとこだから、また後でね～♪」" if $game_switches[89] == true
      tx["md"] = "11"
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～、逃げられちゃった……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「んしょ……っと。\n　#{myname}のココに入れたげるね\\H」"
      tx["tx1"] = "「んしょ……っと♪\n　#{myname}のココはじゅんびおっけ～だよ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あれ、おかしいなぁ？\n　入んないや……」"
      tx["tx1"] = "「あれ、おかしいなぁ？\n　うまく入んないや……」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あうぅ……っ！\\H\n　#{myname}のアソコが広がっちゃう……\\H」"
      tx["tx1"] = "「あうぅ……っ\\H\n　ぬるんって入っちゃったぁ……\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #自ら受け入れた場合
#      tx["tx1"] = "「」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{target}、いくよっ♪\n　それ～っ！」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あいたたた、お尻打っちゃった……。\n　も～、よけちゃダメだよぉ……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あはっ、お馬さんパカパカ～っ♪\n　きゃっ、#{target}、もごもごしちゃダメっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「まてまて～っ♪\n　つかまえちゃうぞ～っ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「む～、逃げられちゃった……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　えへへ、#{myname}だってできるもんねっ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇねぇ、#{target}。\n　#{myname}と、いっぱいちゅーして\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、#{target}のいじわる～」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}がおくちでぺろぺろしてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、噛んだりしないよ～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「はもっ……んぐ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、コレ入れてみていい？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あ～ん、なんで逃げるの～？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「わ～、すご～い♪\n　奥まで入っちゃったぁ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
end #ability
 end #def
end #class
