=begin
#######################################################################################################################
 ●『デビル（緑）』レジスト実行口上（ホールド関連・対パートナー）
 ●性格：勝ち気
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end





#######################################################################################################################
########################################★ホールド：パートナーがメインの口上群#############################################
#######################################################################################################################
class MsgDevil_A < MsgBase
 def msg_female_hold_05
#==================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "Partner binds the succubus."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "\"#{giggle}\n You're gonna keep me company?」"
  when 2 #ホールド成功
    tx["tx1"] = "「Now then....\n Who's gonna throw in the sponge first?」"
  when 3 #ホールド失敗
    tx["tx1"] = "「....It's too early for you to think so.\n Let's take our time, shall we?」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "\"What, you're stopping?」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "Tribadism"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n Okay then, come....\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n Hehe, you gonna let me have a good time? \\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「You don't have to rush it.\n Not like I'm going anywhere.」"
      tx["md"] = "10"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「Oi....\n You don't just make me excited and do that.」" if $game_switches[89] == true
      tx["md"] = "2" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「Hehe....that's a great view right there.\\H\n Now what're you gonna do to me?」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n Hehe, I'll go along with you for a bit\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "\"Just wait a little.\n I'm do it later even if you don't worry.\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"What, you're stopping?\n I wanted to see it for a while longer though.」" if $game_switches[89] == true
      tx["md"] = "10"
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "Dildo'ed","Mouth Dildo'ed","Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「Whoa....is that....?」"
      tx["tx1"] = "「#{giggle}\n What're you gonna do to me with that? \\H」" if $msg.t_target.age <= 2
    when 2 #ホールドレジスト成功
      tx["tx1"] = "\"#{pleasure_s}\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Just wait a little.\n I'm do it later even if you don't worry.\""
      tx["tx1"] = "「You're going a bit overboard with your toys.\n It's still too early for you.」" if $msg.t_target.age <= 2
      #自ら受け入れた場合
      tx["tx1"] = "\"What, you're stopping?\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the user."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「Whoa, what's wrong?」"
    when 2 #ホールド成功
      tx["tx1"] = "「What, you're giving up already?\n That's how it is, huh....」"
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「Hehe, what were you trying to do just now?\n I won't get mad, so just tell me, will you? \\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「Hehe, did you think I'd let you go so easily?\n Just keep still like this and cum\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "Undo Hold on the ally."
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「Whoa there, what?」"
    when 2 #ホールド成功
      tx["tx1"] = "「What, you want me to focus on you?\n No helping it then....」"
    when 3 #ホールド失敗
      tx["tx1"] = "\"You just stay there and watch.\n Doing that's also fairly stimulating, isn't it? \\H\""
      #途中で行動をキャンセルした場合
      tx["tx1"] = "\"You just stay there and watch.\n Doing that's also fairly stimulating, isn't it? \\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "Succubus binds the partner."
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n Do you mind keeping me company?」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "\"No?\n Good grief, you're too scared to, I see.\""
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "\"#{giggle}\n I ain't letting you get away so easily.\""
    #自ら受け入れた場合
    tx["tx1"] = "\"#{giggle}\n I ain't letting you get away so easily.\"" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "Tribadism"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n Can you relax?\n I'll leave you squealing....\\H」"
    when 2 #ホールドレジスト成功
    tx["tx1"] = "\"No?\n Good grief, you're too scared to, I see.\""
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"#{pleasure_s}\n Now it won't take much to make you cum....\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"#{pleasure_s}\n Now it won't take much to make you cum....\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "Facesitted","Dark-sided"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "\"#{giggle}\n How you like the view....? \\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「Whoa, that's not what you prefer?」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "\"Hehe, it's fine to lick it.\n Make me moan as well\\H\""
      #自ら受け入れた場合
      tx["tx1"] = "\"Hehe, it's fine to lick it.\n Make me moan as well\\H\"" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "Backside Bind"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}の相手をしてもらおうか？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　簡単には逃がしてやらないぜ？」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　簡単には逃がしてやらないぜ？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "Jiggly-Wiggly"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}の胸で溺れさせてやるぜ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、こっちには興味ないってか？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふ、捕まえたぜ？\n　簡単には逃がさねえからな？」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふ、期待してたみたいだな？\n　んじゃ、リクエストにお応えしようか……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "Kiss"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　力、抜いてな？\n　とろけさせてやるぜ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "Cunnilingus"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　じっとしてな、気持ちよくしてやるから」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "Dildo'ed","Mouth Dildo'ed","Ass Dildo'ed"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　力、抜いてな……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」"
      tx["tx1"] = "「ふふ、しっかり咥えてなよ？」" if $msg.tag == "ディルド口挿入"
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」" if $msg.tag == "ディルド尻挿入"
      #自ら受け入れた場合
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」" if $game_switches[89] == true
      tx["tx1"] = "「ふふ、しっかり咥えてなよ？」" if $msg.tag == "ディルド口挿入" and $game_switches[89] == true
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」" if $msg.tag == "ディルド尻挿入" and $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class




















#######################################################################################################################
####################################★ホールド：パートナーがメインの口上群（ベッドイン）###################################
#######################################################################################################################
class MsgDevil_A < MsgBase
 def msg_female_bedin_hold_05
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("大切な人")
#====================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "パートナーが夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　#{myname}の相手をしてくれるのかい？」"
  when 2 #ホールド成功
    tx["tx1"] = "「さぁて……。\n　先に音を上げるのはどっちかな？」"
  when 3 #ホールド失敗
    tx["tx1"] = "「……っと思ったがまだ駄目だな。\n　ま、ゆっくりやろうぜ」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「何だよ、止めちまうのかい？」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　いいぜ、来なよ……\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、楽しませてくれるかい？\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「焦らなくてもいいぜ、\n　別に逃げやしないからさ」"
      tx["md"] = "10"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「おいおい……。\n　期待させといてそりゃないだろ？」" if $game_switches[89] == true
      tx["md"] = "2" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ふふっ……いい眺めじゃないか\\H\n　さて、どうしてくれるのかな？」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、少し付き合ってやるよ\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「少し待ってもらおうかな。\n　心配しなくても、もう少し後でシてやるよ」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「なんだよ、止めちまうのかい？\n　もう少し見てたかったんだがな」" if $game_switches[89] == true
      tx["md"] = "10"
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと……それは……？」"
      tx["tx1"] = "「#{giggle}\n　そいつで#{myname}をどうしようってんだい？\\H」" if $msg.t_target.age <= 2
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「#{pleasure_s}」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「少し待ってもらおうかな。\n　心配しなくても、もう少し後でさせてやるよ」"
      tx["tx1"] = "「ちっと過ぎたオモチャだな。\n　#{target}にはまだ早いぜ？」" if $msg.t_target.age <= 2
      #自ら受け入れた場合
      tx["tx1"] = "「何だよ、止めちまうのかい？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、どうした？」"
    when 2 #ホールド成功
      tx["tx1"] = "「何だよ、もう音を上げるのかい？\n　ま、こんなもんかねぇ……」"
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「ふふ、今何をしようとしたのかな？\n　怒らないから素直に言ってみな、ん？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「ふふ、大人しく逃がすと思ったかい？\n　このまま大人しくイかされな\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、何だぁ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「何だ、#{myname}に構って欲しいのかい？\n　仕方ねえなあ……」"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "夢魔がパートナーをホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　#{myname}の相手をしてもらおうか？」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　力、抜いてな？\n　今気持ちよくしてやるからさ……\\H」"
    when 2 #ホールドレジスト成功
    tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　さぁて、簡単にイくんじゃないぜ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　さぁて、簡単にイくんじゃないぜ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　眺めはどうだい……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おっと、こういうのは苦手かい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふっ、舐めてもいいぜ？\n　#{myname}も気持ちよくしてくれよ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふっ、舐めてもいいぜ？\n　#{myname}も気持ちよくしてくれよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}の相手をしてもらおうか？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　簡単には逃がしてやらないぜ？」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　簡単には逃がしてやらないぜ？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}の胸で溺れさせてやるぜ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、こっちには興味ないってか？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　力、抜いてな？\n　とろけさせてやるぜ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "クンニ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　じっとしてな、気持ちよくしてやるから」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　力、抜いてな……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」"
      tx["tx1"] = "「ふふ、しっかり咥えてなよ？」" if $msg.tag == "ディルド口挿入"
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」" if $msg.tag == "ディルド尻挿入"
      #自ら受け入れた場合
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」" if $game_switches[89] == true
      tx["tx1"] = "「ふふ、しっかり咥えてなよ？」" if $msg.tag == "ディルド口挿入" and $game_switches[89] == true
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」" if $msg.tag == "ディルド尻挿入" and $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("寵愛")
#====================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "パートナーが夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　#{myname}の相手をしてくれるのかい？」"
  when 2 #ホールド成功
    tx["tx1"] = "「さぁて……。\n　先に音を上げるのはどっちかな？」"
  when 3 #ホールド失敗
    tx["tx1"] = "「……っと思ったがまだ駄目だな。\n　ま、ゆっくりやろうぜ」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「何だよ、止めちまうのかい？」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　いいぜ、来なよ……\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、楽しませてくれるかい？\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「焦らなくてもいいぜ、\n　別に逃げやしないからさ」"
      tx["md"] = "10"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「おいおい……。\n　期待させといてそりゃないだろ？」" if $game_switches[89] == true
      tx["md"] = "2" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ふふっ……いい眺めじゃないか\\H\n　さて、どうしてくれるのかな？」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、少し付き合ってやるよ\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「少し待ってもらおうかな。\n　心配しなくても、もう少し後でシてやるよ」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「なんだよ、止めちまうのかい？\n　もう少し見てたかったんだがな」" if $game_switches[89] == true
      tx["md"] = "10"
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと……それは……？」"
      tx["tx1"] = "「#{giggle}\n　そいつで#{myname}をどうしようってんだい？\\H」" if $msg.t_target.age <= 2
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「#{pleasure_s}」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「少し待ってもらおうかな。\n　心配しなくても、もう少し後でさせてやるよ」"
      tx["tx1"] = "「ちっと過ぎたオモチャだな。\n　#{target}にはまだ早いぜ？」" if $msg.t_target.age <= 2
      #自ら受け入れた場合
      tx["tx1"] = "「何だよ、止めちまうのかい？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、どうした？」"
    when 2 #ホールド成功
      tx["tx1"] = "「何だよ、もう音を上げるのかい？\n　ま、こんなもんかねぇ……」"
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「ふふ、今何をしようとしたのかな？\n　怒らないから素直に言ってみな、ん？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「ふふ、大人しく逃がすと思ったかい？\n　このまま大人しくイかされな\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、何だぁ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「何だ、#{myname}に構って欲しいのかい？\n　仕方ねえなあ……」"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "夢魔がパートナーをホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　#{myname}の相手をしてもらおうか？」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　力、抜いてな？\n　今気持ちよくしてやるからさ……\\H」"
    when 2 #ホールドレジスト成功
    tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　さぁて、簡単にイくんじゃないぜ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　さぁて、簡単にイくんじゃないぜ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　眺めはどうだい……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おっと、こういうのは苦手かい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふっ、舐めてもいいぜ？\n　#{myname}も気持ちよくしてくれよ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふっ、舐めてもいいぜ？\n　#{myname}も気持ちよくしてくれよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}の相手をしてもらおうか？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　簡単には逃がしてやらないぜ？」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　簡単には逃がしてやらないぜ？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}の胸で溺れさせてやるぜ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、こっちには興味ないってか？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　力、抜いてな？\n　とろけさせてやるぜ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "クンニ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　じっとしてな、気持ちよくしてやるから」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　力、抜いてな……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」"
      tx["tx1"] = "「ふふ、しっかり咥えてなよ？」" if $msg.tag == "ディルド口挿入"
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」" if $msg.tag == "ディルド尻挿入"
      #自ら受け入れた場合
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」" if $game_switches[89] == true
      tx["tx1"] = "「ふふ、しっかり咥えてなよ？」" if $msg.tag == "ディルド口挿入" and $game_switches[89] == true
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」" if $msg.tag == "ディルド尻挿入" and $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "パートナーが夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　#{myname}の相手をしてくれるのかい？」"
  when 2 #ホールド成功
    tx["tx1"] = "「さぁて……。\n　先に音を上げるのはどっちかな？」"
  when 3 #ホールド失敗
    tx["tx1"] = "「……っと思ったがまだ駄目だな。\n　ま、ゆっくりやろうぜ」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「何だよ、止めちまうのかい？」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　いいぜ、来なよ……\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、楽しませてくれるかい？\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「焦らなくてもいいぜ、\n　別に逃げやしないからさ」"
      tx["md"] = "10"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「おいおい……。\n　期待させといてそりゃないだろ？」" if $game_switches[89] == true
      tx["md"] = "2" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ふふっ……いい眺めじゃないか\\H\n　さて、どうしてくれるのかな？」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、少し付き合ってやるよ\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「少し待ってもらおうかな。\n　心配しなくても、もう少し後でシてやるよ」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「なんだよ、止めちまうのかい？\n　もう少し見てたかったんだがな」" if $game_switches[89] == true
      tx["md"] = "10"
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと……それは……？」"
      tx["tx1"] = "「#{giggle}\n　そいつで#{myname}をどうしようってんだい？\\H」" if $msg.t_target.age <= 2
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「#{pleasure_s}」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「少し待ってもらおうかな。\n　心配しなくても、もう少し後でさせてやるよ」"
      tx["tx1"] = "「ちっと過ぎたオモチャだな。\n　#{target}にはまだ早いぜ？」" if $msg.t_target.age <= 2
      #自ら受け入れた場合
      tx["tx1"] = "「何だよ、止めちまうのかい？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、どうした？」"
    when 2 #ホールド成功
      tx["tx1"] = "「何だよ、もう音を上げるのかい？\n　ま、こんなもんかねぇ……」"
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「ふふ、今何をしようとしたのかな？\n　怒らないから素直に言ってみな、ん？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「ふふ、大人しく逃がすと思ったかい？\n　このまま大人しくイかされな\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、何だぁ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「何だ、#{myname}に構って欲しいのかい？\n　仕方ねえなあ……」"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "夢魔がパートナーをホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　#{myname}の相手をしてもらおうか？」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　力、抜いてな？\n　今気持ちよくしてやるからさ……\\H」"
    when 2 #ホールドレジスト成功
    tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　さぁて、簡単にイくんじゃないぜ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　さぁて、簡単にイくんじゃないぜ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　眺めはどうだい……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おっと、こういうのは苦手かい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふっ、舐めてもいいぜ？\n　#{myname}も気持ちよくしてくれよ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふっ、舐めてもいいぜ？\n　#{myname}も気持ちよくしてくれよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}の相手をしてもらおうか？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　簡単には逃がしてやらないぜ？」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　簡単には逃がしてやらないぜ？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}の胸で溺れさせてやるぜ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、こっちには興味ないってか？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　力、抜いてな？\n　とろけさせてやるぜ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "クンニ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　じっとしてな、気持ちよくしてやるから」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　力、抜いてな……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「イヤだって？\n　やれやれ、怖がられたもんだね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」"
      tx["tx1"] = "「ふふ、しっかり咥えてなよ？」" if $msg.tag == "ディルド口挿入"
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」" if $msg.tag == "ディルド尻挿入"
      #自ら受け入れた場合
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」" if $game_switches[89] == true
      tx["tx1"] = "「ふふ、しっかり咥えてなよ？」" if $msg.tag == "ディルド口挿入" and $game_switches[89] == true
      tx["tx1"] = "「そぉら、全部入っちまったぜ……\\H」" if $msg.tag == "ディルド尻挿入" and $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
end #ability
 end #def
end #class
