=begin
#######################################################################################################################
 ●『デビル（緑）』レジスト実行口上（ホールド関連・対主人公）
 ●性格：勝ち気
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end





#######################################################################################################################
########################################★ホールド：主人公がメインの口上群#############################################
#######################################################################################################################
class MsgDevil_A < MsgBase
 def msg_hold_05
#==================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「ふふ……来るかい？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「さぁて……。\n　先に音を上げるのはどっちかな？」"
  when 3 #ホールド失敗
    tx["tx1"] = "「……っと思ったがまだ駄目だな。\n　ま、ゆっくりやろうぜ」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「おいおい、そこで止めるのは無しだろう？」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、やる気かい？\n　……#{giggle}」"
      tx["tx1"] = "「やっとかよ……\\H\n　待ちくたびれそうだったぜ？」" if $game_switches[86] == true #空腹戦
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　さ、どっちが先に音を上げるかな……？\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「ま、そう焦るなって。\n　もう少しのんびりやろうぜ？」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「おいおい、そこで止めるのかよ？」" if $game_switches[89] == true
      tx["md"] = "1" if $game_switches[89] == true
      tx["tx1"] = "「……今の状況だと、笑えない冗談だぜ？」" if $game_switches[86] == true #空腹戦
      tx["md"] = "1" if $game_switches[86] == true #空腹戦
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、どうした？」"
    when 2 #ホールド成功
      tx["tx1"] = "「何だよ、もう音を上げるのかい？\n　ま、こんなもんかねぇ……」"
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「ふふ、今何をしようとしたのかな？\n　怒らないから素直に言ってみな、ん？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「ふふ、大人しく逃がすと思ったかい？\n　このまま大人しくイかされな\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、何だぁ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「……ったく、良いところだったってのに。\n　この代償は高く付くぜ？」"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「さぁて、大人しくしてなよ？」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「おっと、抵抗しようってのかい？\n　ま、そのくらいの方が楽しめるがね」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「#{giggle}\n　簡単には逃がしてやらないぜ？」"
    #自ら受け入れた場合
    tx["tx1"] = "「#{giggle}\n　簡単には逃がしてやらないぜ？」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「さぁて……と。\n　そろそろいいかい？\\H」"
      tx["tx1"] = "「さぁて、覚悟しな……\\H」" if $game_switches[86] == true #空腹戦
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おいおい、そりゃないだろー？\n　#{target}、もう少し空気読んでくれよー」"
      tx["tx1"] = "「いい加減腹くくれよな？\n　どのみち喰われる運命なんだしさ\\H」" if $game_switches[86] == true #空腹戦
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　さぁて、先に音を上げるのはどっちかな……？\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、抵抗しないのかい？\n　それとも、期待してたのかな？\\H」" if $game_switches[89] == true
      tx["tx1"] = "「#{pleasure_s}\n　さぁて、たっぷりご馳走してくれよな\\H」" if $game_switches[86] == true #空腹戦
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　眺めはどうだい……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おっと、逃げられたか……。\n　ま、そのくらいでないと楽しめないか」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふ、油断大敵だぜ♪\n　このまま押しつぶしてやろうかな？」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふ、期待してたみたいだな？\n　んじゃ、リクエストにお応えしようか……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「さぁて、大人しくしてなよ？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おっと、抵抗しようってのかい？\n　ま、そのくらいの方が楽しめるがね」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　簡単には逃がしてやらないぜ？」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　簡単には逃がしてやらないぜ？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}の胸で溺れさせてやるぜ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、こっちには興味ないってか？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふ、捕まえたぜ？\n　簡単には逃がさねえからな？」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふ、期待してたみたいだな？\n　んじゃ、リクエストにお応えしようか……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{target}のキスの腕前、見せてくれよ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、自信ないのかい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　じっとしてな、気持ちよくしてやるから」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おっと、逃げられたか……。\n　ま、そのくらいでないと楽しめないか」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「さて……力、抜いてな？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おっと、逃げられたか……。\n　ま、そのくらいでないと楽しめないか」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　さぁて、楽しませてもらおうかな\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　さぁて、楽しませてもらおうかな\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class




















#######################################################################################################################
####################################★ホールド：主人公がメインの口上群（ベッドイン）###################################
#######################################################################################################################
class MsgDevil_A < MsgBase
 def msg_bedin_hold_05
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("大切な人")
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「ふふ……来るかい？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「さぁて……。\n　先に音を上げるのはどっちかな？」"
  when 3 #ホールド失敗
    tx["tx1"] = "「……っと思ったがまだ駄目だな。\n　ま、ゆっくりやろうぜ」"
    #途中で行動をキャンセルした場合
      tx["tx1"] = "「おいおい、そこで止めちゃダメだろ？」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　待ってたぜ、来なよ……\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}」"
    when 3 #ホールド失敗
      tx["tx1"] = "「おいおい、焦るなって。\n　#{myname}は逃げやしないから」"
      tx["md"] = "11" if $game_switches[89] == true
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「おいおい、そこで止めちゃダメだろ？」" if $game_switches[89] == true
      tx["md"] = "2" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、どうした？」"
    when 2 #ホールド成功
      tx["tx1"] = "「何だよ、もう音を上げるのかい？\n　ま、先は長いし、今回は見逃してやるぜ」"
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「ふふ、今何をしようとしたのかな？\n　怒らないから素直に言ってみな、ん？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「ふふ、そうはいかないぜ？\n　このまま大人しくイかされなよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、何だぁ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「……ったく、良いところだったってのに」"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「さぁて、大人しくしてなよ？」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「何だよ、いいじゃないか。\n　攻められるのは嫌いかい？」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{target}、行くよ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おいおい、そりゃないだろー？\n　#{target}、もう少し空気読んでくれよー」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、たっぷり味わってくれよな\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　眺めはどうだい……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「ふふ、逃げられちまったか♪\n　こういうのは嫌いかい？」"
      tx["md"] = "11"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふっ、舐めてもいいぜ？\n　#{myname}も気持ちよくしてくれよ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふっ、舐めてもいいぜ？\n　#{myname}も気持ちよくしてくれよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「さぁて、大人しくしてなよ？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、いいじゃないか。\n　攻められるのは嫌いかい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}の胸で溺れさせてやるぜ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、いいじゃないか。\n　攻められるのは嫌いかい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{target}、キスして……いいかい？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、いいじゃないかよー」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　じっとしてな、気持ちよくしてやるから」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、いいじゃないか。\n　攻められるのは嫌いかい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「さて……力、抜いてな？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おっと、逃げられたか……。\n　大丈夫だって、そのうち病み付きになるからさ♪」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　さぁて、楽しませてもらおうかな\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　さぁて、楽しませてもらおうかな\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("寵愛")
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「ふふ……来るかい？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「さぁて……。\n　先に音を上げるのはどっちかな？」"
  when 3 #ホールド失敗
    tx["tx1"] = "「……っと思ったがまだ駄目だな。\n　ま、ゆっくりやろうぜ」"
    #途中で行動をキャンセルした場合
      tx["tx1"] = "「おいおい、そこで止めちゃダメだろ？」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　待ってたぜ、来なよ……\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}」"
    when 3 #ホールド失敗
      tx["tx1"] = "「おいおい、焦るなって。\n　#{myname}は逃げやしないから」"
      tx["md"] = "11" if $game_switches[89] == true
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「おいおい、そこで止めちゃダメだろ？」" if $game_switches[89] == true
      tx["md"] = "2" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、どうした？」"
    when 2 #ホールド成功
      tx["tx1"] = "「何だよ、もう音を上げるのかい？\n　ま、先は長いし、今回は見逃してやるぜ」"
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「ふふ、今何をしようとしたのかな？\n　怒らないから素直に言ってみな、ん？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「ふふ、そうはいかないぜ？\n　このまま大人しくイかされなよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、何だぁ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「……ったく、良いところだったってのに」"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「さぁて、大人しくしてなよ？」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「何だよ、いいじゃないか。\n　攻められるのは嫌いかい？」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{target}、行くよ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おいおい、そりゃないだろー？\n　#{target}、もう少し空気読んでくれよー」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、たっぷり味わってくれよな\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　眺めはどうだい……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「ふふ、逃げられちまったか♪\n　こういうのは嫌いかい？」"
      tx["md"] = "11"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふっ、舐めてもいいぜ？\n　#{myname}も気持ちよくしてくれよ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふっ、舐めてもいいぜ？\n　#{myname}も気持ちよくしてくれよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「さぁて、大人しくしてなよ？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、いいじゃないか。\n　攻められるのは嫌いかい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}の胸で溺れさせてやるぜ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、いいじゃないか。\n　攻められるのは嫌いかい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{target}、キスして……いいかい？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、いいじゃないかよー」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　じっとしてな、気持ちよくしてやるから」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、いいじゃないか。\n　攻められるのは嫌いかい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「さて……力、抜いてな？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おっと、逃げられたか……。\n　大丈夫だって、そのうち病み付きになるからさ♪」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　さぁて、楽しませてもらおうかな\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　さぁて、楽しませてもらおうかな\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「ふふ……来るかい？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「さぁて……。\n　先に音を上げるのはどっちかな？」"
  when 3 #ホールド失敗
    tx["tx1"] = "「……っと思ったがまだ駄目だな。\n　ま、ゆっくりやろうぜ」"
    #途中で行動をキャンセルした場合
      tx["tx1"] = "「おいおい、そこで止めちゃダメだろ？」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　待ってたぜ、来なよ……\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}」"
    when 3 #ホールド失敗
      tx["tx1"] = "「おいおい、焦るなって。\n　#{myname}は逃げやしないから」"
      tx["md"] = "11" if $game_switches[89] == true
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「おいおい、そこで止めちゃダメだろ？」" if $game_switches[89] == true
      tx["md"] = "2" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、どうした？」"
    when 2 #ホールド成功
      tx["tx1"] = "「何だよ、もう音を上げるのかい？\n　ま、先は長いし、今回は見逃してやるぜ」"
      tx["md"] = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「ふふ、今何をしようとしたのかな？\n　怒らないから素直に言ってみな、ん？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「ふふ、そうはいかないぜ？\n　このまま大人しくイかされなよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「おっと、何だぁ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「……ったく、良いところだったってのに」"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{target}はそこでゆっくり見てなよ。\n　刺激的だろ、こういうのも？\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「さぁて、大人しくしてなよ？」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「何だよ、いいじゃないか。\n　攻められるのは嫌いかい？」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{target}、行くよ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おいおい、そりゃないだろー？\n　#{target}、もう少し空気読んでくれよー」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　ふふ、たっぷり味わってくれよな\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　眺めはどうだい……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「ふふ、逃げられちまったか♪\n　こういうのは嫌いかい？」"
      tx["md"] = "11"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふっ、舐めてもいいぜ？\n　#{myname}も気持ちよくしてくれよ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふっ、舐めてもいいぜ？\n　#{myname}も気持ちよくしてくれよ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「さぁて、大人しくしてなよ？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、いいじゃないか。\n　攻められるのは嫌いかい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}の胸で溺れさせてやるぜ……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、いいじゃないか。\n　攻められるのは嫌いかい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　待ってな、今気持ちよくしてやるよ♪」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{target}、キスして……いいかい？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、いいじゃないかよー」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　じっとしてな、気持ちよくしてやるから」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「何だよ、いいじゃないか。\n　攻められるのは嫌いかい？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「んむ……っ\\H\n　ふふ……じゅるっ……\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「さて……力、抜いてな？」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「おっと、逃げられたか……。\n　大丈夫だって、そのうち病み付きになるからさ♪」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　さぁて、楽しませてもらおうかな\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　さぁて、楽しませてもらおうかな\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
end #ability
 end #def
end #class
