=begin
#######################################################################################################################
 ●『レッサーサキュバス（桃）』レジスト実行口上（ホールド関連・対パートナー）
 ●性格：好色
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end






#######################################################################################################################
########################################★ホールド：パートナーがメインの口上群#############################################
#######################################################################################################################
class MsgLessersuccubus_B < MsgBase
 def msg_female_hold_00
#==================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "パートナーが夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　何をシてくれるのかなぁ？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「やぁん\\H\n　ね、続き早く早くぅ\\H」"
  when 3 #ホールド失敗
    tx["tx1"] = "「まだダ～メ\\H」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「も～、\n　焦らしちゃやだよぉ……\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　来てぇ……\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　擦れちゃう……っ\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」" if $game_switches[89] == true
      tx["md"]  = "10"
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}に舐めて欲しいのかなぁ？」"
      tx["tx1"] = "「#{giggle}\n　もうびしょびしょだね……\\H\n　#{myname}に舐めて欲しいのかなぁ？」" if $msg.t_target.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "「#{giggle}\n　アソコがひくひくしてるよぉ？\\H\n　#{myname}に舐めて欲しいのかなぁ？」" if $msg.t_target.crisis? #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "「んむっ……\\H\n　いいよ、いっぱいシてあげる……\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　だ～めっ、また後でね\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　遠慮しなくていいのに\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ソレで気持ちよくしてくれるの……？\\H\n　ちょっとドキドキしちゃう♪」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「#{pleasure_s}\n　すっごく硬ぁい……\\H」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　気持ちよくなりたくないのぉ？」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)

  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　今いいところだったのにぃ……。\n　邪魔しちゃダメだってばぁ」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　そこでゆっくり見てて\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　そこでゆっくり見てて\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "夢魔がパートナーをホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　気持ちよくしてあげる\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～っ……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「抵抗しないんだね～。\n　ひょっとして、期待してた？\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、一緒に気持ちよくなろっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　擦れちゃう……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　擦れちゃう……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、舐めてくれる……？」"
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、びしょびしょなの……\\H\n　舐めてくれないかなぁ……？\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　いっぱいぺろぺろしてね\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　いっぱいぺろぺろしてね\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「それ～っ♪\n　くっついちゃうぞっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、逃げないでよぉ……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　いっぱい気持ちよくしてあげる\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　ふふ、逃げないんだね、#{target}？\n　ひょっとして、期待してた？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}、おっぱいには自信あるんだぁ♪\n　……確かめてみて？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「ええ～？\n　やらないのぉ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　いっぱいキス、して……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_s}\n　……#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "クンニ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}のお口でぺろぺろしてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　今からコレで犯してあげる♪\n　力、抜いててね～……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　全部入っちゃったぁ……\\H\n　それじゃ、動かすね？」"
      tx["tx1"] = "「#{giggle}\n　しっかりぺろぺろしてね\\H」" if $msg.tag == "ディルド口挿入"
      tx["tx1"] = "「#{giggle}\n　お尻にすっぽり入っちゃったぁ……\\H\n　それじゃ、動かすね？」" if $msg.tag == "ディルド尻挿入"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　全部入っちゃったぁ……\\H\n　それじゃ、動かすね？」" if $game_switches[89] == true
      tx["tx1"] = "「#{giggle}\n　しっかりぺろぺろしてね\\H」" if $msg.tag == "ディルド口挿入" and $game_switches[89] == true
      tx["tx1"] = "「#{giggle}\n　お尻にすっぽり入っちゃったぁ……\\H\n　それじゃ、動かすね？」" if $msg.tag == "ディルド尻挿入" and $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class




















#######################################################################################################################
####################################★ホールド：パートナーがメインの口上群（ベッドイン）###################################
#######################################################################################################################
class MsgLessersuccubus_B < MsgBase
 def msg_female_bedin_hold_00
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("大切な人")
#====================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "パートナーが夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　何をシてくれるのかなぁ？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「やぁん\\H\n　ね、続き早く早くぅ\\H」"
  when 3 #ホールド失敗
    tx["tx1"] = "「まだダ～メ\\H」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「も～、\n　焦らしちゃやだよぉ……\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　来てぇ……\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　擦れちゃう……っ\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」" if $game_switches[89] == true
      tx["md"]  = "10"
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}に舐めて欲しいのかなぁ？」"
      tx["tx1"] = "「#{giggle}\n　もうびしょびしょだね……\\H\n　#{myname}に舐めて欲しいのかなぁ？」" if $msg.t_target.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "「#{giggle}\n　アソコがひくひくしてるよぉ？\\H\n　#{myname}に舐めて欲しいのかなぁ？」" if $msg.t_target.crisis? #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "「んむっ……\\H\n　いいよ、いっぱいシてあげる……\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　だ～めっ、また後でね\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　遠慮しなくていいのに\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ソレで気持ちよくしてくれるの……？\\H\n　ちょっとドキドキしちゃう♪」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「#{pleasure_s}\n　すっごく硬ぁい……\\H」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　気持ちよくなりたくないのぉ？」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)

  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　今いいところだったのにぃ……。\n　邪魔しちゃダメだってばぁ」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　そこでゆっくり見てて\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　そこでゆっくり見てて\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "夢魔がパートナーをホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　気持ちよくしてあげる\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～っ……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「抵抗しないんだね～。\n　ひょっとして、期待してた？\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、一緒に気持ちよくなろっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　擦れちゃう……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　擦れちゃう……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、舐めてくれる……？」"
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、びしょびしょなの……\\H\n　舐めてくれないかなぁ……？\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　いっぱいぺろぺろしてね\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　いっぱいぺろぺろしてね\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「それ～っ♪\n　くっついちゃうぞっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、逃げないでよぉ……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　いっぱい気持ちよくしてあげる\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　ふふ、逃げないんだね、#{target}？\n　ひょっとして、期待してた？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}、おっぱいには自信あるんだぁ♪\n　……確かめてみて？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「ええ～？\n　やらないのぉ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　いっぱいキス、して……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_s}\n　……#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "クンニ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}のお口でぺろぺろしてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　今からコレで犯してあげる♪\n　力、抜いててね～……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　全部入っちゃったぁ……\\H\n　それじゃ、動かすね？」"
      tx["tx1"] = "「#{giggle}\n　しっかりぺろぺろしてね\\H」" if $msg.tag == "ディルド口挿入"
      tx["tx1"] = "「#{giggle}\n　お尻にすっぽり入っちゃったぁ……\\H\n　それじゃ、動かすね？」" if $msg.tag == "ディルド尻挿入"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　全部入っちゃったぁ……\\H\n　それじゃ、動かすね？」" if $game_switches[89] == true
      tx["tx1"] = "「#{giggle}\n　しっかりぺろぺろしてね\\H」" if $msg.tag == "ディルド口挿入" and $game_switches[89] == true
      tx["tx1"] = "「#{giggle}\n　お尻にすっぽり入っちゃったぁ……\\H\n　それじゃ、動かすね？」" if $msg.tag == "ディルド尻挿入" and $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("寵愛")
#====================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "パートナーが夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　何をシてくれるのかなぁ？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「やぁん\\H\n　ね、続き早く早くぅ\\H」"
  when 3 #ホールド失敗
    tx["tx1"] = "「まだダ～メ\\H」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「も～、\n　焦らしちゃやだよぉ……\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　来てぇ……\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　擦れちゃう……っ\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」" if $game_switches[89] == true
      tx["md"]  = "10"
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}に舐めて欲しいのかなぁ？」"
      tx["tx1"] = "「#{giggle}\n　もうびしょびしょだね……\\H\n　#{myname}に舐めて欲しいのかなぁ？」" if $msg.t_target.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "「#{giggle}\n　アソコがひくひくしてるよぉ？\\H\n　#{myname}に舐めて欲しいのかなぁ？」" if $msg.t_target.crisis? #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "「んむっ……\\H\n　いいよ、いっぱいシてあげる……\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　だ～めっ、また後でね\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　遠慮しなくていいのに\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ソレで気持ちよくしてくれるの……？\\H\n　ちょっとドキドキしちゃう♪」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「#{pleasure_s}\n　すっごく硬ぁい……\\H」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　気持ちよくなりたくないのぉ？」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)

  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　今いいところだったのにぃ……。\n　邪魔しちゃダメだってばぁ」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　そこでゆっくり見てて\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　そこでゆっくり見てて\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "夢魔がパートナーをホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　気持ちよくしてあげる\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～っ……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「抵抗しないんだね～。\n　ひょっとして、期待してた？\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、一緒に気持ちよくなろっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　擦れちゃう……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　擦れちゃう……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、舐めてくれる……？」"
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、びしょびしょなの……\\H\n　舐めてくれないかなぁ……？\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　いっぱいぺろぺろしてね\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　いっぱいぺろぺろしてね\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「それ～っ♪\n　くっついちゃうぞっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、逃げないでよぉ……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　いっぱい気持ちよくしてあげる\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　ふふ、逃げないんだね、#{target}？\n　ひょっとして、期待してた？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}、おっぱいには自信あるんだぁ♪\n　……確かめてみて？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「ええ～？\n　やらないのぉ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　いっぱいキス、して……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_s}\n　……#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "クンニ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}のお口でぺろぺろしてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　今からコレで犯してあげる♪\n　力、抜いててね～……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　全部入っちゃったぁ……\\H\n　それじゃ、動かすね？」"
      tx["tx1"] = "「#{giggle}\n　しっかりぺろぺろしてね\\H」" if $msg.tag == "ディルド口挿入"
      tx["tx1"] = "「#{giggle}\n　お尻にすっぽり入っちゃったぁ……\\H\n　それじゃ、動かすね？」" if $msg.tag == "ディルド尻挿入"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　全部入っちゃったぁ……\\H\n　それじゃ、動かすね？」" if $game_switches[89] == true
      tx["tx1"] = "「#{giggle}\n　しっかりぺろぺろしてね\\H」" if $msg.tag == "ディルド口挿入" and $game_switches[89] == true
      tx["tx1"] = "「#{giggle}\n　お尻にすっぽり入っちゃったぁ……\\H\n　それじゃ、動かすね？」" if $msg.tag == "ディルド尻挿入" and $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
#■パートナーが夢魔をホールドする
if $msg.tag == "パートナーが夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　何をシてくれるのかなぁ？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「やぁん\\H\n　ね、続き早く早くぅ\\H」"
  when 3 #ホールド失敗
    tx["tx1"] = "「まだダ～メ\\H」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「も～、\n　焦らしちゃやだよぉ……\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　来てぇ……\\H」"
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　擦れちゃう……っ\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」" if $game_switches[89] == true
      tx["md"]  = "10"
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}に舐めて欲しいのかなぁ？」"
      tx["tx1"] = "「#{giggle}\n　もうびしょびしょだね……\\H\n　#{myname}に舐めて欲しいのかなぁ？」" if $msg.t_target.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "「#{giggle}\n　アソコがひくひくしてるよぉ？\\H\n　#{myname}に舐めて欲しいのかなぁ？」" if $msg.t_target.crisis? #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "「んむっ……\\H\n　いいよ、いっぱいシてあげる……\\H」"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　だ～めっ、また後でね\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　遠慮しなくていいのに\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルド系▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ソレで気持ちよくしてくれるの……？\\H\n　ちょっとドキドキしちゃう♪」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「#{pleasure_s}\n　すっごく硬ぁい……\\H」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あぁん……。\n　焦らさないでよぉ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　気持ちよくなりたくないのぉ？」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)

  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　今いいところだったのにぃ……。\n　邪魔しちゃダメだってばぁ」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　そこでゆっくり見てて\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　そこでゆっくり見てて\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  end

  #▼殆どのホールドは汎用口上で行う▼*************************************************************************
  #▼必要なら別途設定のこと▼*********************************************************************************
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔がパートナーをホールドする
elsif $msg.tag == "夢魔がパートナーをホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　気持ちよくしてあげる\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～っ……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「抵抗しないんだね～。\n　ひょっとして、期待してた？\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼シェルマッチ▼*****************************************************************************************
  #====================================================================================================================
  when "貝合わせ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　ね、一緒に気持ちよくなろっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{pleasure_s}\n　擦れちゃう……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　擦れちゃう……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、舐めてくれる……？」"
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、びしょびしょなの……\\H\n　舐めてくれないかなぁ……？\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　いっぱいぺろぺろしてね\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　いっぱいぺろぺろしてね\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「それ～っ♪\n　くっついちゃうぞっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、逃げないでよぉ……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　いっぱい気持ちよくしてあげる\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　ふふ、逃げないんだね、#{target}？\n　ひょっとして、期待してた？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ヘブンリーフィール▼*********************************************************************************
  #====================================================================================================================
  when "ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}、おっぱいには自信あるんだぁ♪\n　……確かめてみて？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「ええ～？\n　やらないのぉ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　いっぱいキス、して……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_s}\n　……#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ドロウネクター▼*********************************************************************************
  #====================================================================================================================
  when "クンニ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}のお口でぺろぺろしてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインサート▼*********************************************************************************
  #====================================================================================================================
  when "ディルド♀挿入","ディルド口挿入","ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　今からコレで犯してあげる♪\n　力、抜いててね～……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　全部入っちゃったぁ……\\H\n　それじゃ、動かすね？」"
      tx["tx1"] = "「#{giggle}\n　しっかりぺろぺろしてね\\H」" if $msg.tag == "ディルド口挿入"
      tx["tx1"] = "「#{giggle}\n　お尻にすっぽり入っちゃったぁ……\\H\n　それじゃ、動かすね？」" if $msg.tag == "ディルド尻挿入"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　全部入っちゃったぁ……\\H\n　それじゃ、動かすね？」" if $game_switches[89] == true
      tx["tx1"] = "「#{giggle}\n　しっかりぺろぺろしてね\\H」" if $msg.tag == "ディルド口挿入" and $game_switches[89] == true
      tx["tx1"] = "「#{giggle}\n　お尻にすっぽり入っちゃったぁ……\\H\n　それじゃ、動かすね？」" if $msg.tag == "ディルド尻挿入" and $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
end #ability
 end #def
end #class
