=begin
#######################################################################################################################
 ●『レッサーサキュバス（桃）』レジスト実行口上（ホールド関連・対主人公）
 ●性格：好色
 version 1.0.0
#######################################################################################################################
 ◆更新履歴
 20xx,xx/xx     何かしら追加を行ったらここに書いてね
#######################################################################################################################
=end






#######################################################################################################################
########################################★ホールド：主人公がメインの口上群#############################################
#######################################################################################################################
class MsgLessersuccubus_B < MsgBase
 def msg_hold_00
#==================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　何をシてくれるのかなぁ？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「やぁん\\H\n　ね、続き早く早くぅ\\H」"
  when 3 #ホールド失敗
    tx["tx1"] = "「まだダ～メ\\H」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「も～、\n　焦らしちゃやだよぉ……\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「え、もう入れちゃうの？」"
      tx["tx1"] = "「いやぁ～ん、犯されちゃう～っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　もぉ、強引なんだからぁ……\\H」"
      tx["tx1"] = "「#{pleasure_s}\n　おっきいのが入ってきたぁ……っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールド失敗
      tx["tx1"] = "「まだダメだってばぁ。\n　もう少し女の子は優しく扱ってよね～？」"
      tx["tx1"] = "「#{giggle}\n　まださせてあ～げないっ♪」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　焦らないで、ね？\\H」" if $game_switches[89] == true
      tx["tx1"] = "「もう、焦らしちゃやだよぉ……\n　早く#{myname}を犯してぇ……\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["md"]  = "11" if $game_switches[89] == true or $msg.t_enemy.lub_female > 30 #潤滑度30以上
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　気持ちよくなりたくないのぉ？」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　今いいところだったのにぃ……。\n　邪魔しちゃダメだよ、#{target}？」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{target}は入れてあ～げないっ\\H\n　そこでゆっくり見てて\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　#{target}は入れてあ～げないっ\\H\n　そこでゆっくり見てて\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　気持ちよくしてあげる\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～っ……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「抵抗しないんだね～。\n　ひょっとして、期待してた？\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ちょっと早いけど……。\n　たべちゃうぞ～っ\\H」"
      tx["tx1"] = "「#{giggle}\n　た～べちゃうぞ～っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "「#{giggle}\n　覚悟してねぇ、#{target}……\\H」" if $game_switches[86] == true #空腹戦
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
      tx["tx1"] = "「あぁん、逃げないでぇ？\n　本気で食べたりしないからぁ……\\H」" if $game_switches[86] == true #空腹戦
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あうぅ……。\n　ちょ、ちょっとキツいかも……\\H」"
      tx["tx1"] = "「あはぁっ\\H\n　おっきいのが入ってきたぁ……っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "「あはぁっ\\H\n　これが欲しかったんだぁ……っ\\H」" if $game_switches[86] == true #空腹戦
      #自ら受け入れた場合
      tx["tx1"] = "「あぁんっ！\\H\n　お、奥まで入っちゃった……\\H」" if $game_switches[89] == true
      tx["tx1"] = "「あぁんっ！\\H\n　するって奥まで入っちゃった……\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["tx1"] = "「あはぁっ\\H\n　これが欲しかったんだぁ……っ\\H」" if $game_switches[86] == true #空腹戦
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、舐めてくれる……？」"
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、びしょびしょなの……\\H\n　舐めてくれないかなぁ……？\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　いっぱいぺろぺろしてね\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　そんなにがっつかなくても大丈夫だってばぁ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「それ～っ♪\n　くっついちゃうぞっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、逃げないでよぉ……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　いっぱい気持ちよくしてあげる\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　ふふ、逃げないんだね、#{target}？\n　ひょっとして、期待してた？」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}、おっぱいには自信あるんだぁ♪\n　……確かめてみて？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「ええ～？\n　やらないのぉ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　いっぱいキス、して……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_s}\n　……#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}のお口でシてあげる\\H」"
      tx["tx1"] = "「ねぇ……#{target}……？\n　#{myname}のお口、犯してくれる……？\\H」" if $game_switches[86] == true #空腹戦
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　逃げたらダメだってばぁ！」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「……#{giggle}\n　#{target}、力抜いててね～……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あはっ、冗談冗談\\H\n　……半分くらいね♪」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふっ……\\H\n　#{target}、女の子みたい……\\H\n　今から、いっぱい犯してあげるね\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふっ……\\H\n　#{target}、女の子みたい……\\H\n　今から、いっぱい犯してあげるね\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
 end #def
end #class




















#######################################################################################################################
####################################★ホールド：主人公がメインの口上群（ベッドイン）###################################
#######################################################################################################################
class MsgLessersuccubus_B < MsgBase
 def msg_bedin_hold_00
#====================================================================================================================
#★友好度の状態によって口上が変動
#====================================================================================================================





#====================================================================================================================
#◆【大事な人】状態◆
if $msg.t_enemy.have_ability?("大切な人")
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　何をシてくれるのかなぁ？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「やぁん\\H\n　ね、続き早く早くぅ\\H」"
  when 3 #ホールド失敗
    tx["tx1"] = "「まだダ～メ\\H」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「も～、\n　焦らしちゃやだよぉ……\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あはっ、もう入れたくなっちゃった？」"
      tx["tx1"] = "「やぁ～ん、早く犯してぇ～っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　もぉ、強引なんだからぁ……\\H」"
      tx["tx1"] = "「#{pleasure_s}\n　#{target}が入ってきたぁ……っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールド失敗
      tx["tx1"] = "「まだダメ～っ\\H\n　もう少し女の子は優しく扱ってよね～♪」"
      tx["tx1"] = "「#{giggle}\n　まださせてあ～げないっ♪」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　焦らないで、ね？\\H」" if $game_switches[89] == true
      tx["tx1"] = "「もう、焦らしちゃやだよぉ……\n　早く#{myname}を犯してぇ……\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["md"]  = "11"
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　気持ちよくなりたくないのぉ？」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「仕方が無いなあ……\\H\n　じゃ、次は#{target}を攻めてあげる\\H」"
      tx["md"]  = "12"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{target}はそこでゆっくり見てて\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　#{target}はそこでゆっくり見てて\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　気持ちよくしてあげる\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～っ……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「抵抗しないんだね～。\n　ひょっとして、期待してた？\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ちょっと早いけど……。\n　たべちゃうぞ～っ\\H」"
      tx["tx1"] = "「#{giggle}\n　た～べちゃうぞ～っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あぁんっ！\\H\n　お、奥まで入っちゃった……\\H」"
      tx["tx1"] = "「あぁんっ！\\H\n　するって奥まで入っちゃった……\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #自ら受け入れた場合
      tx["tx1"] = "「あぁんっ！\\H\n　お、奥まで入っちゃった……\\H」" if $game_switches[89] == true
      tx["tx1"] = "「あぁんっ！\\H\n　するって奥まで入っちゃった……\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、舐めてくれる……？」"
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、びしょびしょなの……\\H\n　舐めてくれないかなぁ……？\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　いっぱいぺろぺろしてね\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　そんなにがっつかなくても大丈夫だってばぁ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「それ～っ♪\n　くっついちゃうぞっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　いっぱい気持ちよくしてあげる\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　い～っぱい気持ちよくしてあげちゃう\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}のおっぱい、使ってみる……？♪\n　……#{target}だったら、いいよ？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「ええ～？\n　やらないのぉ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　いっぱいキス、して……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_s}\n　……#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}のお口でシてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「……#{giggle}\n　#{target}、力抜いててね～……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あはっ、冗談冗談\\H\n　……半分くらいね♪」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふっ……\\H\n　#{target}、女の子みたい……\\H\n　今から、いっぱい犯してあげるね\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふっ……\\H\n　#{target}、女の子みたい……\\H\n　今から、いっぱい犯してあげるね\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end















#====================================================================================================================
#◆【寵愛】状態◆
elsif $msg.t_enemy.have_ability?("寵愛")
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　何をシてくれるのかなぁ？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「やぁん\\H\n　ね、続き早く早くぅ\\H」"
  when 3 #ホールド失敗
    tx["tx1"] = "「まだダ～メ\\H」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「も～、\n　焦らしちゃやだよぉ……\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あはっ、もう入れたくなっちゃった？」"
      tx["tx1"] = "「やぁ～ん、早く犯してぇ～っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　もぉ、強引なんだからぁ……\\H」"
      tx["tx1"] = "「#{pleasure_s}\n　#{target}が入ってきたぁ……っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールド失敗
      tx["tx1"] = "「まだダメ～っ\\H\n　もう少し女の子は優しく扱ってよね～♪」"
      tx["tx1"] = "「#{giggle}\n　まださせてあ～げないっ♪」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　焦らないで、ね？\\H」" if $game_switches[89] == true
      tx["tx1"] = "「もう、焦らしちゃやだよぉ……\n　早く#{myname}を犯してぇ……\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["md"]  = "11"
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　気持ちよくなりたくないのぉ？」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「仕方が無いなあ……\\H\n　じゃ、次は#{target}を攻めてあげる\\H」"
      tx["md"]  = "12"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{target}はそこでゆっくり見てて\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　#{target}はそこでゆっくり見てて\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　気持ちよくしてあげる\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～っ……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「抵抗しないんだね～。\n　ひょっとして、期待してた？\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ちょっと早いけど……。\n　たべちゃうぞ～っ\\H」"
      tx["tx1"] = "「#{giggle}\n　た～べちゃうぞ～っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あぁんっ！\\H\n　お、奥まで入っちゃった……\\H」"
      tx["tx1"] = "「あぁんっ！\\H\n　するって奥まで入っちゃった……\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #自ら受け入れた場合
      tx["tx1"] = "「あぁんっ！\\H\n　お、奥まで入っちゃった……\\H」" if $game_switches[89] == true
      tx["tx1"] = "「あぁんっ！\\H\n　するって奥まで入っちゃった……\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、舐めてくれる……？」"
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、びしょびしょなの……\\H\n　舐めてくれないかなぁ……？\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　いっぱいぺろぺろしてね\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　そんなにがっつかなくても大丈夫だってばぁ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「それ～っ♪\n　くっついちゃうぞっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　いっぱい気持ちよくしてあげる\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　い～っぱい気持ちよくしてあげちゃう\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}のおっぱい、使ってみる……？♪\n　……#{target}だったら、いいよ？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「ええ～？\n　やらないのぉ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　いっぱいキス、して……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_s}\n　……#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}のお口でシてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「……#{giggle}\n　#{target}、力抜いててね～……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あはっ、冗談冗談\\H\n　……半分くらいね♪」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふっ……\\H\n　#{target}、女の子みたい……\\H\n　今から、いっぱい犯してあげるね\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふっ……\\H\n　#{target}、女の子みたい……\\H\n　今から、いっぱい犯してあげるね\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end














#====================================================================================================================
#◆通常状態(【寵愛】【大切な人】どちらも持っていない場合)◆
else
#====================================================================================================================
#■主人公が夢魔をホールドする
if $msg.tag == "主人公が夢魔をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　何をシてくれるのかなぁ？\\H」"
  when 2 #ホールド成功
    tx["tx1"] = "「やぁん\\H\n　ね、続き早く早くぅ\\H」"
  when 3 #ホールド失敗
    tx["tx1"] = "「まだダ～メ\\H」"
    #途中で行動をキャンセルした場合
    tx["tx1"] = "「も～、\n　焦らしちゃやだよぉ……\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが上がる
                              tx["md"] = "3"
                            when 3 #アクターが失敗するとムードが下がる
                              tx["md"] = "2"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼インサート▼****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♂側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あはっ、もう入れたくなっちゃった？」"
      tx["tx1"] = "「やぁ～ん、早く犯してぇ～っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールド成功
      tx["tx1"] = "「#{pleasure_s}\n　もぉ、強引なんだからぁ……\\H」"
      tx["tx1"] = "「#{pleasure_s}\n　#{target}が入ってきたぁ……っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 3 #ホールド失敗
      tx["tx1"] = "「まだダメ～っ\\H\n　もう少し女の子は優しく扱ってよね～♪」"
      tx["tx1"] = "「#{giggle}\n　まださせてあ～げないっ♪」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　焦らないで、ね？\\H」" if $game_switches[89] == true
      tx["tx1"] = "「もう、焦らしちゃやだよぉ……\n　早く#{myname}を犯してぇ……\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
      tx["md"]  = "11"
    end
    #格納
    ms.push(tx)
  #▼リリース(自分のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "自分ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「も～、\n　気持ちよくなりたくないのぉ？」"
      tx["md"]  = "2"
    when 3 #ホールド失敗
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「だ～め♪\n　離してあげないもんね\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  #▼インタラプト(仲間のホールド解除)▼*********************************************************************************
  #====================================================================================================================
  when "仲間ホールド解除"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「あぁん、どうしたのぉ？」"
    when 2 #ホールド成功
      tx["tx1"] = "「仕方が無いなあ……\\H\n　じゃ、次は#{target}を攻めてあげる\\H」"
      tx["md"]  = "12"
    when 3 #ホールド失敗
      tx["tx1"] = "「#{giggle}\n　#{target}はそこでゆっくり見てて\\H」"
      #途中で行動をキャンセルした場合
      tx["tx1"] = "「#{giggle}\n　#{target}はそこでゆっくり見てて\\H」" if $game_switches[89] == true
      tx["md"]  = "12"
    end
    #格納
    ms.push(tx)
  end
  #==================================================================================================================
#----------------------------------------------------------------------------------------------------------------------
#■夢魔が主人公をホールドする
elsif $msg.tag == "夢魔が主人公をホールド"
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  #●基礎口上を設定(未設定項目or空白の口上が呼ばれた時に設定され、それ以外では表示されない)
  #==================================================================================================================
  case $msg.talk_step
  when 1 #ホールドレジスト中
    tx["tx1"] = "「#{giggle}\n　気持ちよくしてあげる\\H」"
  when 2 #ホールドレジスト成功
    tx["tx1"] = "「む～っ……」"
  when 3 #ホールドレジスト失敗
    tx["tx1"] = "「つっかま～えたっ♪」"
    #自ら受け入れた場合
    tx["tx1"] = "「抵抗しないんだね～。\n　ひょっとして、期待してた？\\H」" if $game_switches[89] == true
  end
  #格納
  ms.push(tx)
  #==================================================================================================================
  # ☆事前設定☆
                            #空ハッシュ挿入
                            tx={}
                            #ムード格納(個別変更の場合は口上単位で修正する)
                            case $msg.talk_step
                            when 2 #アクターが成功するとムードが下がる
                              tx["md"] = "2"
                            when 3 #アクターが失敗するとムードが上がる
                              tx["md"] = "3"
                            end
  #==================================================================================================================
  case $msg.at_type
  #▼アクセプト▼*****************************************************************************************
  #====================================================================================================================
  when "♀挿入：♀側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ちょっと早いけど……。\n　たべちゃうぞ～っ\\H」"
      tx["tx1"] = "「#{giggle}\n　た～べちゃうぞ～っ\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あぁんっ！\\H\n　お、奥まで入っちゃった……\\H」"
      tx["tx1"] = "「あぁんっ！\\H\n　するって奥まで入っちゃった……\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
      #自ら受け入れた場合
      tx["tx1"] = "「あぁんっ！\\H\n　お、奥まで入っちゃった……\\H」" if $game_switches[89] == true
      tx["tx1"] = "「あぁんっ！\\H\n　するって奥まで入っちゃった……\\H」" if $game_switches[89] == true and $msg.t_enemy.lub_female > 30 #潤滑度30以上
    end
    #格納
    ms.push(tx)

  #▼騎乗系▼***********************************************************************************
  #====================================================================================================================
  when "顔面騎乗","尻騎乗"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、舐めてくれる……？」"
      tx["tx1"] = "「ねぇ、#{target}……？\n　#{myname}のココ、びしょびしょなの……\\H\n　舐めてくれないかなぁ……？\\H」" if $msg.t_enemy.lub_female > 30 #潤滑度30以上
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　いっぱいぺろぺろしてね\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{pleasure_s}\n　そんなにがっつかなくても大丈夫だってばぁ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼エンブレイス▼*********************************************************************************
  #====================================================================================================================
  when "背面拘束"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「それ～っ♪\n　くっついちゃうぞっ\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「つっかま～えたっ♪\n　いっぱい気持ちよくしてあげる\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「つっかま～えたっ♪\n　い～っぱい気持ちよくしてあげちゃう\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)


  #▼胸系▼*********************************************************************************
  #====================================================================================================================
  when "パイズリ","ぱふぱふ"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}のおっぱい、使ってみる……？♪\n　……#{target}だったら、いいよ？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「ええ～？\n　やらないのぉ？」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{giggle}\n　柔らかいでしょ～\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼フラッタナイズ▼*********************************************************************************
  #====================================================================================================================
  when "キッス"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「ねぇ、#{target}……？\n　いっぱいキス、して……\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あぁん、#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「#{kiss_s}\n　……#{giggle}」"
      #自ら受け入れた場合
      tx["tx1"] = "「#{kiss_l}\n　……#{giggle}」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼オーラルアクセプト▼*********************************************************************************
  #====================================================================================================================
  when "口挿入：口側"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「#{giggle}\n　#{myname}のお口でシてあげる\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「も～、\n　#{target}のいじわる……」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「あむっ……んふぅ……っ\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #▼ディルドインバック▼*********************************************************************************
  #====================================================================================================================
  when "ディルド尻挿入"
  #====================================================================================================================
    case $msg.talk_step
    when 1 #ホールドレジスト中
      tx["tx1"] = "「……#{giggle}\n　#{target}、力抜いててね～……？\\H」"
    when 2 #ホールドレジスト成功
      tx["tx1"] = "「あはっ、冗談冗談\\H\n　……半分くらいね♪」"
    when 3 #ホールドレジスト失敗
      tx["tx1"] = "「ふふっ……\\H\n　#{target}、女の子みたい……\\H\n　今から、いっぱい犯してあげるね\\H」"
      #自ら受け入れた場合
      tx["tx1"] = "「ふふっ……\\H\n　#{target}、女の子みたい……\\H\n　今から、いっぱい犯してあげるね\\H」" if $game_switches[89] == true
    end
    #格納
    ms.push(tx)

  #====================================================================================================================
  end
end
#----------------------------------------------------------------------------------------------------------------------
end #ability
 end #def
end #class
